{
    "title": "Кривава Пастка",
    "description": "Бій під Жовтими Водами. Козаки при підтримці татар повністю винищили каральний загін, який було послано Потоцьким для руйнування Січі. В цій історії ви перевтілитесь у козака в найважливіший момент битви - влаштування засідки та повного винищення польських карателів.",
    "authors": "Сава Теслюк",
    "root": {
        "endType": null,
        "next": [
            {
                "text": "Побігти в лісок",
                "nextPage": {
                    "endType": null,
                    "next": [
                        {
                            "text": "Стати до ожиги",
                            "nextPage": {
                                "endType": null,
                                "next": [
                                    {
                                        "text": "Відповзти в глиб лісу",
                                        "nextPage": {
                                            "endType": "ALIVE",
                                            "next": [],
                                            "nodes": [
                                                {
                                                    "text": "Іван стало геть зле, його вивернуло ще раз. Він рачки відповз за лінію вогню, де його підхопили чергові-джури й понесли до лікаря.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Він уже не бачив, як в колесо, під яким він сидів улучило ядро, яке хтось зі слуг все-таки зміг вистрілити.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Далі Іван втратив свідомість і прокинувся уже вранці. Розпитавши лікарів, він узнав, що козаки з татарами наглухо розбили все військо карателів, Потоцький потрапив у полон, взяли силу-силенну пороху і харчів. Старшина почувши, як він своїм пострілом врятував весь курінь, наказала передати гарматку їм в якості трофею.",
                                                    "imageType": "camp"
                                                },
                                                {
                                                    "text": "Через три дні вони вирушать до Корсуня.",
                                                    "imageType": null
                                                }
                                            ]
                                        }
                                    },
                                    {
                                        "text": "Допомагати далі",
                                        "nextPage": {
                                            "endType": "DEAD",
                                            "next": [],
                                            "nodes": [
                                                {
                                                    "text": "Його знову знудило, але він вирішив стріляти далі.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Раптом він упав на землю, над головою побачив синє небо. В роті стояв сильний смак заліза, все обличчя горіло біллю, він намагався рукою розчистити його.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Він все намагався попасти рукою по обличчю, і тільки тут зрозумів, що вона відірвана по плече.",
                                                    "imageType": "cossacks"
                                                },
                                                {
                                                    "text": "Ляхи все-таки встигли вистрілити в їх бік і ядро відірвало йому руку.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "З рани стирчала жовта кістка, вона стала заливатися кров'ю.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Його витягли до лікаря. Він затис рану, але по його очах Іван уже все зрозумів.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "— Дайте мені ту руку",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Хтось приніс йому його відірвану кінцівку.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Перехрестившись лівою рукою, Іван заснув.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Ляхів будуть різати в полі до ночі. Потоцького візьмуть у полон і подарують татарам. Через три дні козаки вирушать до Корсуня. Початок Визвольної Війни було покладено.",
                                                    "imageType": "landing"
                                                }
                                            ]
                                        }
                                    }
                                ],
                                "nodes": [
                                    {
                                        "text": "Він забив всі стволи шротом і порохом. На затравники налив довгу лінію з льняної олії. Зверху посипав мілким порохом.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Олію додавали для того, щоб порох прилип до неї, і його не міг здути вітер.",
                                        "imageType": "camp"
                                    },
                                    {
                                        "text": "За спиною в чохлі лежав самопал. Після пострілу з ожиги він мав продовжувати обстріл з мушкета. Часу не перезарядку ожиги уже б не було.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Козацьку флейту виставили так, щоб ударити поверх коней та возів і зрізати вершників. Всі зачаїлися, було чутно лише як козаки зводять замки самопалів.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Раптом з того місця, де засів Нечай разом з іншими сотнями, пролунав постріл, і завищала куля. Вона була підрізана таким чином, щоб свистіти під час польоту. З далеку це було схоже на звук від рикошету або на звук, коли джміль пролітає над головою.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Це був знак, що військо ляхів уже закрито в вогняному мішку і можна починати різанину.",
                                        "imageType": "forest"
                                    },
                                    {
                                        "text": "Одночасно з усіх трьох сторін ударили сімсот замків козацьких самопалів. Всі вони злились в один гарматний постріл.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Іван, бувши бувалим, заздалегідь відкрив рот, щоб його не поглушило залпом. Але такий масовий одночасний постріл він відчув на собі вперше.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "В правому вусі свист перейшов в страшний біль. Через силу він дотягнувся запальним дротом до ожиги.",
                                        "imageType": "bulrush"
                                    },
                                    {
                                        "text": "Ожига виригнула полум‘я смерті в бік ворога. Іван дивився через примружені очі на залп ожиг, але взагалі не почув її пострілу.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Спершу він подумав, що порох не зайнявся, і ожига не вистрілила. Але права рука почала боліти від опіку. Частина запального пороху розлетілась під час горіння і пропалила до м‘яса кисть.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Запах повітря змішався в алхімію смерті: піт коней, палений порох, порізаний ліс, відро дьогтю під возом. Все це злилось в один запах. Запах погрому поляків під Жовтими Водами.",
                                        "imageType": "camp"
                                    },
                                    {
                                        "text": "Іван взявся за самопал і виставив його на віз, цілячись у палицю, яку козаки вкопали біля дороги перед своїми возами. Вони їх використовували для того, щоб приблизно знати куди цілитись, коли поле бою затягне пороховим димом і ворог не буде являти собою гарну мішень.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Кожен з козаків змалечку тренувався стріляти з будь-яких позицій: лежачи на животі, спині, сидячи на дереві, через коня, з-під коня, під час руху з возами.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Іван не став одразу стріляти, трошки почекав, коли відійде дим.",
                                        "imageType": "camp"
                                    },
                                    {
                                        "text": "Раптом прямо на них вискочило декілька коней. Козаки подумали, що це кіннота ляхів атакує їх табір. Іван прицілився і спустив пружину замка самопалу.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Замість пострілу він почув лише удар металу о кремінь, але пострілу не було.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Ця помилка врятувала життя половині його куреня: на них вискочили уже убиті вершники, а їх несли перелякані коні. Двом ляхам начисто відрізало голови. У одного замість рук висіли шмаття шкіри і жупана. Це був результат залпу Іванової ожиги.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Він негайно прочистив кремінь, подивився чи є ще порох на поличці і лівим оком встиг помітити, як лях з вибитим оком і зламаною рукою тягнеться фітилем до запалу гарматки, яка соплом дивилась просто на їхній віз.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Іван повільно видихнув і натиснув гачок самопалу.\n\nПостріл!\n\nКуля прошила голову гармаша на виліт. Курінь було врятовано.\n",
                                        "imageType": "forest"
                                    },
                                    {
                                        "text": "Товариші, які були поруч і уже бачили свою смерть, почали радісно кричати та вітати Івана з цим пострілом.",
                                        "imageType": "cossacks"
                                    },
                                    {
                                        "text": "Козаки не зупиняли обстріл табору. Іван один за одним розряджав самопали, які йому подавали.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Увійшовши в азарт він видерся на віз і став стріляти в ляхів у весь зріст.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Поляки не були в боргу. Їх важка кіннота, яку не вибило першими залпами, встала у клин і почала розгін на поперечну засідку.",
                                        "imageType": "forest"
                                    },
                                    {
                                        "text": "Деякі козаки рвалися у рукопашний бій. Уже було зрозуміло, що шляхта кинула жовнірів і слуг і кінним тараном хоче пробити собі шлях до життя.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "— Всім за вози! Свої постріляють!",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Команду старшини передали по лінії. Черговий залп з іншої засідки, який просвистів над головою утихомирив всіх.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Навіть Іван зліз з воза і став ладнати свої самопали. Тільки зараз він помітив кров, яка капала на траву з його обличчя.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Одна з куль по дотичній ударила по черепу, розсікла шкіру.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "До нього негайно підбіг козак з чистим полотном і почав перев'язувати голову.",
                                        "imageType": "forest"
                                    },
                                    {
                                        "text": "Від струсу мозку Івана вивернуло прямо на колесо воза. Він присів під ним, між спицями вставив самопал і шукав нову ціль.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "В праве вухо його ударили молотком ще раз. Це козаки, які засіли прямо на дорозі, ударили з мушкетів і ожиг по гусарах, які на повному скаку упали в перекопану яму.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Деякі з них перелетіли через ярок, але залп ожиг зніс їх начисто.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Задні вершники зупинились як раз для того, щоб Іван міг гарно в них прицілиться. З відстані двісті кроків попасти у натовп з п'ятдесяти коней і ляхів було просто.",
                                        "imageType": "forest"
                                    },
                                    {
                                        "text": "Всі три самопали обірвали чиєсь життя. Після кожного пострілу він бачив, як вершник складався вдвоє і повільно сповзав у низ, де був розтоптаний оскаженілими конями.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Він уже не міг перезарядитись сам, то ж просто подавав кулі іншим козакам, які стріляли поруч.",
                                        "imageType": null
                                    }
                                ]
                            }
                        },
                        {
                            "text": "Взяти самопал",
                            "nextPage": {
                                "endType": null,
                                "next": [
                                    {
                                        "text": "Перевести приціл на гармаша",
                                        "nextPage": {
                                            "endType": "ALIVE",
                                            "next": [],
                                            "nodes": [
                                                {
                                                    "text": "Козак посунув самопал і спіймав у мушку гармаша, який тримав на готові фітіль для пострілу.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Поляки трошки розслабились, їм здалося, що татари уже відстали та не хочуть іти за ними так далеко.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Іван чув їх жарти. Шляхтичі між собою змагалися у більш вишуканій карі для козаків, яку вони завдадуть. Тільки б з'єднатися з іншим військом.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Раптом в небо здійнявся джміль. Весь табір завмер на долю секунди.",
                                                    "imageType": "forest"
                                                },
                                                {
                                                    "text": "Сімсот самопалів козаків ударили всі як один по ляхах.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Від такого вибуху в Івана навіть відійшла земля з-під ніг.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Він побачив, що гармаша, якого він вів на прицілі поранено. Куля перебила йому руку, а дерев’яний уламок з воза стирчить з ока.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Але лях все одно піднявся і почав заносити руку з запальником до гарматки.",
                                                    "imageType": "forest"
                                                },
                                                {
                                                    "text": "Вона дивилась просто на їх віз.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "— Лягай!",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Крикнув курінний. Всі, крім Івана упали на землю.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "До гармаша було понад сто кроків. Іван повільно видихнув і плавно натиснув гачок спуску пружини.",
                                                    "imageType": "cossacks"
                                                },
                                                {
                                                    "text": "Кремінь ударив об метал, висік десяток іскор. Менше ніж через секунду самопал викинув кулю.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Вона потрапила прямо в шию, перебив хребет. Лях упав як скошений обличчям вниз.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Наступною ціллю він вибрав товстого панича на коні, який махав руками і віддавав накази.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Тільки зробив вдох для пострілу, як панича пробили дві кулі. Хтось інший уже попіклувався про нього.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Іван змістив приціл вліво, там стовбичили закляклі від страху панята. Закриваючись одним за одним вони тільки привертали на себе більше вогню, являючи собою чудову мішень.",
                                                    "imageType": "forest"
                                                },
                                                {
                                                    "text": "Він вистрілив. Одразу двоє упало, схопившись за тіло. Інші побратими достріляли натовп з ожиги.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Першій лінії козаків постійно передавали готові до пострілу самопали. Щільність вогню була така, що голова ляха розліталась на друзки, як тільки він висовувався над возом.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "По всьому полю бою бігали коні. Джури відловлювали їх і відводили в тил.",
                                                    "imageType": "camp"
                                                },
                                                {
                                                    "text": "Татари, побачивши, що табір ляхів зламав стрій, увірвались ззаду і розтягли вози.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Вони ловили на аркан всіх підряд. Якщо хтось чинив опір, його кололи або дострілювали з лука.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Козаки побрали списи та шаблі й теж кинулись добивати карателів.",
                                                    "imageType": "forest"
                                                },
                                                {
                                                    "text": "Перебравшись через вози, Іван і товариші побачили результат своєї роботи.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "То тут, то там, лежали тельбух, відірвані кінцівки. Труп коня змішався з трупом ляха. Вся земля була червона, кров хлюпала під чоботами.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Козаки добивали ляхів, у яких уже не було шансів вижити.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Найбільш страшні рани залишав козацький орган — ожига.",
                                                    "imageType": "forest"
                                                },
                                                {
                                                    "text": "Молодих слуг пожаліли, вони готові були битися до кінця, але були покинуті старшиною і не могли організуватися.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Їх пов‘язали й склали за вози. Католицьку шляхту ж одразу ставили до ножа. Всі добре пам‘ятали, як в муках закінчили життя попередні українські ватажки: Наливайко, Остряниця і інші.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Бійню припинили лише коли татари підійшли ближче. Козаки стали за самопали і утворили лінію, щоб відмежувати їх від своєї здобичі.",
                                                    "imageType": "cossacks"
                                                },
                                                {
                                                    "text": "Кримчаки чудово знали, що проти такої вогняної сили вони не попруть і трохи відступили.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Хтось з козаків знайшов і витягнув Потоцького з-під воза.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Його охоронцям тут же зняли голови.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Гетьман карателів закрив обличчя руками та благав не різати його. Він хотів побігти в сторону татар, які його б взяли у полон, і пізніше він міг викупитися.",
                                                    "imageType": "river"
                                                },
                                                {
                                                    "text": "Але козаки копняками загнали його назад. Сава, козак з Биківської сотні, тупим кінцем рогача ударив його по стегні та той упав.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Невідомо, чим би закінчилося це все для Потоцького. Але в цей час прилетів Хміль з численною охороною.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Він зліз з коня і став всіх дякувати за таку блискучу перемогу.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Зиновій сам був бувалий воїн і тому не боявся заляпати чоботи у юшці людської крові, яка чавкала під ногами.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Він привітав Потоцького з великою славою, і махнув своїй охороні, щоб вони його забрали.",
                                                    "imageType": "boat"
                                                },
                                                {
                                                    "text": "По закону Дикого Поля, ватажок міг вибрати собі здобич, а все інше ділили між сотнями та куренями.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Басанській сотні дісталося двадцять коней і три вози пороху. Вони тут же обміняли один віз на ще одну ожигу.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "— Чув я, як грають ваші ожиги!",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Похвалив Хміль басанського сотника.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "— Сподіваюсь почути цю чудову музику перемоги й під Корсунем! Разом і до кінця!",
                                                    "imageType": "forest"
                                                }
                                            ]
                                        }
                                    },
                                    {
                                        "text": "Супроводжувати вершника",
                                        "nextPage": {
                                            "endType": "DEAD",
                                            "next": [],
                                            "nodes": [
                                                {
                                                    "text": "Івану здалося, що він в приціл бачить самого Потоцького, наказного гетьмана карателів.",
                                                    "imageType": "boat"
                                                },
                                                {
                                                    "text": "Нечай подав сигнал до розстрілу. Перші ряди козаків одночасно ударили з самопалів.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "І одразу потягнулися за наступними самопалами.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Іванові в око попала іскра, яка злетіла від залпу ожиги. Від болю він смикнувся і приціл змістився вправо.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Куля вилетіла з дула й ударила прямо у вухо коня.",
                                                    "imageType": "camp"
                                                },
                                                {
                                                    "text": "Кінь під Потоцьким упав як підкошений. Його одразу оточила охорона і власними тілами врятувала його від залпу з ожиги.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Трьох тіло охоронців розірвало на шмаття. Їхні тельбухи і кінцівки підлетіли у повітря як ганчірки.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Іван уже не бачив ціль. Другим пострілом він убив охоронця, який витягав Потоцького з-під коня.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Слуги швидко отямились і натягнули вози під щільним обстрілом козаків. Потоцький врятувався.",
                                                    "imageType": "cossacks"
                                                },
                                                {
                                                    "text": "Ляший гармаш, якого Іван бачив краєм ока встав з землі. Права нога трималась на сухожиллях і була вивернута назад. Силою волі він підніс запальник до гармати. ",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Іван побачив, як велика куля вилетіла в їх сторону. Він бачив, як вона вилетіла із хмари порохового диму і просто летіла на нього.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Вона увійшла в праву частину його грудей, моментально убивши. Товариші з жахом дивилися на розірване тіло найкращого стрілка.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "З трансу їх вивів сотник, який закричав:",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "— Убийте їх всіх!",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Козаки розрядили всі свої мушкети, оголили шаблі та кинулись розривати табір.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Ззаду вози ляхів уже розтягнули татари і увірвались в табір.",
                                                    "imageType": "river"
                                                },
                                                {
                                                    "text": "Сталася страшна колотнеча.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Козаки не жаліли ні кого, вирізали до ноги.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Гармаша, який убив Івана взяли в полон.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Від адреналіну він не відчував болю, тож козаки вирізали йому живіт і засунули туди сіно, яке валялося скрізь.",
                                                    "imageType": "forest"
                                                },
                                                {
                                                    "text": "Коли адреналін почав спадати, обличчя ляха пожовтіло, потім побіліло. Його почало трусити. З рота пішла кров. Через хвилину він стік.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Важка кіннота, яка хотіла вирватись із паски попала у копаний рів. Її козаки розстріляли з двадцяти кроків, винищивши всіх.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Потоцький попав у полон. За ним приїхав сам Хміль, який сяяв від радощів.",
                                                    "imageType": "landing"
                                                },
                                                {
                                                    "text": "Каральний загін, який ляхи вислали, перестав існувати.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Шлях до самостійної України було почато.",
                                                    "imageType": "landing"
                                                }
                                            ]
                                        }
                                    }
                                ],
                                "nodes": [
                                    {
                                        "text": "Іван винув рушницю з чохла. Протер поличку для пороху, затягнув гвинт, який тримає кремінь. Після цього забив ствол порохом, кулею і пижем.",
                                        "imageType": "forest"
                                    },
                                    {
                                        "text": "Також він взяв інші курінні самопали та став їх заряджати. Двоє козаків стали поратися біля ожиги, намагаючись її зарядити.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Всі зачаїлися. На пагорбі з‘явилися перші воїни неприятеля. Збоку їх прикривали вози, спереду і позаду важка кіннота.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Табір поступово спускався вниз, де їх чекали козаки з трьох сторін. Ззаду на ляхів постійно наїжджали татари.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Вони здіймали багато галасу, і не можна було зрозуміти, чи вони дійсно нападають.",
                                        "imageType": "forest"
                                    },
                                    {
                                        "text": "В такому марші карателі ішли уже двадцять верств, але вони тримались табором і татари ніяк не могли їх зупинити.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Іван через приціл бачив військо, але всі чекали на сигнал Нечая. Він мав вистрілити підрізаною кулею, яка голосно жужить у польоті, нагадуючи на звук літаючого джмеля.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Піт заливав очі, в животі похолодало в очікувані бою. Але Іван постійно тримав одного з вершників в прицілі.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Першим залпом треба було убити якмога більше командирів, щоб посіяти безлад і разом з татарами розірвати табір.",
                                        "imageType": "forest"
                                    },
                                    {
                                        "text": "Івану в очі впав віз, на якому стояла гарматка. Її жерло дивилося в їх бік.",
                                        "imageType": null
                                    }
                                ]
                            }
                        }
                    ],
                    "nodes": [
                        {
                            "text": "Іван побіг до лісу на лівий фланг. По дорозі викинув полотно в якому виносили землю.",
                            "imageType": null
                        },
                        {
                            "text": "Всі козаки готувалися до засідки. Деякі рубали гілки і клали їх на вози, щоб ворог з далеку не побачив укриття. Інші добивали самопали. На кожного стрільця було по три-чотири самопали.",
                            "imageType": null
                        },
                        {
                            "text": "Така щільність вогню в перші хвилини дуже часто вирішувала результат сутички ще до того, як вороги могли підійти до ближнього бою.",
                            "imageType": null
                        },
                        {
                            "text": "Кожен з козаків учився з малих літ стріляти з лука і самопала. Іван був одним з найкращим у своєму полку: він з відстані двісті кроків розбивав вісім гарбузів з десяти.",
                            "imageType": null
                        },
                        {
                            "text": "Курінний наказав витягти ожигу і забити її шротом.",
                            "imageType": null
                        }
                    ]
                }
            },
            {
                "text": "Стати на шляху",
                "nextPage": {
                    "endType": null,
                    "next": [
                        {
                            "text": "Залишитись біля Нечая",
                            "nextPage": {
                                "endType": "ALIVE",
                                "next": [],
                                "nodes": [
                                    {
                                        "text": "Нечай дав команду відтіснити татар від поля бою.",
                                        "imageType": "cossacks"
                                    },
                                    {
                                        "text": "Іван помітив своїх з куреня і вирішив залишитись біля Нечая. Всі його ноги і штани були наскрізь просякнуті кров‘ю. Він радісно привітав курінного і побратимів.Всі вони уціліли.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Нечай наказав зняти голову Потоцькому. Той почав кричати і обіцяти величезний викуп за себе, намагаючись привернути увагу до себе татар.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Татари почали пробиратися до полоненого. Але козаки уже утворили лінію, були готові дати відсіч навалі татар. Ті не рішились відбивати трофеї. Їхній головний побачив Потоцького і поскакав з охороною до Хмеля.",
                                        "imageType": "boat"
                                    },
                                    {
                                        "text": "Татар відігнали від розгромлених ляхів. Ті поскакали грабувати обоз, який вони з іншими козацькими полками роздерли. У полон попало декілька десятків слуг, які на відміну своїх господарів билися до останньої сили.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Потоцького розтягнули за руки і опустили голову вниз, готуючись її зняти. В цей час прискакав вершник з величезною охороною. Це був сам Хміль.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Він сяяв від радощів. Спішився і почав обнімати всіх козаків. Не цурався навіть тих, які з ніг до голови були обмазані кров‘ю. Деяких воїнів рвало після напруженого бою, він їх просто похлопав по спині.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Цей жест Хмеля розслабив козаків, які хотіли забити полонених. Всі почали підкидати шапки до гори і кричати «Хмелю, Хмелю».",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Деякі зі слуг навіть повеселішали, бачачи, що їх уже не заріжуть.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Хміль забрав Потоцького. Його, в одній сорочці слуги, посадили на коня і повели до табору.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "В Івана пройшов присмак паленого пороху у роті. Натомість він відчув солодкий присмак смерті: ще теплих нутрощів худоби та людей. Слух повністю повернувся назад. Разом з іншими він почав обходити убитих у пошуках трофеїв.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Знайшов вершника, якому вивалив мізки з самопала. Навіщо він пішов примучувати козаків? Чому не сиділось в коронній Польщі? Іван з цими думками зняв з коня спорядження і пішов до свого куреня.",
                                        "imageType": null
                                    }
                                ]
                            }
                        },
                        {
                            "text": "Висунутись до татар",
                            "nextPage": {
                                "endType": "ALIVE",
                                "next": [],
                                "nodes": [
                                    {
                                        "text": "Іван та інші козаки утворили лінію, на поготові була вся зброя. Шерегою вони почали відштовхувати татар трохи далі від розбитого табору.",
                                        "imageType": "river"
                                    },
                                    {
                                        "text": "Потоцький почав голосно волати, щоб його почули татари, які воюють заради продажу бранців або їх викупу.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Один з кримчаків упізнав Потоцького. Обернув коня і з охороною поскакав до Хмельницького.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Інші татари боялися підходити до козаків, вони бачили як «вогняні люди» знищили відбірну польську кінноту за двадцять хвилин.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Раптом Іван упізнав татарина, з яким дуже давно зустрівся у степу під час відбиття рейду.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "— Джалай! Це ти!?",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Татарин вихопив шаблю й одночасно розвернувся, готуючись до удару. Він глянув на козака.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "— Ти знову тут з твоїм кодлом?",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Відповів Джалай, розслаблюючи руку. Напруга зійшла з обличчя, він навіть посміхнувся.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Двадцять років тому Іван разом з іншими козаками відбив бранців у невдачливих татар. Половину було порубано, а Джалая і ще декількох взято в полон і продано жидам у Каневі.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Вони наблизились одне до одного. Двадцять років тому Іван вів коня Джалая до Канева. Татарин уже не очікував на викуп. Вони тоді розговорились між собою і навіть потоваришували, але війна є війна.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Іван і Джалай мовчки роздивлялись одне одного. Вони значно постарішали, шкіра потемніла від степового сонця і вітру. Вони почали ділитися враженнями від бою, обмінялися шаблями на пам'ять. Інші козаки теж почали розмови з іншими татарами.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Напруга між військами спала, але татар не пускали до табору все одно.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Іван збігав до коня, вершнику якому він вивалив мізки з мушкета. Зняв спорядження, сідло і подарував Джалаю. Той дав йому свій лук з сагайдаком.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Іван на хвилину згадав, як загинув Сокіл у нього на очах.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Джалай це помітив і сказав:",
                                        "imageType": "bulrush"
                                    },
                                    {
                                        "text": "— Тоді не я влучив...",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Тут почався галас. До них наближався Хміль разом з великою охороною. Поруч з ним скакав татарин у дуже багатому вбрані хоча і заляпаному в крові.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Хмельницький весь сяяв від щастя. Він спішився і почав поздоровляти всіх козаків, плескаючи їх по спині та обнімаючи.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Потоцького повантажили на коня. Хтось із татар відрізав у забитого коня здоровенного прутня і обв‘язав ним шию голови карального походу.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Козаки звелися шмонати табір у пошуку трофеїв. Гармаші впрягали коней до лафетів здобутих гармат.",
                                        "imageType": "camp"
                                    },
                                    {
                                        "text": "Двоє козаків почали бійку, один з них хотів відібрати сідло в іншого та ударив шаблею по голові. Його тут же скрутили і повели до старшини.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Прийшов і курінний злочинця, тут же опитали свідків, які підтвердили, що сідло по закону війні належало не йому.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Нападника поставили на коліна, за мотузки розтягнули руки в різні сторони та двома ударами шаблі відтяли голову.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Курінний разом з іншими забрав тіло і сумний пішов до свого возу.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Загалом козаки у цій засідці втратили лише пораненими декілька десятків козаків: одна з гармат все-таки встигла вистрілити та розваляла віз, з-за якого стріляли козаки. Інші були поранені з рушничного вогню поляків.",
                                        "imageType": "bulrush"
                                    },
                                    {
                                        "text": "Хміль оглянув полонених ляхів. Їм уже надавали медичну допомогу. Половину полонених він наказав передати татарам.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Нечай був невдоволеним, але татари внесли великий вклад у перемогу, постійно турбуючи табір і відтягуючи сили на захист тилу.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Іван з Джалаєм ще раз попрощалися. Вони і уявити не могли, що тепер їхні долі будуть дуже тісно пов‘язані та трагічно обірвуться через 3 роки під час прикриття відходу з-під Берестечка.",
                                        "imageType": "camp"
                                    }
                                ]
                            }
                        }
                    ],
                    "nodes": [
                        {
                            "text": "Іван швидко побіг до окопу. Часу було обмаль, уже було чутно як стріляють самопали поляків. На них постійно наскакували татари, шукали слабких сторін, щоб роздерти табір.",
                            "imageType": "bulrush"
                        },
                        {
                            "text": "Прямо за ровом козаки викопали маленькі нірки, в них і готувались до бою.",
                            "imageType": null
                        },
                        {
                            "text": "Курені Сулима і Сава розчехляли ожиги. На кожній було по вісімнадцять стволів. Постріл шротом з ожиги міг зняти м’ясо з людей, розрізати навпіл коня. У ближньому бою це була страшна зброя.",
                            "imageType": null
                        },
                        {
                            "text": "Іван взявся хутко собі копати окопчик, щоб з нього непомітно стріляти у ворога. Перед ними уже був викопаний рів, прикритий травою. Коней відвели трохи далі. Всі козаки спішилися.",
                            "imageType": null
                        },
                        {
                            "text": "Іван глянув на правий та ліві фланги. Позиції козаків були дуже гарно замасковані. Лише розсипана де-не-де земля видавала якусь роботу.",
                            "imageType": null
                        },
                        {
                            "text": "Він ще раз перевірив всі свої самопали. Кремінці були чистими і гострими, не дарма вони з куріним вчора цілий день його різали на свій курінь.",
                            "imageType": "forest"
                        },
                        {
                            "text": "Під ліву руку поклав шомпол, натруску. Самопали уже були забиті порохом і кулями. Іван розв‘язав ганчірку, яка закривала замок мушкета від ударів і сирості. Ще раз продув запальний отвір.",
                            "imageType": null
                        },
                        {
                            "text": "Цей самопал був його улюбленим. Замок до нього зробив великий майстер з Києва — Юліан.",
                            "imageType": null
                        },
                        {
                            "text": "Всі козаки навколо робили те саме. Їм було не вперше займати позицію на таких шляхах. Дуже часто такими ж засідками на дорогах вони нападали на татар. В курені всі були з бойовим досвідом. Багато хто гуляв на Січі, дехто навіть ходив морем до турків і в Крим.",
                            "imageType": null
                        },
                        {
                            "text": "Табір ляхів підходив все ближче. Їх підганяли татари. Вони робили постійні спроби розірвати табір. Це сильно вимотувало поляків. Татари ж відходили назад, мінялись загонами, або брали свіжих коней і знову крутили свої хороводи смерті.",
                            "imageType": "river"
                        },
                        {
                            "text": "Попереду йшла кіннота. Іван уже бачив, як блищали їх обладунки. З двох боків колону прикривали вози. Через них поляки відганяли татар.",
                            "imageType": null
                        },
                        {
                            "text": "Раптом військо татар збільшилося вдвоє. Вони стали широкою лавою, завели свій спів і з криком «Ала-ала» полетіли на табір.",
                            "imageType": null
                        },
                        {
                            "text": "— Зараз почнемо! Чекати на команду Нечая!",
                            "imageType": null
                        },
                        {
                            "text": "Прокричав куріний, який заліг зліва. Уже стояв такий галас, що козаки не боялися, що їх помітять. Команду передавали далі по лінії окопу.",
                            "imageType": "cossacks"
                        },
                        {
                            "text": "Іван припідняв свій самопал. У приціл, прямо над мушкою на кінці ствола, він бачив силует вершника і коня.",
                            "imageType": null
                        },
                        {
                            "text": "До ворога було чотириста метрів, для його самопалу завелика відстань. Упевнено Іван міг покласти вісім куль з десяти у гарбуза з відстані двісті метрів.",
                            "imageType": null
                        },
                        {
                            "text": "Ще раз машинально він намацав натруску, правим оком перевірив чи не здуло порох з полички, наявність шомпола.",
                            "imageType": null
                        },
                        {
                            "text": "За довгі роки боїв ці всі речі уже були настільки автоматизовані, що Іван навіть не помічав цих рухів. Бойове хрещення він отримав, коли буджацькі татари пішли лівим берегом і почали палити слобідки з куренями.",
                            "imageType": "forest"
                        },
                        {
                            "text": "Завдяки пильності вони помітили татар і влаштували їм засідку біля входу в уходний курінь. ",
                            "imageType": null
                        },
                        {
                            "text": "Іван разом з батьком стріляв з-за дерев. Жоден постріл не пройшов дарма.",
                            "imageType": "river"
                        },
                        {
                            "text": "Татари попали у вогняний мішок і були всі знищені. Їхні голови розвісили навколо балки, де стояв курінь. Після цього татари обходили його стороною, а між козаками той хутір стали називати Самопалки.",
                            "imageType": null
                        },
                        {
                            "text": "Іван на власний досвід переконався, як один козак за першу хвилину бою може знищити одразу трьох або п‘ятьох ворогів.",
                            "imageType": null
                        },
                        {
                            "text": "Шалена щільність вогню і миттєві втрати в перші секунди вогняного контакту сіяли смуту в рядах татар і поляків. Дуже часто діло навіть не доходило до рукопашного бою, вояки тікали в сторону табору, і мало хто міг змусити їх піти в атаку на табір козаків.",
                            "imageType": null
                        },
                        {
                            "text": "Такий же ефект відчули поляки, коли Нечай віддав команду до вогню.",
                            "imageType": null
                        },
                        {
                            "text": "Пролунав один постріл. Для сигналу підпилювали кулю, щоб вона свистіла у польоті. Цей звук не можна було ні з чим переплутати: звук швидко відлітаючого джмеля, який переходив на більш високий тон.",
                            "imageType": "forest"
                        },
                        {
                            "text": "Одночасно ударили замки семисот самопалів з трьох сторін. Перший ряд важкої кінноти ліг як трава під косою. Кулі ударяли в коней, вози, вершників, слуг. В деяких гусар ударами куль відривало кінцівки. Кулі проминали їхні сталеві обладунки, звук ішов по полю, начебто триста ковалів одночасно щось карбують.",
                            "imageType": null
                        },
                        {
                            "text": "Удар кулі й гомілка коня розтрощена, кінь падає на бік, роздавлює тазові кістки вершнику.",
                            "imageType": null
                        },
                        {
                            "text": "Два удари та іншому шляхтичу відриває щелепу, вивалюються нутрощі з розірваного живота.",
                            "imageType": null
                        },
                        {
                            "text": "Іншому перебиває кисть, під вагою списа вона викручується, приносячи страшну муку воїну. Іншою рукою він намагається розжати її і друга куля пробиває йому груди.",
                            "imageType": "cossacks"
                        },
                        {
                            "text": "З упавшею першою лавою одразу падає наступна. Кожен козак мав перед собою три мушкети. Ті, що стояли у лісочках за возами віддавали назад на перезарядку. Більш молоді козаки з виряченими очима дивилися на цю ляхобійню. Деяких з них старшина била по голові, щоб повернути думки до бою.",
                            "imageType": null
                        },
                        {
                            "text": "Ті, що лежали поперек дороги, мали лише три самопали і не могли нікому віддати на перезарядку. Іван відстріляв всі три і прийнявся забивати ї заново.",
                            "imageType": null
                        },
                        {
                            "text": "Все це робилося лежачи на спині. Всі рухи автоматичні: видути згорілий порох з затравника, насипати забій, закотити кулю, закласти пиж з мотлоху, шомполом забити до відмітки на ньому, насипати порох з натруски на поличку, закриту поличку.",
                            "imageType": "camp"
                        },
                        {
                            "text": "Всі козаки забивали одне за одним. Хтось зарядившись стріляв з одного, інші тримав на готові, хтось забивав всі три й по черзі стріляв з них.",
                            "imageType": null
                        },
                        {
                            "text": "Перший залп по табору ляхів вибив п‘яту частину воїнів з карального загону. Здалеку здалося, що це небо розкололося і настав Останній Суд. Татари, які ішли позаду табору, навіть розвернули коней і хотіли тікати, настільки гнітюче враження справив залп у вогняному мішку.",
                            "imageType": "forest"
                        },
                        {
                            "text": "Пересвідчившись, що це б'ють ляхів, а не їх, вони кинулися на табір. Це був їх шанс роздерти вози і розбити військо.",
                            "imageType": null
                        },
                        {
                            "text": "Шляхта вирішила проривати фронт, через те, що сили козаків там були найменші.",
                            "imageType": null
                        },
                        {
                            "text": "Утворивши клин, вони повернули коней прямо на Івана і з криком перейшли на галоп. ",
                            "imageType": null
                        },
                        {
                            "text": "Здалеку це було фантастичне дійство. Двісті важких вершників як один організм рушили на окоп козаків. Набравши швидкість, вони опустили списи, готуючи розірвати козаків на шмаття.",
                            "imageType": "bulrush"
                        },
                        {
                            "text": "Яке ж було їх здивування, коли перші вершники побачили перекопану дорогу. Вони намагались зупинитись, але величезна маса кіннотного удару змела їх під своєю вагою.",
                            "imageType": null
                        },
                        {
                            "text": "Перші двадцять коней упало в яму. Вони ламали собі ноги, шиї, хребти. Розчавлювали шляхтичів як мух. Але енергія удару була така величезна, що задні вершники змогли перелетіти через яму, скачучи по поранених конях і поляках.",
                            "imageType": null
                        },
                        {
                            "text": "І в цей момент заграли ожиги козаків. Впритул, з двадцяти метрів всі дванадцять ударили шротом по ляхах.",
                            "imageType": null
                        },
                        {
                            "text": "Івана оглушило і навіть потроїлось в очах. Від диму вони сльозились і він зігнувся у норі від кашлю. У роті стояв смак сірки, він постійно його спльовував.",
                            "imageType": "boat"
                        },
                        {
                            "text": "Піднявши голову Іван шукав нову ціль. Але те, що він побачив шокувало його.",
                            "imageType": null
                        },
                        {
                            "text": "Він не зміг розібрати де валились нутрощі коня, ляха. Все змішались в сіру-червону пляму крові, кишок, мізків і пилу. Ожиги повністю винищили всіх шляхтичів, які прорвались через яму.",
                            "imageType": null
                        },
                        {
                            "text": "Прямо на нього дивився лях, у якого з‘їхав дах: йому відірвало праву руку, він сидів на мертвому коні, якому вивернуло задні ноги і перебило шию. При цьому лях вкладався в удар уявним списом і дивився прямо в очі Івану. Він досі думав, що іде галопом на козаків.",
                            "imageType": "bulrush"
                        },
                        {
                            "text": "— Кууууурва мати!!!",
                            "imageType": null
                        },
                        {
                            "text": "Закричав лях, якому здавалось, що він ось-ось проштрикне козака.",
                            "imageType": null
                        },
                        {
                            "text": "Але його кінь лежав мертвим. А права рука зі списом валялась у кровавій піні під ним. Останнє, що побачив лях — це вогник, який вийшов з полиці самопала Івана і куля, яка крутилась, летіла прямо йому між очей.",
                            "imageType": "river"
                        },
                        {
                            "text": "Кістка з потилиці вилетіла, а з величезної дірки почав витікати мозок.",
                            "imageType": null
                        },
                        {
                            "text": "Козаки дорозрядили всі самопали в уцілілих від залпу ожиги карателів.",
                            "imageType": null
                        },
                        {
                            "text": "Вони взялись за списи та шаблі, чекаючи на команду Нечая до різанини. Якщо б вони вибігли в поле дорізати ляхів, то могли б потрапити під обстріл з флангів.",
                            "imageType": null
                        },
                        {
                            "text": "У повітря знову здійнявся джміль Нечая, всі козаки з трьох сторін кинулися закінчувати погром під Жовтими Водами.",
                            "imageType": "boat"
                        },
                        {
                            "text": "По полю бігали ошаліли коні, їх дострілювали з мушкетів. Весь ударний кулак польської кінноти був побитий, вони не могли чинити ніякого опору.",
                            "imageType": null
                        },
                        {
                            "text": "Кожен з козаків вкладав в удари всю кривду, яку ляхі завдали Україні.",
                            "imageType": null
                        },
                        {
                            "text": "З осені дозрівало повстання, коли у полках взнали, як Чаплинський наїхав на село Хмельницького, убивши його сина. Заволодівши хуторами, які поставив дід Хмеля, він почав кривдити інших козаків, багато з яких втекло на Січ разом з Богданом.",
                            "imageType": null
                        },
                        {
                            "text": "Все гарне вбрання й обладунки ляхів стало сміттям, покритим нутрощами тварин, людей. Дехто зі шляхти хотів сховатися під конями, або накритись трупом.",
                            "imageType": "river"
                        },
                        {
                            "text": "Але козаки штрикали всіх без розбору.",
                            "imageType": null
                        },
                        {
                            "text": "Сам Нечай був на самому передку. До нього привели Потоцького, який ховався під возом і намагався перевдягнутися у слугу.",
                            "imageType": null
                        },
                        {
                            "text": "Він встиг надягнути лише сорочку, як йому по дупі шаблею ударив козак. Упізнавши в ньому головного, вони схопили його і потягли до полковника.",
                            "imageType": null
                        },
                        {
                            "text": "Тягнули його через усіх козаків, які давали йому копняків і лящів. Коли він став уже перед Нечаєм, то все тіло його було в синцях, а обличчя розпухло і кровоточило.",
                            "imageType": null
                        },
                        {
                            "text": "Ззаду до козаків наблизились татари, які почали шмонати трофеї. Але це поле бою було за козаками.",
                            "imageType": "forest"
                        }
                    ]
                }
            }
        ],
        "nodes": [
            {
                "text": "Йшов третій день протистояння Війська Запорозького проти карального загону Потоцького. Козаки оточили військо поляків табором і готувалися до вирішального приступу.",
                "imageType": "camp"
            },
            {
                "text": "Переяславський полк перейшов на сторону Хмельницького. Вся старшина і козаки відмовились примучувати повсталих козаків.",
                "imageType": null
            },
            {
                "text": "Для більшої деморалізації поляків, увесь полк пройшов парадним маршем перед табором Потоцького.",
                "imageType": null
            },
            {
                "text": "Вкінці дали сальву і попрямували до позицій Хмельницького.",
                "imageType": "camp"
            },
            {
                "text": "Ця виставала мала неабиякий резонанс у війську карателів. Одразу ж послали послів, щоб домовиться про надання відходу польському війську.",
                "imageType": null
            },
            {
                "text": "Після довгих переговорів, які козаки спеціально затягували, вирішено було відмовити полякам.",
                "imageType": null
            },
            {
                "text": "Через цю затримку військо татар встигло приєднатися до козаків.",
                "imageType": null
            },
            {
                "text": "Серед табору поляків піднялась паніка. Слуги та жовніри знали, що їх у будь-яку хвилину шляхта покине напризволяще, тому атмосфера недовіри стала наростати з кожною годиною.",
                "imageType": null
            },
            {
                "text": "На наступний день козаки разом з татарами стали штурмувати табір ляхів. Перший підхід був невдалим. Козаки його здійснили лише для того, щоб внести ще більший розкол у військо карателів.",
                "imageType": null
            },
            {
                "text": "На наступний день табір поляків почав рух у напрямку Корсуня. Його супроводжували татари, постійно тримаючи відступаючих у напрузі.",
                "imageType": "camp"
            },
            {
                "text": "Хмельницький наказав Нечаю і ще п’ятьом сотням козаків з Переяславського полку висунутися вперед і перегородити дорогу відступаючим військам.",
                "imageType": null
            },
            {
                "text": "Він не міг випустити їх, бо біля Корсуня стояло інше військо старшого Потоцького. Об‘єднавшись, вони б стали загрозливою силою.",
                "imageType": null
            },
            {
                "text": "Іван Гладкий був козаком Ново Басанської сотні. Разом з іншими вони потайки вночі вирушили на переріз можливому відступу неприятеля.",
                "imageType": "cossacks"
            },
            {
                "text": "Від‘їхавши двадцять кілометрів від табору, Нечай наказав спішитись. Коней увели в лісок неподалеку, козаки забрали весь реманент та з першими променями сонця почали копати укріплення.",
                "imageType": null
            },
            {
                "text": "Задум був зупинити табір, що відступав, і ударити по ньому. Одночасно ззаду б на них наскочили татари з іншими козаками і завершили розгром.",
                "imageType": null
            },
            {
                "text": "Дві сотні козаків встали на лопати й почали зводити рів прямо поперек шляху. Природній яр з боків оточував лісок, то ж місце для засідки було ідеальним.",
                "imageType": null
            },
            {
                "text": "По всіх сторонах постійно роз'їжджали дозори, щоб ляхи не застали зненацька все товариство.",
                "imageType": "forest"
            },
            {
                "text": "Рів копали по пояс, землю виносили на укріплення позиції зліва і справа. Таким чином утворився напівмісяць оборони. Попавши в такий мішок, поляки б були розстріляні з трьох сторін.",
                "imageType": null
            },
            {
                "text": "Сотні копали по черзі. Одна була постійно при зброї та готова була швидко викотити вози для зустрічі ворога. Друга сотня копала, третя відпочивала або виносила землю.",
                "imageType": null
            },
            {
                "text": "Фронтальний рів мав бути як змога більш непоказним. Польська кіннота могла ударити по позиціях козаків, але наткнувшись на рів втратила б всю динаміку і була б просто постріляна.",
                "imageType": "camp"
            },
            {
                "text": "Іван як раз носив землю, як до нього підійшов старшина:",
                "imageType": null
            },
            {
                "text": "— Роз‘їзди побачили табір ляхів, донеси землю і залишайся в ліску, або кидай мотлох прямо тут і копай собі окопчик, будеш зустрічати ворога з іншими.",
                "imageType": null
            }
        ]
    },
    "year": 1648
}