{
    "title": "Зустріч в степу",
    "description": "Черговий татарський наліт на прикордонні Канівські землі. Роз'їзд козаків на чолі з отаманом Іваном вирішив влаштувати засідку на татар, що відступали. Перемога буде за українцями, але якої ціною? Все залежить від ваших виборів під час проходження історії.",
    "authors": "Сава Теслюк",
    "root": {
        "endType": null,
        "next": [
            {
                "text": "Продовжити обстріл",
                "nextPage": {
                    "endType": null,
                    "next": [
                        {
                            "text": "Дострелити татарина",
                            "nextPage": {
                                "endType": "ALIVE",
                                "next": [],
                                "nodes": [
                                    {
                                        "text": "Іван заклав стрілу, але щоб дістати татарина, кінь якого перейняв паніку господаря, треба було підвестись вище.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Він зробив десять кроків вверх по могилі, і в цей момент йому в долоню попала стріла.",
                                        "imageType": "cossacks"
                                    },
                                    {
                                        "text": "Упавши, він зламав стрілу іншою рукою і витяг її за гострячок. Стріляти він уже не міг, то ж він схопив два списи і кинувся вниз.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Один з бранців хотів завалити татарина, але його кінь ударив копитом. Вершник повернувся і швидким ударом розсік ключицю бранця. Від удару голова бранців з хлором упала на розрубане плече.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Татарин уже не міг побачити, як ззаду до нього підбіг Іван і кинув спис.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Кидок був таким сильним, що вістря списа вийшло з грудей. Татарин з хрипом почав валитися на бік. Виряченими очима він дивився на гострячок списа, який стирчав у нього перед носом. Він поступово сповз з коня і упав уже мертвим.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Перевага стала за козаками. Татари кинулися тікати.",
                                        "imageType": "river"
                                    },
                                    {
                                        "text": "В цей момент піднялись козаки, які лежали з конями в траві з правого боку.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Не очікувавши цього, коні татар встали на дибки. Козаки накинули на них аркани й потягли по степу.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Ватага татар була розбита. Двоє бранців загинули. Серед козаків було лише двоє поранених та загиблий Сокіл.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Джалай лежав заарканений. На обличчі не було ніяких емоцій. Він розумів, що більше ніколи не побачить своїх рідних. Вони жили бідно і у них не буде грошей на викуп.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "На наступний ранок козаки увійдуть в Канів. До них одразу ж підбіжать жиди і стануть розглядати бранців.",
                                        "imageType": "forest"
                                    },
                                    {
                                        "text": "Іван отримає невелику винагороду від підстарости Канева і чимало грошей за бранців.",
                                        "imageType": "camp"
                                    },
                                    {
                                        "text": "Гроші розподілять між ватагою. Поранених козаків відправлять в Трахтемирів.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "На диво, Джалая і ще двох татар обміняють на українців, яких захопив його більш вдалий брат.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Через двадцять років вони зустрінуться знову, але уже по одному боці,  під час розгрому карального загону ляхів під Жовтими Водами.",
                                        "imageType": "cossacks"
                                    }
                                ]
                            }
                        },
                        {
                            "text": "Обстріляти інших",
                            "nextPage": {
                                "endType": null,
                                "next": [
                                    {
                                        "text": "Дати бранцям вибір",
                                        "nextPage": {
                                            "endType": "ALIVE",
                                            "next": [],
                                            "nodes": [
                                                {
                                                    "text": "Іван вирішив віддати долю татар їх колишнім бранцям.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Чоловіки не думаючи схопили аркани і понесли татар степом. Через 10 хвилин повернулися з обдертими до кісток небіжчиками. Їхні тіла кинуть посеред степу.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Іван повантажив двох убитих на коней і вирушив в бік Канева. Треба було поховати загиблих.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Двоє безсімейних чоловіків попросились у ватагу, їхній хутір спалили. То ж не було куди повертатись.",
                                                    "imageType": "camp"
                                                },
                                                {
                                                    "text": "Козаки ішли під Чумацьким Шляхом. Вони чудово орієнтувалися вночі. На ранок вони дійдуть до фортечки. Жінки з дітьми почнуть голосити, побачивши тіла загиблих на конях. Врятовані бранці отримали свою свободу назад великою ціною.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Сокола поховають над Дніпром, він буде вічно видивлятися ворогів України в степу.",
                                                    "imageType": "river"
                                                }
                                            ]
                                        }
                                    },
                                    {
                                        "text": "Залишити татар за собою",
                                        "nextPage": {
                                            "endType": "ALIVE",
                                            "next": [],
                                            "nodes": [
                                                {
                                                    "text": "Іван вирішив не гарячкувати і відділив бранців від татар.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Двоє чоловіків кидалися на татар, але це були живі гроші, які жиди з радістю заплатять.",
                                                    "imageType": "cossacks"
                                                },
                                                {
                                                    "text": "Ватага повантажила загиблих на коней. Трупи татар ніхто не чіпав. Під Чумацьким шляхом вони повертались додому з рейду.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "На ранок вони дійдуть до замочка. Жінки почнуть голосити, побачивши своїх чоловіків, які загинули за свободу інших.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Татар продадуть жидам, а гроші віддадуть родинам загиблих.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Звільнені бранці залишаться в Каневі. Їх оселі спалено, повертатися немає куди. Дехто приєднається до ватаги Івана.",
                                                    "imageType": "river"
                                                },
                                                {
                                                    "text": "Сокола поховають на березі Дніпра, де через двісті років зведуть величезний курган для поховання іншого героя — Тараса. Вони вдвох будуть стежити за степом.",
                                                    "imageType": null
                                                }
                                            ]
                                        }
                                    }
                                ],
                                "nodes": [
                                    {
                                        "text": "Іван намагався влучити в інших, але вони постійно крутились. Одним з пострілів він влучив в стегно коня. ",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Ноги коня підкосились і кримчак перелетів через голову , зламавши собі  шию о землю. ",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Один з татар підскочив до бранців і почав їх рубати шаблею.",
                                        "imageType": "forest"
                                    },
                                    {
                                        "text": "Сили були майже рівні, то ж бранці могли перехилити чашу перемоги на бік українців.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Коли було зарубано другого бранця, всі інші зрозуміли, що ніщо їх не врятує. Вони всі разом кинулися на татарина.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Оскільки руки були зв’язані,  вони могли лише зіштовхнути коня. Один бранець з усієї сили ударив плечем в заднє стегно коня.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Кінь ударив обома копитами і скинув татарина. Двоє жінок накинулися на нього не даючи йому встати.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Татарин втратив орієнтацію від падіння. Одна із жінок ударила його коліном в горло, коли той хотів встати. Вершник упав на спину, козачка застрибнула йому на груди й почала видавлювати очі пальцями.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Один з чоловіків уже звільнився, вихопив шаблю татарина і випоров йому живіт.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Вся ця бійня тривала не більше хвилини. Козаки втратили двома убитими. Двоє лежало на землі з розсіченими головами.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Трьох татар привели на аркані до Івана.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Він побачив, що татари зарубали бранців.",
                                        "imageType": null
                                    }
                                ]
                            }
                        }
                    ],
                    "nodes": [
                        {
                            "text": "Козаки двома арканами завалили двох коней, один із татар не встиг зіскочити і йому з хрумкотом переламало хребет під вагою тварини.",
                            "imageType": null
                        },
                        {
                            "text": "Татари не були у боргу, лучники поранили двох козаків, які кинулися на них зі списами.",
                            "imageType": null
                        },
                        {
                            "text": "Сили і досі були рівні, але Іван дістав ще двох вершників.",
                            "imageType": "cossacks"
                        },
                        {
                            "text": "Одна зі стріл зрикошетила об голову коня і зайшла татарину за щоку.",
                            "imageType": null
                        },
                        {
                            "text": "Він почав верещати та намагався витягнути її.",
                            "imageType": null
                        }
                    ]
                }
            },
            {
                "text": "Спуститись на допомогу",
                "nextPage": {
                    "endType": "ALIVE",
                    "next": [],
                    "nodes": [
                        {
                            "text": "Взявши ще чотири стріли, він кинувся вниз.",
                            "imageType": null
                        },
                        {
                            "text": "Іван був самим умілим стрільцем в Каневі. Його учень, Сокіл, був другим.",
                            "imageType": null
                        },
                        {
                            "text": "Козаки і татари крутили хороводи на конях, кожен намагався спіймати на аркан іншого.",
                            "imageType": "cossacks"
                        },
                        {
                            "text": "Одного з коней татар вдалося стриножити, він завалився і скинув вершника.",
                            "imageType": null
                        },
                        {
                            "text": "На нього одразу ж накинулись бранці та забили ногами до смерті.",
                            "imageType": null
                        },
                        {
                            "text": "Інший татарин вирішив зрубати бранців, які почали звільнювати одне одного.",
                            "imageType": null
                        },
                        {
                            "text": "Він устиг розсікти навпіл голову одному, але влучний постріл з лука пробив йому горло.",
                            "imageType": null
                        },
                        {
                            "text": "З розірваної артерії почала виливатися кров. Перші п'ять секунд бив фонтан, татарин схилився на голову коня.",
                            "imageType": null
                        },
                        {
                            "text": "Коню залило очі й він збожеволів. Його почало носити між бранцями, якщо він відчував під копитами тіла, то починав гарцювати по них.",
                            "imageType": null
                        },
                        {
                            "text": "Кінь встиг забити двох бранців, як підскочив Глухий на коні і жбурнув списа. Вістря увійшло як раз під лопатку в серце.",
                            "imageType": null
                        },
                        {
                            "text": "Бранці забрали зброю убитих і приєднались до різанини.",
                            "imageType": "cossacks"
                        },
                        {
                            "text": "Їх оточили. Вони билися як скажені леви.",
                            "imageType": null
                        },
                        {
                            "text": "Іван не хотів більше втрат зі свого боку.",
                            "imageType": null
                        },
                        {
                            "text": "Він застрелив двох татар, які відбивалися луком.",
                            "imageType": null
                        },
                        {
                            "text": "Інших заарканили та завалили на землю.",
                            "imageType": "cossacks"
                        },
                        {
                            "text": "Всі накинулись і почали їх бити. Двох татар прив'язали за руки до коней. Їх хотіли розтягти живими.",
                            "imageType": null
                        },
                        {
                            "text": "В цю справу втрутився Іван. Він наказав припинити катування, але бранці його не слухались.",
                            "imageType": null
                        },
                        {
                            "text": "Глухий і Гладкий, двоє найвірніших козаків з його ватаги, ударили найгарячіших бранців тупим кінцем в груди. Треба було погасити свавілля в перші ж хвилини.",
                            "imageType": "cossacks"
                        },
                        {
                            "text": "Між українцями почалася колотнеча. Але в цю хвилини підійшли козаки, які дорізали утікших на конях татар.",
                            "imageType": null
                        },
                        {
                            "text": "Вони почали бити тупим кінцем шаблі по головах колишніх бранців, поки всіх не повалили на землю.",
                            "imageType": null
                        },
                        {
                            "text": "Жінки з дітьми з жахом в очах дивилися на все це. Вони боялись підійти до своїх звільнених чоловіків, бо могли отримати на горіхи.",
                            "imageType": null
                        },
                        {
                            "text": "Двох бранців, які почали бунт, прив'язали до коней і хотіли протягти степом. Жінки кинулися на коней і повисли на їх мордах, не даючи стратити своїх чоловіків. Вони хотіли зупинити екзекуцію.",
                            "imageType": "steppe"
                        },
                        {
                            "text": "Іван наказав припинити. Таким чином він зміг подавити розгардіяш між своїми. Ніхто б по степу своїх не тягнув, але це справило неабиякий страх на звільнених бранців. І вони стали виконувати його накази.",
                            "imageType": null
                        },
                        {
                            "text": "Отаман підійшов до полонених татар. Вони мали жалюгідний вигляд. Їх уже ніхто не спасе, а сім'ї не мають грошей, щоб викупити з неволі. У половини татар обличчя розпухло від побоїв.",
                            "imageType": null
                        },
                        {
                            "text": "Їх продадуть жидам в Каневі. Вони закінчать своє життя або працюючи десь на господарстві в Литві, або, якщо повезе, наймуться на службу до литовських татар.",
                            "imageType": null
                        },
                        {
                            "text": "Поранених татар доріжуть. Всіх загиблих повантажать на коней і підуть серед ночі в  Канів.",
                            "imageType": null
                        },
                        {
                            "text": "Іван буде вести коня з загиблим Соколом. Всі козаки з ватаги чудово орієнтуються по Чумацькому Шляху. Дорога буде мовчазна.",
                            "imageType": "forest"
                        },
                        {
                            "text": "На ранок вони увійдуть в канівські землі.",
                            "imageType": null
                        },
                        {
                            "text": "Загиблих бранців передадуть їх родинам.",
                            "imageType": null
                        },
                        {
                            "text": "В Каневі їх зустрінуть жиди, які уже отримали звістку про наліт татар. Отримані гроші Іван розділить між своєю ватагою.",
                            "imageType": null
                        },
                        {
                            "text": "Четверо звільнених бранців попросяться в козаки.",
                            "imageType": null
                        },
                        {
                            "text": "Сокола поховають на новому кладовищі. Він назавжди залишиться спостерігати за українським степом.",
                            "imageType": "river"
                        }
                    ]
                }
            }
        ],
        "nodes": [
            {
                "text": "Сонце заходило за горизонт. Зліва від нього швидко йшла невеличка колона татар.",
                "imageType": "forest"
            },
            {
                "text": "Вершники оточували дванадцять бранців, яких увели з козацьких земель.",
                "imageType": null
            },
            {
                "text": "Це був рейд малими силами на прикордонні села. Він був не дуже вдалим, майже всі встигли розбігтися, але дехто все ж таки попав в полон.",
                "imageType": null
            },
            {
                "text": "Татари прямували до переправи на свій берег Дніпра. Там вони будуть уже в безпеці.",
                "imageType": null
            },
            {
                "text": "Воїни періодично залазили з ногами на коня і в повний зріст видивлялися, чи є якісь силуети в степу.",
                "imageType": null
            },
            {
                "text": "Татар було дуже мало, цей рейд не мав підтримки Кримського хана, а був здійсненим ватажком прикордонних татар, якому дозволялось турбувати козацькі землі.",
                "imageType": null
            },
            {
                "text": "Водночас, з півдня широкою лавою по степу на конях йшла шерега козаків.",
                "imageType": "steppe"
            },
            {
                "text": "Їх чатові помітили рейд татар. Але, через те, що він був не великий, вирішили просто спостерігати за ним. Через деякий час втратили їх слід.",
                "imageType": null
            },
            {
                "text": "Вони намагалися знайти сліди походу до заходу сонця, бо потім когось вполювати в степу вночі буде важко.",
                "imageType": null
            },
            {
                "text": "Козак на прізвисько Сокіл заліз на прадавню могилу і став видивлятися степ. Він міг на відстані у пів степу побачити колір сукна на шапці.",
                "imageType": null
            },
            {
                "text": "Інші козаки часто глузували з нього і тикали дулі, або показували інші непристойні жести, коли знали, що він сьогодні працює очима степу.",
                "imageType": "cossacks"
            },
            {
                "text": "Раптом Сокіл побачив дим, який підіймався з іншої фігури. Це означало, що на якесь село група все-таки напала.",
                "imageType": null
            },
            {
                "text": "Іван, голова заслону козаків, знав, що татар мало і вони своїми силами можуть їх розігнати.",
                "imageType": null
            },
            {
                "text": "Кримчаки ніколи не воюють, якщо не мають перевагу в чисельності або у мобільності.",
                "imageType": null
            },
            {
                "text": "Козаки мали лише шаблі, луки і списи, то ж могли доволі швидко пересуватися.",
                "imageType": null
            },
            {
                "text": "Іван окликнув козака на прізвисько Глухий. Той підійшов до нього.",
                "imageType": "cossacks"
            },
            {
                "text": "Він наказав послухати степ, чи чутно кінський тупіт.",
                "imageType": null
            },
            {
                "text": "Глухий відійшов декілька десятків метрів, розчистив траву і ліг на вухо. ",
                "imageType": null
            },
            {
                "text": "Інші завмерли. Через деякий час Глухий повернувся. Він почув тупіт, татари були десь не далеко.",
                "imageType": null
            },
            {
                "text": "Іван прийняв рішення виставити заслін цій групі. Оскільки одна з фігур палала, то це означало, що татари вчинили наскок і могли повертатися з бранцями.",
                "imageType": null
            },
            {
                "text": "Татари потерпали від напасті сарани, яка другий рік прилітала з Азова. Тому вони вимушені були всупереч забороні хана ходити в Україну, щоб забрати бранців і продати їх.",
                "imageType": null
            },
            {
                "text": "Іванів заслін вважався найкращим в землях біля Канева, бо він постійно передбачував напади татар і керував загонами в степу.",
                "imageType": "camp"
            },
            {
                "text": "Одного разу вони пролежали разом з конями в густій степовій траві троє діб.",
                "imageType": null
            },
            {
                "text": "Татари не бачили пом'ятої трави та безпечно поверталися з рейду. Але козаки миттю підняли коней, дехто навіть просто застрибнув на татар, що нічого не очікували.",
                "imageType": null
            },
            {
                "text": "Щоб зламати волю до опору, козаки одразу убивали декількох татар, і поки інші ще не оговтались ловили їх на аркан.",
                "imageType": null
            },
            {
                "text": "Спійманих татар потім продавали жидам, або укладати договір, щоб обміняти своїх родичів, якщо вони ще в Криму.",
                "imageType": null
            },
            {
                "text": "Такий же план був у Івана в голові й тут. Сокіл, лежачи на могилі, побачив татар. Вони вирішили обійти пагорб з правої сторони.",
                "imageType": null
            },
            {
                "text": "Іван з Соколом лягли на могилу і стали натягувати луки. Інші козаки лягли на конях з флангу, третя група зі списами залегла прямо на шляху.",
                "imageType": "cossacks"
            },
            {
                "text": "Татари не могли бачити приготування козаків, адже їх закривала скіфська могила.",
                "imageType": null
            },
            {
                "text": "Коли до могили залишилося 300 кроків, кінь Джалая, отамана татар, різко повів головою вправо. Для татарина це був поганий знак. Він сповільнив ватагу і татари миттю натягнули луки.",
                "imageType": null
            },
            {
                "text": "Ліва рука отамана почала сушити. В дитинстві він отримав кулю від козака і тепер, коли мав погані передчуття, вона завжди нагадувала йому про себе.",
                "imageType": null
            },
            {
                "text": "Він був упевнений, що їх ніхто не помітив, а кінь міг злякатися зайців, яких тут було безліч, адже вони всі втекли з півдня від сарани.",
                "imageType": null
            },
            {
                "text": "Руку відпустило, він дав наказ іти далі. Але луки тримали на готові.",
                "imageType": "bulrush"
            },
            {
                "text": "Іван з Соколом уже не бачили цих приготувань татар, бо чекали їх з іншого боку і боялися, що татари помітять їх на могилі.",
                "imageType": null
            },
            {
                "text": "За наміром, він із Соколом мали вистрілити з луків і цим дати команду пішим і кінним напасти на групу.",
                "imageType": null
            },
            {
                "text": "Стріла лежала на тетиві, Іван побачив, як татари наблизились.",
                "imageType": null
            },
            {
                "text": "Вони вдвох різко випрямились і вистрілили з луків.",
                "imageType": null
            },
            {
                "text": "На диво, татари були готові та майже одночасно вистрілили у відповідь.",
                "imageType": "forest"
            },
            {
                "text": "Сокіл упав на землю, з його лівого ока стирчала стріла. Ноги почало бити в конвульсіях. Через судому на обличчі він майже відкусив собі нижню губу.",
                "imageType": null
            },
            {
                "text": "Жодна з емоцій не промайнула в голові отамана. Сокіл був уже не жилець, а бій ще треба було виграти. Він закладав стрілу одна за іншою.",
                "imageType": null
            },
            {
                "text": "Два татарина упало з першими пострілами, які вони встигли зробити.",
                "imageType": null
            },
            {
                "text": "Внизу почалася рукопашна бійка.",
                "imageType": "forest"
            }
        ]
    },
    "year": 1628
}