{
    "title": "After the Battle",
    "description": "At the beginning of the XVII century a confrontation flares up between the Polish-Lithuanian Commonwealth and the Ottoman Empire. As a result of a devastating defeat at the Battle of Cecora, a lot of noblemen, Cossacks, and soldiers are killed or captured by Turks and Tatars. The fate of a young Cossack, wayfaring through the Wild Fields in a desperate attempt to escape from captivity, depends on the choices of the reader of this interactive fiction. All the challenges are equally hard: surviving in the steppe, avoiding the revenge of the Tatars, winning the trust of the Cossack fisherman and returning home. But the battle that will change the course of history is fast approaching. Will the main character be able to participate in it and stay alive? And how will his life go from there? – Only you know the answer!",
    "authors": "Konstantin Boytsov, Anastasiia Tsapenko",
    "year": 1620,
    "root": {
        "endType": null,
        "nodes": [
            {
                "text": "Dmytro lay hidden in the thicket far from the water, listening carefully to the nearby sounds. Pesky gnats needled his face and neck. A little further off on the shore, where the reeds gave place to steppe grass and sparsely growing trees, three men had settled near a fire. The runaway couldn’t see them, but he could sometimes hear fragments of their conversation and the clatter of provisions passed on by the wind. They were Tatars. Dmytro was trying to hear whether they were there for him.",
                "imageType": "river"
            },
            {
                "text": "The Cossack lay like this for a long time, covering his head with his hands until it was completely dark. The wind increased, blocking out all other sounds except for the haunting song of the rustling reeds. The wispy clouds were driven westward, creating a covering for the weak light of the crescent moon. Dmytro couldn’t wait any longer."
            },
            {
                "imageType": "bulrush",
                "text": "The runaway had to crawl once again since the river bank had risen. Suddenly, he spotted a solitary fire glowing in the dark sea of the steppe."
            },
            {
                "text": "In the rare times the moonlight was visible, it was possible to glimpse the silhouettes of people and horses. Two were sleeping on the ground facing each other. A third was sitting closer to the fire, leaning against a short spear and, seemingly, also sleeping. It was harder to make out the horses as they slept on the other side of the fire, but there appeared to be at least five of them."
            },
            {
                "imageType": "camp",
                "text": "Dmytro crawled to the nearest Tatar and quietly rose to his knees, ready to stick the knife in the Tatar’s eye if he moved. Nearby was a bow, a quiver with arrows, and a knapsack."
            }
        ],
        "next": [
            {
                "text": "Take the bow, quiver and knapsack",
                "nextPage": {
                    "nodes": [
                        {
                            "text": "The Cossack didn’t dare to touch anything else and with his takings made the way back to the reeds and distanced himself from the riders, following the river upstream."
                        },
                        {
                            "imageType": "steppe",
                            "text": "Farther away, a good range from the camp, there was small hill which revealed that in the back of the steppe there glimmered not one, but two fires. The second one was some distance from the river and it was hard to spot. There were more Tatars here than Dmytro thought. He moved on, keeping in mind there was little time. Soon, both fires disappeared in the fog. The first cold autumn night had come to the Wild Fields."
                        },
                        {
                            "text": "The reeds were replaced by grass, the grass by rocks, and the rocks by ravines. A lot of time had passed since the runaway had started his journey along the river bank. Having passed another hollow that led to the Dnipro, the Cossack set off into the steppe, away from the river.",
                            "imageType": "steppe"
                        },
                        {
                            "text": "Dmytro was walking among low-lying hills when he suddenly caught the scent of something burning. On one of the hillocks, he got a good view of the surroundings. There was no fire or smoke anywhere. However, in the distance he caught a glimpse of a copse of trees. The runaway headed towards the woods. As he did so, the smell of smoke became stronger. Up close, the wood showed signs of a forest fire – blackened tree trunks stuck out like poles, merging together and disappearing in the darkness. Behind the trees there was a slight hollow where a small brook flowed hidden from sight by several boulders the size of a horse-cart. The ground was covered by a thick layer of cold ashes."
                        },
                        {
                            "text": "The man settled near the boulder closest to the brook, holding the bow and arrow at the ready, and started to look through the Tartar’s knapsack."
                        },
                        {
                            "text": "The first thing he found was a firesteel tied to a gray bag that contained pieces of flint and tinder from burnt rags. There was also some dried bread, several pieces of dried horse meat wrapped in sackcloth, a copper jug, and a scabbard for a knife or a dagger. The scabbard, made from rough leather, would have been a simple one if not for the moldings on it and the semiprecious stone at its center. There was no dagger in the knapsack. Since the knife that Dmytro had was too small for the scabbard, he put it back in the knapsack.",
                            "imageType": "forest"
                        },
                        {
                            "text": "Night air became bone-chilling."
                        }
                    ],
                    "next": [
                        {
                            "text": "Set fire",
                            "nextPage": {
                                "nodes": [
                                    {
                                        "text": "Dmytro didn’t have an overcoat so he went to gather burnt branches and placed them beside a boulder that had a flat vertical surface, turned inwards to the hollow where the brook ran. The Tartar’s tinder and firesteel had come in handy. The Cossack lit a fire, hoping that the hollow behind the bolder would help him hide the fire. The charred logs burned quickly and almost without any smoke, leaving behind glowing embers. In a small span of time, the Cossack had enough embers that he could start adding some bigger pieces of word to the fire. He found some twigs to create a makeshift bedding near the fire. Bringing some more logs to the fire, Dmytro spread the embers around the perimeter of the boulder. Worn and tired, he placed a jug with spring water right next to the fire to soften the dried bread and horse meat. The simple food and the warmth from the embers, which radiated from the tall boulders, finally warmed him up. The Cossack slept until dawn, waking up from time to time to add wood to the fire or to drink some water. At last, the sky was starting to clear up. A new day began."
                                    },
                                    {
                                        "text": "The wind from the east brought some denser clouds that blocked out the sun, so the morning was cloudy. Dmytro woke up, as it seemed to him, due to some faraway sound. There was only a pile of ash left from last night’s fire, but the surrounding boulders still preserved some of the warmth from the fire, keeping the morning cold at bay. The Cossack got up quickly, grabbed the knapsack, the bow and quiver of arrows, and set off for the opposite side of the hollow. He then turned left and, making a wide circle, returned to the edge of the burnt forest, a little way off from the place where he had entered the forest."
                                    },
                                    {
                                        "text": "Meanwhile deep in the woods, a Tartar looked at Dmytro’s footprints in the ashes. He then got up and took a good look at his surroundings. As much as Dmytro could see from his hiding spot, it was the very same Tartar whose things Dmytro had taken the night before. What’s more, the Tartar was by himself."
                                    }
                                ],
                                "next": [
                                    {
                                        "text": "Shoot a bow",
                                        "nextPage": {
                                            "nodes": [
                                                {
                                                    "text": "The Cossack nocked the arrow, drew the bow, aimed carefully and released the arrow. The Tartar made a noise and collapsed to the burnt ground. Dmytro waited for a while – nobody appeared. Then he carefully walked forward. The Tartar didn’t seem to be breathing anymore."
                                                },
                                                {
                                                    "imageType": "forest",
                                                    "text": "In a little bit, Dmytro emerged from the burnt woods donning a hat, a slightly bloodied overcoat, and a curved Tartar saber on his belt. Not far in the steppe there was a small stallion with a saddle. The Cossack approached him, whispering words that he had learned as young boy when caring for horses, and looked into the animal’s eyes. Not meeting any resistance, he quickly mounted the horse and galloped off into the distance. In a few minutes, rain started to fall from the leaden sky, slowly but steadily soaking the russet dried grass of the steppe."
                                                },
                                                {
                                                    "text": "Dmytro rode through the steppe without stopping. Sometimes he changed directions as he approached the river, but as soon as he could see the shore, he turned to the steppe again. The rain fell without stopping, soaking Dmytro’s clothing and things. However, the sleep he had gotten the night before gave the Cossack strength, so he didn’t pay attention to such trifles. The steppe horse also proved to be a hardy creature, showing no signs of fatigue. With the new owner in the saddle, he galloped steadily into the unknown through the tall grass, wind and rain."
                                                },
                                                {
                                                    "text": "The terrain became even more hilly, from place to place rocks emerged from the earth. Once again turning to the west, Dmytro rode to one of the cliffs. The river stretched out below, wide and calm, decked with reeds, boulders, islands and shrouded in fog. In the middle there was a large island, completely flat and covered with willows and shrubs. The dark silhouette of a small boat moved briskly against the current from the northern end of the island, gradually disappearing in the coastal thickets."
                                                },
                                                {
                                                    "text": "Dmytro managed to ride a a little more until he approached a small stream which, however, ran down into a deep chasm, flowing down to the Dnipro River. Nearby, there was a barely noticeable trail that led downhill. "
                                                },
                                                {
                                                    "text": "Dmytro got down from his horse and started the steep trek down the trail, guiding the horse by the reins."
                                                },
                                                {
                                                    "imageType": "steppe",
                                                    "text": "The trail led to a wide clearing surrounded by willows and hidden by cliffs in the place where the stream joined the big river."
                                                }
                                            ],
                                            "next": [
                                                {
                                                    "text": "Take a look at the clearing",
                                                    "nextPage": {
                                                        "nodes": [
                                                            {
                                                                "text": "Dmytro released his horse and set off into the thickets, keeping a vigilant eye on the surroundings. He had walked only a couple of paces when he heard the click of a gun being cocked behind his back. The runaway froze."
                                                            },
                                                            {
                                                                "imageType": "forest",
                                                                "text": "What faith are you?” Said the voice behind him."
                                                            },
                                                            {
                                                                "text": "The faith of the Rus,” Dmytro confidently replied and slowly turned around. Behind him stood two men, which had appeared from nowhere. Without the gun and sabers, and spear, he would have taken them for fishermen."
                                                            },
                                                            {
                                                                "text": "Cross yourself if you are a good man,” said another man. The runaway crossed himself three times."
                                                            },
                                                            {
                                                                "text": "Let’s go,” said the one with the gun. He didn’t lower the weapon but inclined his head towards the willows. All three walked down the hill to the trees. The man with the spear threw a small bag onto Dmytro’s head that reeked of fish and pushed him in the back."
                                                            },
                                                            {
                                                                "imageType": "river",
                                                                "text": "Go on, go on,” someone grabbed the runaway by the arm and led the way. They walked only a short while before Dmytro had to bend over and walk down some stairs. A door creaked. Someone pulled the bag off his head. They were in a long, shadowy cabin with an earthen floor covered by reeds. On the benches at a table of rough logs sat a large group of armed men. The light barely passed through the bottles inserted close to the ceiling of the earthen walls of the cabin. Dust and smoke circulated in the rays of light coming through the bottles. An icon of the Holy Virgin hung in the corner illuminated by a candle."
                                                            },
                                                            {
                                                                "text": "Dmytro was questioned about his origins and whereabouts. He told them how he was captured along with other Cossacks by the Tartars at Cecora, how he was taken to Crimea, and about his escape at the crossing during the confusion that ensued when someone suddenly attacked the Tartars."
                                                            },
                                                            {
                                                                "text": "All the men listened attentively. Then Dmytro was taken outside the cabin with the same precautions as when he had been taken in. He sat below a willow while the man with the gun guarded him. The runaway asked for some water. The guard carefully gave him a clay flask and allowed him to take a few sips. Soon about a dozen men emerged from behind the trees. Some of them Dmytro recognized from the earth cabin. A stocky man holding a long stick with a noose at one end stepped to the front of the crowd. “You are no captive Cossack, but a spy!”- He loudly proclaimed. The crowd shouted approvingly. The noose was thrown around Dmytro’s neck and he was pulled to the Dnipro. It was futile to resist and he almost had no strength left in him."
                                                            },
                                                            {
                                                                "imageType": "river",
                                                                "text": "When he was near the water, someone offered him to pray for the last time. The runaway started to say something when a strange noise came from the clearing. A man ran along the path, waving his saber and shouting something. Suddenly, he swayed, made a few hesitant steps and collapsed. A crimson stain was quickly spreading on the back of his shirt. Someone ran up to him from the crowd that had gathered near the shore. Several arrows whistled by and a gun had been fired somewhere close. The air was filled with smoke. People grabbed their weapons and ran down the path to the clearing. Dmytro was pushed out of the water and left lying on the shore."
                                                            }
                                                        ],
                                                        "next": [
                                                            {
                                                                "text": "Hide in the reeds",
                                                                "nextPage": {
                                                                    "endType": "alive",
                                                                    "nodes": [
                                                                        {
                                                                            "text": "Dmytro focused all his energy on paddling until the last rays of the sun glimmered on the glassy surface of the river. At that time, the stern of the boat had landed on the nameless patch of earth in the middle of the mighty river."
                                                                        },
                                                                        {
                                                                            "imageType": "river",
                                                                            "text": "The island was heavily overgrown with shrubs. It took some elbow grease for Dmytro to pull the boat ashore. On the other hand, the thicket hid everything that was on the island from any onlooker on shore or in the water."
                                                                        },
                                                                        {
                                                                            "text": "The fugitive surveyed the goods. Among the things, he found everything needed for life: food, cooking utensils, a wide knife, a firesteel, and even a pipe and a pouch tobacco."
                                                                        },
                                                                        {
                                                                            "text": "To get to the middle of the island, which could have been about a hundred steps, he had to bend over and crawl through the thickets. In the middle of the island grew three ancient trees, so burly and thick that no bushes could grow in their vicinity. The ground was heavily covered with twigs and yellowed leaves."
                                                                        },
                                                                        {
                                                                            "text": "Dmytro dragged his boat supplies and quickly made a reed shack. Then he cooked some grain in a copper jug over a small fire."
                                                                        },
                                                                        {
                                                                            "text": "By then, it was completely dark. The night turned out to be clear, warm and starry. Dmytro left his camp and went to the edge of the island opposite to the one where he had landed. Cutting the reeds, he found that passage to the shore was quite clear here. The thickets weren’t so thick and near the shore there were a couple of stone blocks that created a small shelter. Dmytro left his clothing on the rocks and carefully entered the cold water of the Dnipro. Having entered the river up to his waist, he stopped, admiring the reflection of the stars in the water. Suddenly, he seemed to catch a glimpse of that young lady underwater again. Dmytro shook his head – it was most likely his weariness getting the better of him. Despite the cold, the bath brought a sense of relief and washed away the dust of his recent adventures. Returning to the shack, Dmytro barely waited for the fire to die down and fell soundly asleep."
                                                                        },
                                                                        {
                                                                            "text": "In the morning, he quickly gathered, ate a little, and with the first light of dawn was already on the water. Up the current there was a network of straits and tributaries filled with countless small islands, and Dmytro hoped to continue his journey by hiding in the depths of this labyrinth. Currently, his goal was to cross the open space as quickly as possible before the sun had fully risen. Entering one of the straits, the runaway stopped paddling. The boat slid across the water without a sound. The current was much weaker here, so while the boat had stopped and started going backwards, Dmytro turned slightly and listened attentively. Then he made a couple of more strokes with the paddle, leveling the dugout canoe and guiding it forward. Repeating this movements many times, the Cossack slowly made his way through the thickets, trying not to lose his sense of direction. Even the current was no longer helping. In some areas it was hardly noticeable and in other areas the water seemed to move in a circle, pulling the boat into the center of the gyration. Suddenly, larger islands started to appear with patches of hard dry earth and even a couple of bushes. Dmytro went around these islands to the left, then to the right, until he approached a fairly large piece of land with several willows. The island was curved like a crescent moon, and Dmytro was approaching one of its tips while the other tip was visible from a distance. He led the boat to a small bay between the tips of the island. Dmytro surveyed the semicircle of the island’s sandy shore. At first, he didn’t see anything special, but a moment before he turned away something white flashed through the thickets. He vigorously paddled to turn back and surveyed the shallows once again. It seemed that in the depths of the island there was something white that resembled a piece of cloth tied to a tree or pole."
                                                                        },
                                                                        {
                                                                            "imageType": "bulrush",
                                                                            "text": "He wasn’t even surprised that he recognized some of them. Fate had once again led him to the Cossack fishermen. After battle, they had left their camp on the Tartar coast and retreated to this island. Their boats were hidden along the perimeter of the island. It appeared that the whole unit had settled on this island."
                                                                        },
                                                                        {
                                                                            "text": "The runaway was again brought before the leader of the group. Dmytro had a feeling that he wouldn’t be able to escape the second time but help arrived from an unexpected place. A large boat approached the island. The Cossacks in this boat looked refreshed and full of energy. They also had better weapons. They embarked ashore, carrying a large oaken chest among them. Dmytro was escorted away from this new group, but, suddenly, one of the newcomers stopped. “Dmytro?” He asked, surprised, “Dmytro from Bila Tserkva? I though you had died at Yasy! What a meeting!” Dmytro cast a glance at his guards. “How do you do? I also remember you, Stepan! As you see, I ran away from the Tartars, but my Christian brothers almost drowned me.” He clearly remembered this young man who had once persuaded him to leave behind the registered Cossacks and set off for the Wild Fields. They were from the same region, from the Bila Tserkva subdivision. They had met during service and had good relations, but Stepan quickly disappeared after taking something from the treasury. “Good God!” Proclaimed Stepan and went to the center of the island with the others without saying anything more. Dmytro, however, wasn’t led any further but left to sit on the ground under the watchful eye of one of the Cossacks. Soon, Stepan returned and, smiling, said: “I put in a word for you. No one will try to drown you anymore – you can be sure. But come with us to the winter camp. There will be a big war with the Turks. We need manpower."
                                                                        },
                                                                        {
                                                                            "text": "In three days, the group reached the bleak cliffs that rose high above the Dnipro River, so steep that they seemed like great walls reaching towards the sky. The boat that was in front approached these stone giants and suddenly disappeared from sight. And after this boat, the next one vanished as well, and the one after that. When Dmytro’s boat reached the same cliff, he realized that it wasn’t solid. A massive boulder jutted out into the main body of the river, creating a narrow passage, behind which a peaceful stretch of land was safely hidden. In a while, the whole group had disembarked on the mysterious shore."
                                                                        },
                                                                        {
                                                                            "text": "Higher up on the shore was a forest full of ravines and gullies, behind which a small river ran its course into the majestic currents of the Dnipro."
                                                                        },
                                                                        {
                                                                            "imageType": "forest",
                                                                            "text": "When the greater part of the Cossacks had gathered near the edge of the forest, surveying the surroundings, the leader of the group confidently proclaimed: “We will spend winter here!”"
                                                                        },
                                                                        {
                                                                            "text": "men started to unpack the boats."
                                                                        },
                                                                        {
                                                                            "text": "The End of Chapter One"
                                                                        }
                                                                    ],
                                                                    "next": [
                                                                        {
                                                                            "text": "Land on the island",
                                                                            "nextPage": {
                                                                                "endType": "alive",
                                                                                "nodes": [
                                                                                    {
                                                                                        "imageType": "bulrush",
                                                                                        "text": "Dmytro reached the shore, jumped out of the boat into the shallow water and pulled the boat ashore, trying to hide it as well as possible. Having finished this, he went towards the trees where the he had glimpsed something light-colored. He quickly found someone’s makeshift bedding under some willows. It seemed that the place had been left in haste a long time ago. The abandoned tent had been displaced by the wind and there were no ashes in the firepit. However, he couldn’t find any belongings, only a decaying sack and a wooden shovel that had fallen apart due to the moisture. Dmytro walked around a little more, taking a good look at the area. He was ready to return to the boat when he heard a noise from the other side of the island. He listened carefully. It seemed somebody had landed on the other side of the island. He heard low voices but couldn’t decipher what they were saying. The runaway hardly had the time to hide in the nearest thickets when several Cossacks emerged from the opposite side, their bows at the ready. They quickly made their way to the remnants of the abandoned tent. Two others followed right after them. To Dmytro’s surprise, he recognized one of the Cossacks. The young man had once persuaded him to run off to the Wild Fields before disappearing himself."
                                                                                    },
                                                                                    {
                                                                                        "text": "The newcomers carefully surveyed the island. One of the Cossacks moved towards the shore where Dmytro had left his boat. Soon, they had gathered near the tent once again, looking around. Then one of them called out: “Come out in the clearing or we will find you!” Dmytro hesitated a bit, but then he replied, still hidden in the thickets: “Stepan! Stepan from Bila Tserkva? Ask the men not to shoot and I will come out.” The Cossacks started to talk quietly among themselves, somewhat surprised. Then the one whom Dmytro had recognized, proclaimed: “Come out, show yourself.” Dmytro slowly got up and came out of the thickets. Stepan also recognized him and couldn’t hide his surprise: “Which wind brought you here? What a meeting! So you also decided to join the Zaporozhians?”"
                                                                                    },
                                                                                    {
                                                                                        "text": "It turned out that Stepan belonged to the very same group of Cossacks that had captured Dmytro previously, but he was away when this happened. “Listen, we can’t let you go, but I will do the best I can,” Stepan promised and smiled, adding, “We won’t try to drown you anymore.”"
                                                                                    },
                                                                                    {
                                                                                        "text": "Stepan stayed with the rest of the Cossacks and they sent Dmytro in the company of two Cossacks to their camp on another island. Soon they joined him and Dmytro again was sent to the otaman."
                                                                                    },
                                                                                    {
                                                                                        "text": "He was brought into a small tent under some willows in the middle of the island. In the tent there was a man already familiar  sitting on a barrel. He was short and simply dressed, with a scar covering half his face. A pipe rested between his lips. There were two Cossacks sitting near the entrance on a bedding of hay, talking energetically among themselves and smoking their pipes. Aromatic smoke rose to the top of the tent, winding in fanciful loops and pouring out in swaths from the open entrance of the tent."
                                                                                    },
                                                                                    {
                                                                                        "text": "The conversation turned out to be more pleasant this time. Since Stepan had vouched for the runaway, Dmytro was permitted to stay with the Cossacks and spend the winter with them. On the other hand, he didn’t have any better options."
                                                                                    },
                                                                                    {
                                                                                        "imageType": "river",
                                                                                        "text": "In three days, the group reached the bleak cliffs that rose high above the Dnipro River, so steep that they seemed like great walls reaching towards the sky. The boat that was in front approached these stone giants and suddenly disappeared from sight. And after this boat, the next one vanished as well, and the one after that. When Dmytro’s boat reached the same cliff, he realized that it wasn’t solid. A massive boulder jutted out into the main body of the river, creating a narrow passage, behind which a peaceful stretch of land was safely hidden. In a while, the whole group had disembarked on the mysterious shore."
                                                                                    },
                                                                                    {
                                                                                        "text": "Higher up on the shore was a forest full of ravines and gullies, behind which a small river ran its course into the majestic currents of the Dnipro."
                                                                                    },
                                                                                    {
                                                                                        "text": "When the greater part of the Cossacks had gathered near the edge of the forest, surveying the surroundings, the leader of the group confidently proclaimed: “We will spend winter here!”"
                                                                                    },
                                                                                    {
                                                                                        "text": "men started to unpack the boats."
                                                                                    },
                                                                                    {
                                                                                        "text": "The End of Chapter One"
                                                                                    }
                                                                                ],
                                                                                "next": []
                                                                            }
                                                                        },
                                                                        {
                                                                            "text": "Move along",
                                                                            "nextPage": {
                                                                                "endType": "alive",
                                                                                "nodes": [
                                                                                    {
                                                                                        "text": "Mulling over for a while, Dmytro decided to not waste time on the mysterious island and continued his journey."
                                                                                    },
                                                                                    {
                                                                                        "text": "The runaway entered another tributary of the river, incredibly long, like a river or a channel. It gradually became narrower, making a sharp bend at the end, and becoming hardly big enough for the boat to move through. On the left side, there was a fairly large plot of land with a good smattering of trees and reeds. The reed thickets stretched for at least ten paces between the trees and the water. Dmytro couldn’t find a clearing by which he could approach the island. Suddenly, from behind him came a long shadow and he heard water splash. The Cossack immediately understood that another boat was approaching through the thickets behind him. Dmytro paddled with all his strength, not even looking back, but far ahead of him another boat emerged from the reeds and blocked the tributary. It was then that Dmytro noticed a clearing in the reeds that led to the island. He directed his boat that way and soon landed in the shallows. Several armed men immediately appeared on the shore. One of them told Dmytro to get out of the boat and come on land."
                                                                                    },
                                                                                    {
                                                                                        "text": "He wasn’t even surprised that he recognized some of them. Fate had once again led him to the Cossack fishermen. After battle, they had left their camp on the Tartar coast and retreated to this island. Their boats were hidden along the perimeter of the island. It appeared that the whole unit had settled on this island."
                                                                                    },
                                                                                    {
                                                                                        "text": "The runaway was again brought before the leader of the group. Dmytro had a feeling that he wouldn’t be able to escape the second time but help arrived from an unexpected place. A large boat approached the island. The Cossacks in this boat looked refreshed and full of energy. They also had better weapons. They embarked ashore, carrying a large oaken chest among them. Dmytro was escorted away from this new group, but, suddenly, one of the newcomers stopped. “Dmytro?” He asked, surprised, “Dmytro from Bila Tserkva? I though you had died at Yasy! What a meeting!” Dmytro cast a glance at his guards. “How do you do? I also remember you, Stepan! As you see, I ran away from the Tartars, but my Christian brothers almost drowned me.” He clearly remembered this young man who had once persuaded him to leave behind the registered Cossacks and set off for the Wild Fields. They were from the same region, from the Bila Tserkva subdivision. They had met during service and had good relations, but Stepan quickly disappeared after taking something from the treasury. “Good God!” Proclaimed Stepan and went to the center of the island with the others without saying anything more. Dmytro, however, wasn’t led any further but left to sit on the ground under the watchful eye of one of the Cossacks. Soon, Stepan returned and, smiling, said: “I put in a word for you. No one will try to drown you anymore – you can be sure. But come with us to the winter camp. There will be a big war with the Turks. We need manpower.”"
                                                                                    },
                                                                                    {
                                                                                        "text": "In three days, the group reached the bleak cliffs that rose high above the Dnipro River, so steep that they seemed like great walls reaching towards the sky. The boat that was in front approached these stone giants and suddenly disappeared from sight. And after this boat, the next one vanished as well, and the one after that. When Dmytro’s boat reached the same cliff, he realized that it wasn’t solid. A massive boulder jutted out into the main body of the river, creating a narrow passage, behind which a peaceful stretch of land was safely hidden. In a while, the whole group had disembarked on the mysterious shore."
                                                                                    },
                                                                                    {
                                                                                        "text": "Higher up on the shore was a forest full of ravines and gullies, behind which a small river ran its course into the majestic currents of the Dnipro."
                                                                                    },
                                                                                    {
                                                                                        "imageType": "forest",
                                                                                        "text": "When the greater part of the Cossacks had gathered near the edge of the forest, surveying the surroundings, the leader of the group confidently proclaimed: “We will spend winter here!”"
                                                                                    },
                                                                                    {
                                                                                        "text": "men started to unpack the boats."
                                                                                    },
                                                                                    {
                                                                                        "text": "The End of Chapter One"
                                                                                    }
                                                                                ],
                                                                                "next": []
                                                                            }
                                                                        }
                                                                    ]
                                                                }
                                                            },
                                                            {
                                                                "text": "Follow the others",
                                                                "nextPage": {
                                                                    "nodes": [
                                                                        {
                                                                            "text": "The noise of battle didn’t subside. On the right side of the river, the reeds caught fire."
                                                                        },
                                                                        {
                                                                            "text": "Dmytro gathered the last of his strength, got up and went in the direction of the clearing. He stopped near the dead man that was lying near the edge of the trail and picked up his saber. When he came out into the open, everything was covered in smoke, with arrows sticking out in different places. The main fight seemed to be somewhere up front. Suddenly, from behind the gray veil of smoke, two Tartars ran directly toward Dmytro. At the same time, something exploded near Dmytro’s left hand. He heard the whistle of artillery, and both of the Tartars fell down, struck by the pellets of a small canon. Dmytro ran forward and saw an opening on the side of a nearby hill from which smoke was coming from. Without stopping to look around, he entered the thick of the battle. At this very moment, the Cossacks were gaining ground on the Tartars, with the latter retreating towards the stream. A little longer and the Tartars were fleeing, sending volleys of arrows from hillsides to the valley. But soon the Cossacks overtook them, and the shooting stopped."
                                                                        },
                                                                        {
                                                                            "text": "Somewhere above, gunshots still rang out, signaling the pursuit of the fugitives, but in the valley everything was quiet. The silence was broken by the moans of the injured that lay in the russet grass in puddles of blood. Surprisingly, there were no Cossacks among them. For a while, Dmytro stood to the side of the clearing, holding his bloodied sabre, until other Cossacks started to approach him, covered in dust, sweat and blood. One of them sat on the ground, catching his breath, another stood nearby, leaning on his rifle and looking up at the sky, another kindled a fire and lit his pipe. All were silent."
                                                                        },
                                                                        {
                                                                            "imageType": "bulrush",
                                                                            "text": "The Cossack that had interrogated Dmytro at the earthen cabin approached the clearing. He asked if anyone had been injured or killed. A few names were mentioned. He shook his head and ordered everyone to gather near the river. Then he turned to Dmytro: “So you didn’t run away? That’s good…We will decide what to do with you.” And he went to talk to the others. The group disbanded. The Cossacks walked along the valley, looking for their comrades, helping the wounded, and getting their things in order. Some of the dead were brought to the clearing and placed beneath the willows. They didn’t touch the dead Tartars, but only took their weapons."
                                                                        }
                                                                    ],
                                                                    "next": [
                                                                        {
                                                                            "text": "Ask to join in",
                                                                            "nextPage": {
                                                                                "endType": "alive",
                                                                                "nodes": [
                                                                                    {
                                                                                        "text": "The runaway asked to stay with the Cossacks for a while. The warriors didn’t object to this and the gathering dispersed. The camp stirred – people carried things, rolled barrels, collected weapons, pulled the boats from their hiding places on the shore. Everyone was preparing to set sail."
                                                                                    },
                                                                                    {
                                                                                        "text": "Dmytro was approached by a short broad-shouldered man. He was called Ustym and he said that he was looking for volunteers to help transport two heavily injured warriors to a safe place. He hinted that Dmytro could help since he didn’t have any matters to attend to at the camp. The runaway agreed and they walked to the edge of the clearing where the injured lay beneath the willows. Not far away, one of the dead was being buried, his tomb already covered with heavy earth and stones. Close by on the trunk of a willow somebody had carved a wide cross, which was the only sign of mourning for this Cossack’s sad fate."
                                                                                    },
                                                                                    {
                                                                                        "text": "Two more volunteers approached, Ohrim and Ivan. Ustym decided that the four of them would manage on their own. He said that the journey wasn’t a long one."
                                                                                    },
                                                                                    {
                                                                                        "text": "They found a horse to transport the wounded, but there was no cart in the camp since the warriors mainly used boats to move along the river and rarely went out into the steppe to the Tartar coast. So Ustym brought axes and the team started to build a sledge that could be pulled by a horse. One of the volunteers – Ivan, as it turned out, was once a tinsmith, and he quickly created a harness from some ropes, belts and parts of old harnesses. Dmytro had his doubts whether the horse would pull the harness, but the beast turned out to be surprisingly docile when harnessed, obediently pulling the load."
                                                                                    },
                                                                                    {
                                                                                        "text": "The Cossacks hadn’t prepared for departure yet, but the wounded had to be taken away as quickly as possible. Sunset was quickly approaching and those who would transport the wounded couldn’t afford to set up camp on the road. The Cossacks agreed to leave a boat for the four volunteers, which the latter could use to catch up with the warriors on some shore that only Ustym knew about. Having finished their meeting and carefully placed the wounded Cossacks in the sledge, the volunteers set off. It was difficult to make their way out of the valley. In some places, they had to carry the sledge with the wounded in their arms. At last, they made it to the lowlands and quickly set off along the Dnipro, which though not visible, made its presence known by the rippling of the waves and the rushing wind."
                                                                                    },
                                                                                    {
                                                                                        "text": "Ivan led the horse and the others walked beside him. They all had sabers and bows while the wounded in the sledge had a loaded rifle lying next to them. From time to time, Dmytro gave the wounded some water to drink. The group tried to move without as quickly as possible without taking breaks. The sun was already setting over the Dnipro when the Cossacks reached the steep path leading into a valley. The lowland, however, was quite far away, covered in an ancient oak forest. The tops of the trees weren’t even visible from the level steppe. All around, fairly large boulders protruded from the ground. When the travelers entered the forest, the boulders increased in size, laying among the trees in a blanket of bright green moss. Moving around, surprisingly, wasn’t difficult since there was almost no shrubbery in the forest. The even ground was covered with a deep layer of leaves and there was a good distance between the trees and boulders. However, with time, the valley started to narrow and become steeper when, finally, the travelers found the themselves at the bottom of a deep ravine covered in dense thickets. At their feet warbled a small stream."
                                                                                    },
                                                                                    {
                                                                                        "text": "Ustym made a sign that they should stop. The group listened to the rustling leaves and the howling wind in the ravine. “Stay near the sledge, boys,” Ustym told Ivan and Dmytro, “We will see what’s out there.” Ohrim took the rifle and they both disappeared in the thickets."
                                                                                    },
                                                                                    {
                                                                                        "text": "Dmytro, Ivan and the two wounded warriors waited an hour for the Cossacks to return. When Ustym and Ohrim finally returned they were in a very good mood and seemed to be in no hurry. “Will we spend the night here?” Dmytro asked. “No, we are almost there,” replied Ustym, “Only the horse won’t go any further.” Indeed, as they moved forward, the shrubbery became so thick and tangled that it was hard for even one person to make it through. They stopped at a clearing surrounded by thickets on all sides. A semicircle of trees grew in the clearing, covering the passageway. Beneath the trees was a fire pit from rough stones and the remnants of some makeshift shelter. Ivan tethered the horse to a tree and the men carefully transported the wounded unto the grass. Using some pieces from the sledge, they quickly put together two litters for the wounded and continued their journey to the mysterious refuge on foot."
                                                                                    },
                                                                                    {
                                                                                        "text": "They scraped their way through the thickets, climbing between boulders that were almost close enough to crush the Cossacks with their weight. The tiny stream had long become their only source of direction. Finally, the passage widened a little but and the travelers entered a clearing that was a little bigger than the previous one, also surrounded by a wall of thickets. The stream ran adjacent to the clearing and seemed to come from a small cliff that hung over the ravine."
                                                                                    },
                                                                                    {
                                                                                        "text": "“We’ve arrived,” Ustym said at last. The men stopped and put the litters containing the wounded on the ground."
                                                                                    },
                                                                                    {
                                                                                        "text": "The leader of the group came into the center of the clearing and made a sign with his hand, facing some blackthorn bushes. Having seen the sign, a tall elderly man emerged from the thickets. He had a beard and was dressed in shabby clothes. He had a large wooden cross on his neck. He looked like a hermit, but his garments were those of a Cossack and he had a pipe in his mouth. The bearded man had a bear spear in his hand that he leaned on as he would on a bishop’s staff. He walked past Ustym and, without saying a word, approached the wounded and bent over their litters. One of the men was conscious. “I see your death,” the old man muttered to him. “Your death is at your feet. It means you still have work to do in this world.” He stood up straight and went back into the shrubbery. The Cossacks picked up the litters and followed him."
                                                                                    },
                                                                                    {
                                                                                        "text": "A small hillock hid among the thickets. It turned out to be the entrance to an earthen cabin whose door was set deep in the earth, facing the cliff where the stream bubbled from. The bearded man opened the door and disappeared in the darkness. He came back with a burning candle in his hand and beckoned the Cossacks to carefully carry the wounded inside. The Cossacks carefully carried the litters down the narrow steps."
                                                                                    },
                                                                                    {
                                                                                        "text": "There was a whole cabin inside, containing several rooms and a clay stove, with tiny windows that were hardly noticeable from the outside. “Our men will come back soon. For now, fill up the barrel with water. It’s near the entrance along with a couple of pitchers,” the old man said."
                                                                                    },
                                                                                    {
                                                                                        "text": "While the Cossacks carried water, the bearded man tended to the wounded in a separate room. In a while, he went out and called the group to gather near the table. The travelers brought with them some goods from the camp. They gave them to the hermit."
                                                                                    },
                                                                                    {
                                                                                        "text": "After a quick meal, the old man asked: “Will you spend the night in my home? It is already dark outside.” “We kindly thank you, but we left our horse in the clearing. We will spend the night there,” one of the Cossacks replied. The hermit nodded his head in understanding."
                                                                                    },
                                                                                    {
                                                                                        "text": "The Cossacks approached the clearing at midnight, prepared makeshift beddings and gathered near a bonfire. “Who was that man?” Asked Dmytro, curious about the hermit. “Blackthorn…” Replied Ohrim, lost in thought. “Which blackthorn?” Asked Dmytro, not understanding. “The old man’s name is Blackthorn,” explained Ustym and added, “He’s one our best healers and soothsayers, though an old one now.”"
                                                                                    },
                                                                                    {
                                                                                        "text": "The men woke before dawn to get back to their camp as quickly as possible. Without their wounded comrades, they moved much quicker and were back at the clearing as the sun was rising. They quickly found the boat and provisions hidden in the reeds. From another hiding spot, Ivan brought out his saddle and harness. “The four of us and our provisions won’t fit in the boat. I will take the horse and ride to the crossing further up the stream. I will join you at the camp on the other shore,” he explained to them energetically. It was obvious that this plan had not been discussed before, but they also didn’t want to leave behind the horse and some provisions. Ustym somewhat reluctantly agreed."
                                                                                    },
                                                                                    {
                                                                                        "text": "They set off at noon, keeping close to the shore and paddling against the current towards the labyrinth of small islands, hidden among the reeds."
                                                                                    },
                                                                                    {
                                                                                        "text": "Ustym steered the boat along the narrow straits. For a while, Dmytro thought that they were lost, but finally the boat landed on one of the islands. Ustym told them to wait in the boat while he went on the island, carefully parting the reeds to pass through. He returned fairly quickly with a small chest in his hands, which was added to the other cargo in the boat. Without wasting time, they continued to move on. It seemed that the labyrinth of reeds was endless, but Ustym confidently steered the boat and, finally, close to dusk, their boat slid through the open water and in a couple of hours landed at the opposite shore. Here, among cliffs and thickets, was a comfortable passage to the shore. There was a deafening silence in the air and the shore seemed completely uninhabited, but as soon as the travelers stepped on land, they were surrounded by their fellow Cossacks."
                                                                                    },
                                                                                    {
                                                                                        "text": "In three days, the group reached the bleak cliffs that rose high above the Dnipro River, so steep that they seemed like great walls reaching towards the sky. The boat that was in front approached these stone giants and suddenly disappeared from sight. And after this boat, the next one vanished as well, and the one after that. When Dmytro’s boat reached the same cliff, he realized that it wasn’t solid. A massive boulder jutted out into the main body of the river, creating a narrow passage, behind which a peaceful stretch of land was safely hidden. In a while, the whole group had disembarked on the mysterious shore."
                                                                                    },
                                                                                    {
                                                                                        "text": "Higher up on the shore was a forest full of ravines and gullies, behind which a small river ran its course into the majestic currents of the Dnipro."
                                                                                    },
                                                                                    {
                                                                                        "text": "When the greater part of the Cossacks had gathered near the edge of the forest, surveying the surroundings, the leader of the group confidently proclaimed: “We will spend winter here!” "
                                                                                    },
                                                                                    {
                                                                                        "text": "Happily greeting their comrade, the Cossacks started to unpack the boats."
                                                                                    }
                                                                                ],
                                                                                "next": []
                                                                            }
                                                                        },
                                                                        {
                                                                            "text": "Ask to let leave",
                                                                            "nextPage": {
                                                                                "endType": "alive",
                                                                                "nodes": [],
                                                                                "next": []
                                                                            }
                                                                        }
                                                                    ]
                                                                }
                                                            }
                                                        ]
                                                    }
                                                },
                                                {
                                                    "text": "Turn back to steppe",
                                                    "nextPage": {
                                                        "nodes": [
                                                            {
                                                                "text": "Dmytro hesitated a bit, but eventually turned back and walked away from the uncertain valley."
                                                            },
                                                            {
                                                                "text": "He had not gone very far when he came across a dried-up shallow riverbed, bordered by rocks. His horse jumped over it without stopping, yet after a while Dmytro noticed that he was limping on his right leg. Dmytro stopped and examined his horse. At first glance, everything seemed to be alright, but the horse needed to get some rest. He sat on a rock, letting the horse graze nearby, and looked around."
                                                            }
                                                        ],
                                                        "next": [
                                                            {
                                                                "text": "Return to the camp",
                                                                "nextPage": {
                                                                    "endType": "alive",
                                                                    "nodes": [
                                                                        {
                                                                            "text": "Dmytro turned back. Soon he had to hurry and lead the horse by his side."
                                                                        },
                                                                        {
                                                                            "text": "The sun had already started to set when Dmytro spotted a cloud of dust in the distance. Then the cloud was divided into several clouds, which, slowly floating, separated in different directions. One of the clouds was moving forwards, but after a while it changed direction. Dmytro managed to make out a horse without a rider, galloping at full speed through the evening steppe and soon disappearing over the hills."
                                                                        },
                                                                        {
                                                                            "text": "The familiar coastal cliffs appeared on the horizon once again. Hardly visible puffs of gray smoke rose from the valley where the river ran. Dmytro left the injured animal in the valley and  carefully set for the coast, holding his bow at the ready. Having reached the valley, he turned to the right and climbed the hill that rose on the opposite side of the stream. Dropping to the ground, the Cossack peered over the edge of the hill."
                                                                        },
                                                                        {
                                                                            "imageType": "camp",
                                                                            "text": "Near the coast there was a great pile of smoldering black ash. The only remains of what appeared to be a shack. The smoke from it covered the valley like morning fog. A part of the reeds growing in the river was also burned. The clearing was littered with a motley of castoff objects and everything was densely covered with arrows: the ground, trees and smoldering logs. In the middle of this chaos, here and there, lay the bloodied mangled of Tartars. Dmytro counted six bodies. No one showed any signs of life. The valley was completely silent with the only sound the crackling of coal in the burnt shack."
                                                                        }
                                                                    ],
                                                                    "next": []
                                                                }
                                                            },
                                                            {
                                                                "text": "Move along",
                                                                "nextPage": {
                                                                    "nodes": [
                                                                        {
                                                                            "text": "To be continued"
                                                                        }
                                                                    ],
                                                                    "next": []
                                                                }
                                                            }
                                                        ]
                                                    }
                                                }
                                            ]
                                        }
                                    },
                                    {
                                        "text": "Stay quiet",
                                        "nextPage": {
                                            "nodes": [
                                                {
                                                    "text": "The runaway fell to the ground, trying to hide from view, but also trying to see what was happening up ahead. The Tartar continued to survey the tracks, but he didn’t risk going into the forest by himself. He ran from the burnt forest to a hill where a horse was neighing. Then the Tartar rode off into the distance. Dmytro understood that the pursuer could return with others at any moment, so he immediately set off westward towards the horizon. He walked towards a distant hill where a lone tree grew, stretching its branches towards the sky."
                                                },
                                                {
                                                    "text": "Despite it being the beginning of autumn, the sun was still scorching, but Dmytro moved quickly. A wide lowland stretched beneath the slope. On the opposite side there was a valley overgrown with reeds, which twisted like a snake in the direction of the Dnipro. The lowland itself was leveled and flat like a plate, but in the middle, there was gray boulder with sharp edges. Between the hill and the valley, a cluster of trees and bushes grew in the form of a dark green stain. Another dark and almost circular stain was visible near the foot of the boulder. From his vantage point, Dmytro could make out several dark points on the ground. From one of them, a hardly visible gray thread rose into the air, swaying ever so slightly although there was no wind."
                                                },
                                                {
                                                    "text": "Dmytro had come here on instinct and was forced to catch his breath from surprise. The feeling of surprise quickly passed as he scrutinized the terrain below. The lowland was empty."
                                                },
                                                {
                                                    "imageType": "river",
                                                    "text": "He slowly descended from the hill, keeping the view below in sight. Soon he was standing near the recently extinguished fire, studying the tracks of the camp that had stood here yesterday. There were a few people, maybe around ten. They had come on foot from the north and, having spent the night here, set off for the valley."
                                                },
                                                {
                                                    "text": "There was a narrow path winding along the slope of the valley and disappearing in the reeds. There was a stream at the bottom. The path came up from the valley from time to time and Dmytro glimpsed the endless terrains of the Wild Fields. Evening was setting in."
                                                },
                                                {
                                                    "text": "Dmytro emerged from the valley and soon found himself near the Dnipro."
                                                },
                                                {
                                                    "text": "He approached one of the cliffs. The river stretched out below, wide and calm, decked with reeds, boulders, islands and shrouded in fog. In the middle there was a large island, completely flat and covered with willows and shrubs. The dark silhouette of a small boat moved briskly against the current from the northern end of the island, gradually disappearing in the coastal thickets."
                                                }
                                            ],
                                            "next": [
                                                {
                                                    "text": "Take a look at the clearing",
                                                    "nextPage": {
                                                        "nodes": [
                                                            {
                                                                "text": "Dmytro released his horse and set off into the thickets, keeping a vigilant eye on the surroundings. He had walked only a couple of paces when he heard the click of a gun being cocked behind his back. The runaway froze."
                                                            },
                                                            {
                                                                "text": "What faith are you?” Said the voice behind him."
                                                            },
                                                            {
                                                                "imageType": "cossacks",
                                                                "text": "The faith of the Rus,” Dmytro confidently replied and slowly turned around. Behind him stood two men, which had appeared from nowhere. Without the gun and sabers, and spear, he would have taken them for fishermen."
                                                            },
                                                            {
                                                                "text": "Cross yourself if you are a good man,” said another man. The runaway crossed himself three times."
                                                            },
                                                            {
                                                                "text": "Let’s go,” said the one with the gun. He didn’t lower the weapon but inclined his head towards the willows. All three walked down the hill to the trees. The man with the spear threw a small bag onto Dmytro’s head that reeked of fish and pushed him in the back."
                                                            },
                                                            {
                                                                "text": "Go on, go on,” someone grabbed the runaway by the arm and led the way. They walked only a short while before Dmytro had to bend over and walk down some stairs. A door creaked. Someone pulled the bag off his head. They were in a long, shadowy cabin with an earthen floor covered by reeds. On the benches at a table of rough logs sat a large group of armed men. The light barely passed through the bottles inserted close to the ceiling of the earthen walls of the cabin. Dust and smoke circulated in the rays of light coming through the bottles. An icon of the Holy Virgin hung in the corner illuminated by a candle."
                                                            },
                                                            {
                                                                "text": "Dmytro was questioned about his origins and whereabouts. He told them how he was captured along with other Cossacks by the Tartars at Cecora, how he was taken to Crimea, and about his escape at the crossing during the confusion that ensued when someone suddenly attacked the Tartars."
                                                            },
                                                            {
                                                                "text": "All the men listened attentively. Then Dmytro was taken outside the cabin with the same precautions as when he had been taken in. He sat below a willow while the man with the gun guarded him. The runaway asked for some water. The guard carefully gave him a clay flask and allowed him to take a few sips. Soon about a dozen men emerged from behind the trees. Some of them Dmytro recognized from the earth cabin. A stocky man holding a long stick with a noose at one end stepped to the front of the crowd. “You are no captive Cossack, but a spy!”- He loudly proclaimed. The crowd shouted approvingly. The noose was thrown around Dmytro’s neck and he was pulled to the Dnipro. It was futile to resist and he almost had no strength left in him."
                                                            },
                                                            {
                                                                "text": "When he was near the water, someone offered him to pray for the last time. The runaway started to say something when a strange noise came from the clearing. A man ran along the path, waving his saber and shouting something. Suddenly, he swayed, made a few hesitant steps and collapsed. A crimson stain was quickly spreading on the back of his shirt. Someone ran up to him from the crowd that had gathered near the shore. Several arrows whistled by and a gun had been fired somewhere close. The air was filled with smoke. People grabbed their weapons and ran down the path to the clearing. Dmytro was pushed out of the water and left lying on the shore."
                                                            }
                                                        ],
                                                        "next": [
                                                            {
                                                                "text": "Hide in the reeds",
                                                                "nextPage": {
                                                                    "endType": "alive",
                                                                    "nodes": [
                                                                        {
                                                                            "imageType": "boat",
                                                                            "text": "Dmytro focused all his energy on paddling until the last rays of the sun glimmered on the glassy surface of the river. At that time, the stern of the boat had landed on the nameless patch of earth in the middle of the mighty river."
                                                                        },
                                                                        {
                                                                            "text": "The island was heavily overgrown with shrubs. It took some elbow grease for Dmytro to pull the boat ashore. On the other hand, the thicket hid everything that was on the island from any onlooker on shore or in the water."
                                                                        },
                                                                        {
                                                                            "text": "The fugitive surveyed the goods. Among the things, he found everything needed for life: food, cooking utensils, a wide knife, a firesteel, and even a pipe and a pouch tobacco."
                                                                        },
                                                                        {
                                                                            "text": "To get to the middle of the island, which could have been about a hundred steps, he had to bend over and crawl through the thickets. In the middle of the island grew three ancient trees, so burly and thick that no bushes could grow in their vicinity. The ground was heavily covered with twigs and yellowed leaves."
                                                                        },
                                                                        {
                                                                            "text": "Dmytro dragged his boat supplies and quickly made a reed shack. Then he cooked some grain in a copper jug over a small fire."
                                                                        },
                                                                        {
                                                                            "text": "By then, it was completely dark. The night turned out to be clear, warm and starry. Dmytro left his camp and went to the edge of the island opposite to the one where he had landed. Cutting the reeds, he found that passage to the shore was quite clear here. The thickets weren’t so thick and near the shore there were a couple of stone blocks that created a small shelter. Dmytro left his clothing on the rocks and carefully entered the cold water of the Dnipro. Having entered the river up to his waist, he stopped, admiring the reflection of the stars in the water. Suddenly, he seemed to catch a glimpse of that young lady underwater again. Dmytro shook his head – it was most likely his weariness getting the better of him. Despite the cold, the bath brought a sense of relief and washed away the dust of his recent adventures. Returning to the shack, Dmytro barely waited for the fire to die down and fell soundly asleep."
                                                                        },
                                                                        {
                                                                            "imageType": "bulrush",
                                                                            "text": "In the morning, he quickly gathered, ate a little, and with the first light of dawn was already on the water. Up the current there was a network of straits and tributaries filled with countless small islands, and Dmytro hoped to continue his journey by hiding in the depths of this labyrinth. Currently, his goal was to cross the open space as quickly as possible before the sun had fully risen. Entering one of the straits, the runaway stopped paddling. The boat slid across the water without a sound. The current was much weaker here, so while the boat had stopped and started going backwards, Dmytro turned slightly and listened attentively. Then he made a couple of more strokes with the paddle, leveling the dugout canoe and guiding it forward. Repeating this movements many times, the Cossack slowly made his way through the thickets, trying not to lose his sense of direction. Even the current was no longer helping. In some areas it was hardly noticeable and in other areas the water seemed to move in a circle, pulling the boat into the center of the gyration. Suddenly, larger islands started to appear with patches of hard dry earth and even a couple of bushes. Dmytro went around these islands to the left, then to the right, until he approached a fairly large piece of land with several willows. The island was curved like a crescent moon, and Dmytro was approaching one of its tips while the other tip was visible from a distance. He led the boat to a small bay between the tips of the island. Dmytro surveyed the semicircle of the island’s sandy shore. At first, he didn’t see anything special, but a moment before he turned away something white flashed through the thickets. He vigorously paddled to turn back and surveyed the shallows once again. It seemed that in the depths of the island there was something white that resembled a piece of cloth tied to a tree or pole."
                                                                        },
                                                                        {
                                                                            "text": "He wasn’t even surprised that he recognized some of them. Fate had once again led him to the Cossack fishermen. After battle, they had left their camp on the Tartar coast and retreated to this island. Their boats were hidden along the perimeter of the island. It appeared that the whole unit had settled on this island."
                                                                        },
                                                                        {
                                                                            "text": "The runaway was again brought before the leader of the group. Dmytro had a feeling that he wouldn’t be able to escape the second time but help arrived from an unexpected place. A large boat approached the island. The Cossacks in this boat looked refreshed and full of energy. They also had better weapons. They embarked ashore, carrying a large oaken chest among them. Dmytro was escorted away from this new group, but, suddenly, one of the newcomers stopped. “Dmytro?” He asked, surprised, “Dmytro from Bila Tserkva? I though you had died at Yasy! What a meeting!” Dmytro cast a glance at his guards. “How do you do? I also remember you, Stepan! As you see, I ran away from the Tartars, but my Christian brothers almost drowned me.” He clearly remembered this young man who had once persuaded him to leave behind the registered Cossacks and set off for the Wild Fields. They were from the same region, from the Bila Tserkva subdivision. They had met during service and had good relations, but Stepan quickly disappeared after taking something from the treasury. “Good God!” Proclaimed Stepan and went to the center of the island with the others without saying anything more. Dmytro, however, wasn’t led any further but left to sit on the ground under the watchful eye of one of the Cossacks. Soon, Stepan returned and, smiling, said: “I put in a word for you. No one will try to drown you anymore – you can be sure. But come with us to the winter camp. There will be a big war with the Turks. We need manpower."
                                                                        },
                                                                        {
                                                                            "text": "In three days, the group reached the bleak cliffs that rose high above the Dnipro River, so steep that they seemed like great walls reaching towards the sky. The boat that was in front approached these stone giants and suddenly disappeared from sight. And after this boat, the next one vanished as well, and the one after that. When Dmytro’s boat reached the same cliff, he realized that it wasn’t solid. A massive boulder jutted out into the main body of the river, creating a narrow passage, behind which a peaceful stretch of land was safely hidden. In a while, the whole group had disembarked on the mysterious shore."
                                                                        },
                                                                        {
                                                                            "text": "Higher up on the shore was a forest full of ravines and gullies, behind which a small river ran its course into the majestic currents of the Dnipro."
                                                                        },
                                                                        {
                                                                            "text": "When the greater part of the Cossacks had gathered near the edge of the forest, surveying the surroundings, the leader of the group confidently proclaimed: “We will spend winter here!”"
                                                                        },
                                                                        {
                                                                            "text": "men started to unpack the boats."
                                                                        },
                                                                        {
                                                                            "text": "The End of Chapter One"
                                                                        }
                                                                    ],
                                                                    "next": [
                                                                        {
                                                                            "text": "Land on the island",
                                                                            "nextPage": {
                                                                                "endType": "alive",
                                                                                "nodes": [
                                                                                    {
                                                                                        "imageType": "river",
                                                                                        "text": "Dmytro reached the shore, jumped out of the boat into the shallow water and pulled the boat ashore, trying to hide it as well as possible. Having finished this, he went towards the trees where the he had glimpsed something light-colored. He quickly found someone’s makeshift bedding under some willows. It seemed that the place had been left in haste a long time ago. The abandoned tent had been displaced by the wind and there were no ashes in the firepit. However, he couldn’t find any belongings, only a decaying sack and a wooden shovel that had fallen apart due to the moisture. Dmytro walked around a little more, taking a good look at the area. He was ready to return to the boat when he heard a noise from the other side of the island. He listened carefully. It seemed somebody had landed on the other side of the island. He heard low voices but couldn’t decipher what they were saying. The runaway hardly had the time to hide in the nearest thickets when several Cossacks emerged from the opposite side, their bows at the ready. They quickly made their way to the remnants of the abandoned tent. Two others followed right after them. To Dmytro’s surprise, he recognized one of the Cossacks. The young man had once persuaded him to run off to the Wild Fields before disappearing himself."
                                                                                    },
                                                                                    {
                                                                                        "text": "The newcomers carefully surveyed the island. One of the Cossacks moved towards the shore where Dmytro had left his boat. Soon, they had gathered near the tent once again, looking around. Then one of them called out: “Come out in the clearing or we will find you!” Dmytro hesitated a bit, but then he replied, still hidden in the thickets: “Stepan! Stepan from Bila Tserkva? Ask the men not to shoot and I will come out.” The Cossacks started to talk quietly among themselves, somewhat surprised. Then the one whom Dmytro had recognized, proclaimed: “Come out, show yourself.” Dmytro slowly got up and came out of the thickets. Stepan also recognized him and couldn’t hide his surprise: “Which wind brought you here? What a meeting! So you also decided to join the Zaporozhians?”"
                                                                                    },
                                                                                    {
                                                                                        "imageType": "river",
                                                                                        "text": "It turned out that Stepan belonged to the very same group of Cossacks that had captured Dmytro previously, but he was away when this happened. “Listen, we can’t let you go, but I will do the best I can,” Stepan promised and smiled, adding, “We won’t try to drown you anymore.”"
                                                                                    },
                                                                                    {
                                                                                        "text": "Stepan stayed with the rest of the Cossacks and they sent Dmytro in the company of two Cossacks to their camp on another island. Soon they joined him and Dmytro again was sent to the otaman."
                                                                                    },
                                                                                    {
                                                                                        "text": "He was brought into a small tent under some willows in the middle of the island. In the tent there was a man already familiar  sitting on a barrel. He was short and simply dressed, with a scar covering half his face. A pipe rested between his lips. There were two Cossacks sitting near the entrance on a bedding of hay, talking energetically among themselves and smoking their pipes. Aromatic smoke rose to the top of the tent, winding in fanciful loops and pouring out in swaths from the open entrance of the tent."
                                                                                    },
                                                                                    {
                                                                                        "text": "The conversation turned out to be more pleasant this time. Since Stepan had vouched for the runaway, Dmytro was permitted to stay with the Cossacks and spend the winter with them. On the other hand, he didn’t have any better options."
                                                                                    },
                                                                                    {
                                                                                        "text": "In three days, the group reached the bleak cliffs that rose high above the Dnipro River, so steep that they seemed like great walls reaching towards the sky. The boat that was in front approached these stone giants and suddenly disappeared from sight. And after this boat, the next one vanished as well, and the one after that. When Dmytro’s boat reached the same cliff, he realized that it wasn’t solid. A massive boulder jutted out into the main body of the river, creating a narrow passage, behind which a peaceful stretch of land was safely hidden. In a while, the whole group had disembarked on the mysterious shore."
                                                                                    },
                                                                                    {
                                                                                        "text": "Higher up on the shore was a forest full of ravines and gullies, behind which a small river ran its course into the majestic currents of the Dnipro."
                                                                                    },
                                                                                    {
                                                                                        "text": "When the greater part of the Cossacks had gathered near the edge of the forest, surveying the surroundings, the leader of the group confidently proclaimed: “We will spend winter here!”"
                                                                                    },
                                                                                    {
                                                                                        "imageType": "boat",
                                                                                        "text": "men started to unpack the boats."
                                                                                    },
                                                                                    {
                                                                                        "text": "The End of Chapter One"
                                                                                    }
                                                                                ],
                                                                                "next": []
                                                                            }
                                                                        },
                                                                        {
                                                                            "text": "Move along",
                                                                            "nextPage": {
                                                                                "endType": "alive",
                                                                                "nodes": [
                                                                                    {
                                                                                        "imageType": "river",
                                                                                        "text": "Mulling over for a while, Dmytro decided to not waste time on the mysterious island and continued his journey."
                                                                                    },
                                                                                    {
                                                                                        "text": "The runaway entered another tributary of the river, incredibly long, like a river or a channel. It gradually became narrower, making a sharp bend at the end, and becoming hardly big enough for the boat to move through. On the left side, there was a fairly large plot of land with a good smattering of trees and reeds. The reed thickets stretched for at least ten paces between the trees and the water. Dmytro couldn’t find a clearing by which he could approach the island. Suddenly, from behind him came a long shadow and he heard water splash. The Cossack immediately understood that another boat was approaching through the thickets behind him. Dmytro paddled with all his strength, not even looking back, but far ahead of him another boat emerged from the reeds and blocked the tributary. It was then that Dmytro noticed a clearing in the reeds that led to the island. He directed his boat that way and soon landed in the shallows. Several armed men immediately appeared on the shore. One of them told Dmytro to get out of the boat and come on land."
                                                                                    },
                                                                                    {
                                                                                        "text": "He wasn’t even surprised that he recognized some of them. Fate had once again led him to the Cossack fishermen. After battle, they had left their camp on the Tartar coast and retreated to this island. Their boats were hidden along the perimeter of the island. It appeared that the whole unit had settled on this island."
                                                                                    },
                                                                                    {
                                                                                        "text": "The runaway was again brought before the leader of the group. Dmytro had a feeling that he wouldn’t be able to escape the second time but help arrived from an unexpected place. A large boat approached the island. The Cossacks in this boat looked refreshed and full of energy. They also had better weapons. They embarked ashore, carrying a large oaken chest among them. Dmytro was escorted away from this new group, but, suddenly, one of the newcomers stopped. “Dmytro?” He asked, surprised, “Dmytro from Bila Tserkva? I though you had died at Yasy! What a meeting!” Dmytro cast a glance at his guards. “How do you do? I also remember you, Stepan! As you see, I ran away from the Tartars, but my Christian brothers almost drowned me.” He clearly remembered this young man who had once persuaded him to leave behind the registered Cossacks and set off for the Wild Fields. They were from the same region, from the Bila Tserkva subdivision. They had met during service and had good relations, but Stepan quickly disappeared after taking something from the treasury. “Good God!” Proclaimed Stepan and went to the center of the island with the others without saying anything more. Dmytro, however, wasn’t led any further but left to sit on the ground under the watchful eye of one of the Cossacks. Soon, Stepan returned and, smiling, said: “I put in a word for you. No one will try to drown you anymore – you can be sure. But come with us to the winter camp. There will be a big war with the Turks. We need manpower.”"
                                                                                    },
                                                                                    {
                                                                                        "text": "In three days, the group reached the bleak cliffs that rose high above the Dnipro River, so steep that they seemed like great walls reaching towards the sky. The boat that was in front approached these stone giants and suddenly disappeared from sight. And after this boat, the next one vanished as well, and the one after that. When Dmytro’s boat reached the same cliff, he realized that it wasn’t solid. A massive boulder jutted out into the main body of the river, creating a narrow passage, behind which a peaceful stretch of land was safely hidden. In a while, the whole group had disembarked on the mysterious shore."
                                                                                    },
                                                                                    {
                                                                                        "text": "Higher up on the shore was a forest full of ravines and gullies, behind which a small river ran its course into the majestic currents of the Dnipro."
                                                                                    },
                                                                                    {
                                                                                        "text": "When the greater part of the Cossacks had gathered near the edge of the forest, surveying the surroundings, the leader of the group confidently proclaimed: “We will spend winter here!”"
                                                                                    },
                                                                                    {
                                                                                        "imageType": "boat",
                                                                                        "text": "men started to unpack the boats."
                                                                                    },
                                                                                    {
                                                                                        "text": "The End of Chapter One"
                                                                                    }
                                                                                ],
                                                                                "next": []
                                                                            }
                                                                        }
                                                                    ]
                                                                }
                                                            },
                                                            {
                                                                "text": "Follow the others",
                                                                "nextPage": {
                                                                    "nodes": [
                                                                        {
                                                                            "text": "The noise of battle didn’t subside. On the right side of the river, the reeds caught fire."
                                                                        },
                                                                        {
                                                                            "text": "Dmytro gathered the last of his strength, got up and went in the direction of the clearing. He stopped near the dead man that was lying near the edge of the trail and picked up his saber. When he came out into the open, everything was covered in smoke, with arrows sticking out in different places. The main fight seemed to be somewhere up front. Suddenly, from behind the gray veil of smoke, two Tartars ran directly toward Dmytro. At the same time, something exploded near Dmytro’s left hand. He heard the whistle of artillery, and both of the Tartars fell down, struck by the pellets of a small canon. Dmytro ran forward and saw an opening on the side of a nearby hill from which smoke was coming from. Without stopping to look around, he entered the thick of the battle. At this very moment, the Cossacks were gaining ground on the Tartars, with the latter retreating towards the stream. A little longer and the Tartars were fleeing, sending volleys of arrows from hillsides to the valley. But soon the Cossacks overtook them, and the shooting stopped."
                                                                        },
                                                                        {
                                                                            "text": "Somewhere above, gunshots still rang out, signaling the pursuit of the fugitives, but in the valley everything was quiet. The silence was broken by the moans of the injured that lay in the russet grass in puddles of blood. Surprisingly, there were no Cossacks among them. For a while, Dmytro stood to the side of the clearing, holding his bloodied sabre, until other Cossacks started to approach him, covered in dust, sweat and blood. One of them sat on the ground, catching his breath, another stood nearby, leaning on his rifle and looking up at the sky, another kindled a fire and lit his pipe. All were silent."
                                                                        },
                                                                        {
                                                                            "text": "The Cossack that had interrogated Dmytro at the earthen cabin approached the clearing. He asked if anyone had been injured or killed. A few names were mentioned. He shook his head and ordered everyone to gather near the river. Then he turned to Dmytro: “So you didn’t run away? That’s good…We will decide what to do with you.” And he went to talk to the others. The group disbanded. The Cossacks walked along the valley, looking for their comrades, helping the wounded, and getting their things in order. Some of the dead were brought to the clearing and placed beneath the willows. They didn’t touch the dead Tartars, but only took their weapons."
                                                                        }
                                                                    ],
                                                                    "next": [
                                                                        {
                                                                            "text": "Ask to join in",
                                                                            "nextPage": {
                                                                                "endType": "alive",
                                                                                "nodes": [
                                                                                    {
                                                                                        "text": "The runaway asked to stay with the Cossacks for a while. The warriors didn’t object to this and the gathering dispersed. The camp stirred – people carried things, rolled barrels, collected weapons, pulled the boats from their hiding places on the shore. Everyone was preparing to set sail."
                                                                                    },
                                                                                    {
                                                                                        "text": "Dmytro was approached by a short broad-shouldered man. He was called Ustym and he said that he was looking for volunteers to help transport two heavily injured warriors to a safe place. He hinted that Dmytro could help since he didn’t have any matters to attend to at the camp. The runaway agreed and they walked to the edge of the clearing where the injured lay beneath the willows. Not far away, one of the dead was being buried, his tomb already covered with heavy earth and stones. Close by on the trunk of a willow somebody had carved a wide cross, which was the only sign of mourning for this Cossack’s sad fate."
                                                                                    },
                                                                                    {
                                                                                        "text": "Two more volunteers approached, Ohrim and Ivan. Ustym decided that the four of them would manage on their own. He said that the journey wasn’t a long one."
                                                                                    },
                                                                                    {
                                                                                        "text": "They found a horse to transport the wounded, but there was no cart in the camp since the warriors mainly used boats to move along the river and rarely went out into the steppe to the Tartar coast. So Ustym brought axes and the team started to build a sledge that could be pulled by a horse. One of the volunteers – Ivan, as it turned out, was once a tinsmith, and he quickly created a harness from some ropes, belts and parts of old harnesses. Dmytro had his doubts whether the horse would pull the harness, but the beast turned out to be surprisingly docile when harnessed, obediently pulling the load."
                                                                                    },
                                                                                    {
                                                                                        "imageType": "steppe",
                                                                                        "text": "The Cossacks hadn’t prepared for departure yet, but the wounded had to be taken away as quickly as possible. Sunset was quickly approaching and those who would transport the wounded couldn’t afford to set up camp on the road. The Cossacks agreed to leave a boat for the four volunteers, which the latter could use to catch up with the warriors on some shore that only Ustym knew about. Having finished their meeting and carefully placed the wounded Cossacks in the sledge, the volunteers set off. It was difficult to make their way out of the valley. In some places, they had to carry the sledge with the wounded in their arms. At last, they made it to the lowlands and quickly set off along the Dnipro, which though not visible, made its presence known by the rippling of the waves and the rushing wind."
                                                                                    },
                                                                                    {
                                                                                        "text": "Ivan led the horse and the others walked beside him. They all had sabers and bows while the wounded in the sledge had a loaded rifle lying next to them. From time to time, Dmytro gave the wounded some water to drink. The group tried to move without as quickly as possible without taking breaks. The sun was already setting over the Dnipro when the Cossacks reached the steep path leading into a valley. The lowland, however, was quite far away, covered in an ancient oak forest. The tops of the trees weren’t even visible from the level steppe. All around, fairly large boulders protruded from the ground. When the travelers entered the forest, the boulders increased in size, laying among the trees in a blanket of bright green moss. Moving around, surprisingly, wasn’t difficult since there was almost no shrubbery in the forest. The even ground was covered with a deep layer of leaves and there was a good distance between the trees and boulders. However, with time, the valley started to narrow and become steeper when, finally, the travelers found the themselves at the bottom of a deep ravine covered in dense thickets. At their feet warbled a small stream."
                                                                                    },
                                                                                    {
                                                                                        "text": "Ustym made a sign that they should stop. The group listened to the rustling leaves and the howling wind in the ravine. “Stay near the sledge, boys,” Ustym told Ivan and Dmytro, “We will see what’s out there.” Ohrim took the rifle and they both disappeared in the thickets."
                                                                                    },
                                                                                    {
                                                                                        "text": "Dmytro, Ivan and the two wounded warriors waited an hour for the Cossacks to return. When Ustym and Ohrim finally returned they were in a very good mood and seemed to be in no hurry. “Will we spend the night here?” Dmytro asked. “No, we are almost there,” replied Ustym, “Only the horse won’t go any further.” Indeed, as they moved forward, the shrubbery became so thick and tangled that it was hard for even one person to make it through. They stopped at a clearing surrounded by thickets on all sides. A semicircle of trees grew in the clearing, covering the passageway. Beneath the trees was a fire pit from rough stones and the remnants of some makeshift shelter. Ivan tethered the horse to a tree and the men carefully transported the wounded unto the grass. Using some pieces from the sledge, they quickly put together two litters for the wounded and continued their journey to the mysterious refuge on foot."
                                                                                    },
                                                                                    {
                                                                                        "imageType": "bulrush",
                                                                                        "text": "They scraped their way through the thickets, climbing between boulders that were almost close enough to crush the Cossacks with their weight. The tiny stream had long become their only source of direction. Finally, the passage widened a little but and the travelers entered a clearing that was a little bigger than the previous one, also surrounded by a wall of thickets. The stream ran adjacent to the clearing and seemed to come from a small cliff that hung over the ravine."
                                                                                    },
                                                                                    {
                                                                                        "text": "“We’ve arrived,” Ustym said at last. The men stopped and put the litters containing the wounded on the ground."
                                                                                    },
                                                                                    {
                                                                                        "text": "The leader of the group came into the center of the clearing and made a sign with his hand, facing some blackthorn bushes. Having seen the sign, a tall elderly man emerged from the thickets. He had a beard and was dressed in shabby clothes. He had a large wooden cross on his neck. He looked like a hermit, but his garments were those of a Cossack and he had a pipe in his mouth. The bearded man had a bear spear in his hand that he leaned on as he would on a bishop’s staff. He walked past Ustym and, without saying a word, approached the wounded and bent over their litters. One of the men was conscious. “I see your death,” the old man muttered to him. “Your death is at your feet. It means you still have work to do in this world.” He stood up straight and went back into the shrubbery. The Cossacks picked up the litters and followed him."
                                                                                    },
                                                                                    {
                                                                                        "text": "A small hillock hid among the thickets. It turned out to be the entrance to an earthen cabin whose door was set deep in the earth, facing the cliff where the stream bubbled from. The bearded man opened the door and disappeared in the darkness. He came back with a burning candle in his hand and beckoned the Cossacks to carefully carry the wounded inside. The Cossacks carefully carried the litters down the narrow steps."
                                                                                    },
                                                                                    {
                                                                                        "text": "There was a whole cabin inside, containing several rooms and a clay stove, with tiny windows that were hardly noticeable from the outside. “Our men will come back soon. For now, fill up the barrel with water. It’s near the entrance along with a couple of pitchers,” the old man said."
                                                                                    },
                                                                                    {
                                                                                        "imageType": "forest",
                                                                                        "text": "While the Cossacks carried water, the bearded man tended to the wounded in a separate room. In a while, he went out and called the group to gather near the table. The travelers brought with them some goods from the camp. They gave them to the hermit."
                                                                                    },
                                                                                    {
                                                                                        "text": "After a quick meal, the old man asked: “Will you spend the night in my home? It is already dark outside.” “We kindly thank you, but we left our horse in the clearing. We will spend the night there,” one of the Cossacks replied. The hermit nodded his head in understanding."
                                                                                    },
                                                                                    {
                                                                                        "text": "The Cossacks approached the clearing at midnight, prepared makeshift beddings and gathered near a bonfire. “Who was that man?” Asked Dmytro, curious about the hermit. “Blackthorn…” Replied Ohrim, lost in thought. “Which blackthorn?” Asked Dmytro, not understanding. “The old man’s name is Blackthorn,” explained Ustym and added, “He’s one our best healers and soothsayers, though an old one now.”"
                                                                                    },
                                                                                    {
                                                                                        "text": "The men woke before dawn to get back to their camp as quickly as possible. Without their wounded comrades, they moved much quicker and were back at the clearing as the sun was rising. They quickly found the boat and provisions hidden in the reeds. From another hiding spot, Ivan brought out his saddle and harness. “The four of us and our provisions won’t fit in the boat. I will take the horse and ride to the crossing further up the stream. I will join you at the camp on the other shore,” he explained to them energetically. It was obvious that this plan had not been discussed before, but they also didn’t want to leave behind the horse and some provisions. Ustym somewhat reluctantly agreed."
                                                                                    },
                                                                                    {
                                                                                        "text": "They set off at noon, keeping close to the shore and paddling against the current towards the labyrinth of small islands, hidden among the reeds."
                                                                                    },
                                                                                    {
                                                                                        "text": "Ustym steered the boat along the narrow straits. For a while, Dmytro thought that they were lost, but finally the boat landed on one of the islands. Ustym told them to wait in the boat while he went on the island, carefully parting the reeds to pass through. He returned fairly quickly with a small chest in his hands, which was added to the other cargo in the boat. Without wasting time, they continued to move on. It seemed that the labyrinth of reeds was endless, but Ustym confidently steered the boat and, finally, close to dusk, their boat slid through the open water and in a couple of hours landed at the opposite shore. Here, among cliffs and thickets, was a comfortable passage to the shore. There was a deafening silence in the air and the shore seemed completely uninhabited, but as soon as the travelers stepped on land, they were surrounded by their fellow Cossacks."
                                                                                    },
                                                                                    {
                                                                                        "text": "In three days, the group reached the bleak cliffs that rose high above the Dnipro River, so steep that they seemed like great walls reaching towards the sky. The boat that was in front approached these stone giants and suddenly disappeared from sight. And after this boat, the next one vanished as well, and the one after that. When Dmytro’s boat reached the same cliff, he realized that it wasn’t solid. A massive boulder jutted out into the main body of the river, creating a narrow passage, behind which a peaceful stretch of land was safely hidden. In a while, the whole group had disembarked on the mysterious shore."
                                                                                    },
                                                                                    {
                                                                                        "imageType": "river",
                                                                                        "text": "Higher up on the shore was a forest full of ravines and gullies, behind which a small river ran its course into the majestic currents of the Dnipro."
                                                                                    },
                                                                                    {
                                                                                        "text": "When the greater part of the Cossacks had gathered near the edge of the forest, surveying the surroundings, the leader of the group confidently proclaimed: “We will spend winter here!” "
                                                                                    },
                                                                                    {
                                                                                        "text": "Happily greeting their comrade, the Cossacks started to unpack the boats."
                                                                                    }
                                                                                ],
                                                                                "next": []
                                                                            }
                                                                        },
                                                                        {
                                                                            "text": "Ask to let leave",
                                                                            "nextPage": {
                                                                                "endType": "alive",
                                                                                "nodes": [],
                                                                                "next": []
                                                                            }
                                                                        }
                                                                    ]
                                                                }
                                                            }
                                                        ]
                                                    }
                                                },
                                                {
                                                    "text": "Turn back to steppe",
                                                    "nextPage": {
                                                        "nodes": [
                                                            {
                                                                "imageType": "steppe",
                                                                "text": "Dmytro hesitated a bit, but eventually turned back and walked away from the uncertain valley."
                                                            },
                                                            {
                                                                "text": "He had not gone very far when he came across a dried-up shallow riverbed, bordered by rocks. His horse jumped over it without stopping, yet after a while Dmytro noticed that he was limping on his right leg. Dmytro stopped and examined his horse. At first glance, everything seemed to be alright, but the horse needed to get some rest. He sat on a rock, letting the horse graze nearby, and looked around."
                                                            }
                                                        ],
                                                        "next": [
                                                            {
                                                                "text": "Return to the camp",
                                                                "nextPage": {
                                                                    "endType": "alive",
                                                                    "nodes": [
                                                                        {
                                                                            "text": "Dmytro turned back. Soon he had to hurry and lead the horse by his side."
                                                                        },
                                                                        {
                                                                            "text": "The sun had already started to set when Dmytro spotted a cloud of dust in the distance. Then the cloud was divided into several clouds, which, slowly floating, separated in different directions. One of the clouds was moving forwards, but after a while it changed direction. Dmytro managed to make out a horse without a rider, galloping at full speed through the evening steppe and soon disappearing over the hills."
                                                                        },
                                                                        {
                                                                            "imageType": "forest",
                                                                            "text": "The familiar coastal cliffs appeared on the horizon once again. Hardly visible puffs of gray smoke rose from the valley where the river ran. Dmytro left the injured animal in the valley and  carefully set for the coast, holding his bow at the ready. Having reached the valley, he turned to the right and climbed the hill that rose on the opposite side of the stream. Dropping to the ground, the Cossack peered over the edge of the hill."
                                                                        },
                                                                        {
                                                                            "text": "Near the coast there was a great pile of smoldering black ash. The only remains of what appeared to be a shack. The smoke from it covered the valley like morning fog. A part of the reeds growing in the river was also burned. The clearing was littered with a motley of castoff objects and everything was densely covered with arrows: the ground, trees and smoldering logs. In the middle of this chaos, here and there, lay the bloodied mangled of Tartars. Dmytro counted six bodies. No one showed any signs of life. The valley was completely silent with the only sound the crackling of coal in the burnt shack."
                                                                        }
                                                                    ],
                                                                    "next": []
                                                                }
                                                            },
                                                            {
                                                                "text": "Move along",
                                                                "nextPage": {
                                                                    "nodes": [
                                                                        {
                                                                            "text": "To be continued"
                                                                        }
                                                                    ],
                                                                    "next": []
                                                                }
                                                            }
                                                        ]
                                                    }
                                                }
                                            ]
                                        }
                                    }
                                ]
                            }
                        },
                        {
                            "text": "Look for other way to warm up",
                            "nextPage": {
                                "nodes": [
                                    {
                                        "imageType": "river",
                                        "text": "Dmytro left the knapsack and went to the stream, where he could see small islands of vegetation that had managed to survive the fire. In a few steps, the quiet creaking of ashes beneath his feet turned into the rustling of fallen leaves. A little further, the stream flowed around a small spot of tall semi-dry grass. The Cossack got a knife and started to quickly and meticulously cut the grass, much as a reaper would gather a harvest of grain. Soon enough, he had a considerable heap in his arms. Dmytro carried it to his hiding place by the boulder and came back. In this way he cut the grass until he had cut down the whole patch. Then he took off his shirt, tied it into a knot and began to stuff it with leaves, trying his best to find the driest. It took a long time for him to carry the leaves, but at last Dmytro was satisfied with the result. A huge grass-covered pile had formed near the boulder. He shook his shirt, put it on, and climbed into the pile. He had warmed himself by carrying out this task, and now, laying in a pile of dry grass and leaves, he felt completely at rest. He ate a few pieces of dried bread from the Tartar’s knapsack and quickly fell asleep."
                                    },
                                    {
                                        "text": "The sun was already shining through the layer of leaves. Dmytro realized that he had missed the sunrise. He carefully peered out of the makeshift bedding and looked around. There was a perceptible silence in the burnt forest, broken only by the running stream. The Cossack stretched his legs and approached the stream, scooping some cool water in his hands and washing his face. After that he took off his shirt and placed it on a nearby stone to wash the ashes and remnants of leaves from his body. After the wash in the stream, he felt his strength and appetite returning to him. He drank some spring water and ate some dried meat and bread to satiate his hunger. "
                                    },
                                    {
                                        "text": "Despite it being the beginning of autumn, the sun was still scorching, but Dmytro moved quickly. A wide lowland stretched beneath the slope. On the opposite side there was a valley overgrown with reeds, which twisted like a snake in the direction of the Dnipro. The lowland itself was leveled and flat like a plate, but in the middle, there was gray boulder with sharp edges. Between the hill and the valley, a cluster of trees and bushes grew in the form of a dark green stain. Another dark and almost circular stain was visible near the foot of the boulder. From his vantage point, Dmytro could make out several dark points on the ground. From one of them, a hardly visible gray thread rose into the air, swaying ever so slightly although there was no wind."
                                    },
                                    {
                                        "text": "Dmytro had come here on instinct and was forced to catch his breath from surprise. The feeling of surprise quickly passed as he scrutinized the terrain below. The lowland was empty."
                                    },
                                    {
                                        "text": "He slowly descended from the hill, keeping the view below in sight. Soon he was standing near the recently extinguished fire, studying the tracks of the camp that had stood here yesterday. There were a few people, maybe around ten. They had come on foot from the north and, having spent the night here, set off for the valley."
                                    },
                                    {
                                        "text": "There was a narrow path winding along the slope of the valley and disappearing in the reeds. There was a stream at the bottom. The path came up from the valley from time to time and Dmytro glimpsed the endless terrains of the Wild Fields. Evening was setting in."
                                    },
                                    {
                                        "imageType": "river",
                                        "text": "Dmytro emerged from the valley and soon found himself near the Dnipro."
                                    },
                                    {
                                        "text": "He approached one of the cliffs. The river stretched out below, wide and calm, decked with reeds, boulders, islands and shrouded in fog. In the middle there was a large island, completely flat and covered with willows and shrubs. The dark silhouette of a small boat moved briskly against the current from the northern end of the island, gradually disappearing in the coastal thickets."
                                    }
                                ],
                                "next": []
                            }
                        }
                    ]
                }
            },
            {
                "text": "Look for a Tatar saber",
                "nextPage": {
                    "nodes": [
                        {
                            "text": "Carefully placing these things to closer to him, Dmytro was on the lookout for the saber. It was nearby, taken off the hook, but the sleeper was holding it in his arms like a child his favorite toy.",
                            "imageType": "camp"
                        },
                        {
                            "text": "Yet it was quiet in the camp. The figure near the fire continued to sit in the same place. Dmytro waited a little and, at last, walked away, trying to step as quietly as possible. Soon, he was in the open steppe, walking away from the river."
                        }
                    ],
                    "next": [
                        {
                            "text": "Try to pull it out",
                            "nextPage": {
                                "nodes": [
                                    {
                                        "text": "Dmytro held his breath. With a steady hand he grasped the saber and started to pull it out from the sheath, holding the knife in his other hand. The sleeping man turned on his side and abruptly turned back and opened his eyes."
                                    },
                                    {
                                        "imageType": "camp",
                                        "text": "The Cossack hit him with all his strength. The Tartar howled, twitched, and at last became silent. With a sharp movement, Dmytro pulled the saber from the hands of the dead man, grabbed his things, and stepped back into the darkness. From the fire, it was possible to hear an undistinguishable clamor of voices. He stopped and raised his bow and arrow, aiming at the strange shapes that glimmered in the light of the dying fire."
                                    },
                                    {
                                        "text": "A figure holding a spear stood up near the fire and started approaching through the clouds of smoke. Dmytro released an arrow. In response he heard the rustling of grass and then complete silence. The Cossack carefully retreated behind the river bank and quickly distanced himself from the camp. After some time, he climbed down the river bank to hide among the reeds, listening for followers. It seemed no one was following him. He then got back up onto the plain and set off into the steppe away from the river."
                                    },
                                    {
                                        "text": "Dmytro was walking among low-lying hills when he suddenly caught the scent of something burning. On one of the hillocks, he got a good view of the surroundings. There was no fire or smoke anywhere. However, in the distance he caught a glimpse of a copse of trees. The runaway headed towards the woods. As he did so, the smell of smoke became stronger. Up close, the wood showed signs of a forest fire – blackened tree trunks stuck out like poles, merging together and disappearing in the darkness. Behind the trees there was a slight hollow where a small brook flowed hidden from sight by several boulders the size of a horse-cart. The ground was covered by a thick layer of cold ashes."
                                    },
                                    {
                                        "text": "The man settled near the boulder closest to the brook, holding the bow and arrow at the ready, and started to look through the Tartar’s knapsack."
                                    },
                                    {
                                        "text": "The first thing he found was a firesteel tied to a gray bag that contained pieces of flint and tinder from burnt rags. There was also some dried bread, several pieces of dried horse meat wrapped in sackcloth, a copper jug, and a scabbard for a knife or a dagger. The scabbard, made from rough leather, would have been a simple one if not for the moldings on it and the semiprecious stone at its center. There was no dagger in the knapsack. Since the knife that Dmytro had was too small for the scabbard, he put it back in the knapsack."
                                    }
                                ],
                                "next": [
                                    {
                                        "text": "Take a look at the clearing",
                                        "nextPage": {
                                            "nodes": [
                                                {
                                                    "imageType": "forest",
                                                    "text": "Dmytro released his horse and set off into the thickets, keeping a vigilant eye on the surroundings. He had walked only a couple of paces when he heard the click of a gun being cocked behind his back. The runaway froze."
                                                },
                                                {
                                                    "text": "What faith are you?” Said the voice behind him."
                                                },
                                                {
                                                    "text": "The faith of the Rus,” Dmytro confidently replied and slowly turned around. Behind him stood two men, which had appeared from nowhere. Without the gun and sabers, and spear, he would have taken them for fishermen."
                                                },
                                                {
                                                    "text": "Cross yourself if you are a good man,” said another man. The runaway crossed himself three times."
                                                },
                                                {
                                                    "text": "Let’s go,” said the one with the gun. He didn’t lower the weapon but inclined his head towards the willows. All three walked down the hill to the trees. The man with the spear threw a small bag onto Dmytro’s head that reeked of fish and pushed him in the back."
                                                },
                                                {
                                                    "text": "Go on, go on,” someone grabbed the runaway by the arm and led the way. They walked only a short while before Dmytro had to bend over and walk down some stairs. A door creaked. Someone pulled the bag off his head. They were in a long, shadowy cabin with an earthen floor covered by reeds. On the benches at a table of rough logs sat a large group of armed men. The light barely passed through the bottles inserted close to the ceiling of the earthen walls of the cabin. Dust and smoke circulated in the rays of light coming through the bottles. An icon of the Holy Virgin hung in the corner illuminated by a candle."
                                                },
                                                {
                                                    "imageType": "cossacks",
                                                    "text": "Dmytro was questioned about his origins and whereabouts. He told them how he was captured along with other Cossacks by the Tartars at Cecora, how he was taken to Crimea, and about his escape at the crossing during the confusion that ensued when someone suddenly attacked the Tartars."
                                                },
                                                {
                                                    "text": "All the men listened attentively. Then Dmytro was taken outside the cabin with the same precautions as when he had been taken in. He sat below a willow while the man with the gun guarded him. The runaway asked for some water. The guard carefully gave him a clay flask and allowed him to take a few sips. Soon about a dozen men emerged from behind the trees. Some of them Dmytro recognized from the earth cabin. A stocky man holding a long stick with a noose at one end stepped to the front of the crowd. “You are no captive Cossack, but a spy!”- He loudly proclaimed. The crowd shouted approvingly. The noose was thrown around Dmytro’s neck and he was pulled to the Dnipro. It was futile to resist and he almost had no strength left in him."
                                                },
                                                {
                                                    "text": "When he was near the water, someone offered him to pray for the last time. The runaway started to say something when a strange noise came from the clearing. A man ran along the path, waving his saber and shouting something. Suddenly, he swayed, made a few hesitant steps and collapsed. A crimson stain was quickly spreading on the back of his shirt. Someone ran up to him from the crowd that had gathered near the shore. Several arrows whistled by and a gun had been fired somewhere close. The air was filled with smoke. People grabbed their weapons and ran down the path to the clearing. Dmytro was pushed out of the water and left lying on the shore."
                                                }
                                            ],
                                            "next": [
                                                {
                                                    "text": "Hide in the reeds",
                                                    "nextPage": {
                                                        "endType": "alive",
                                                        "nodes": [
                                                            {
                                                                "imageType": "bulrush",
                                                                "text": "Dmytro focused all his energy on paddling until the last rays of the sun glimmered on the glassy surface of the river. At that time, the stern of the boat had landed on the nameless patch of earth in the middle of the mighty river."
                                                            },
                                                            {
                                                                "text": "The island was heavily overgrown with shrubs. It took some elbow grease for Dmytro to pull the boat ashore. On the other hand, the thicket hid everything that was on the island from any onlooker on shore or in the water."
                                                            },
                                                            {
                                                                "text": "The fugitive surveyed the goods. Among the things, he found everything needed for life: food, cooking utensils, a wide knife, a firesteel, and even a pipe and a pouch tobacco."
                                                            },
                                                            {
                                                                "imageType": "boat",
                                                                "text": "To get to the middle of the island, which could have been about a hundred steps, he had to bend over and crawl through the thickets. In the middle of the island grew three ancient trees, so burly and thick that no bushes could grow in their vicinity. The ground was heavily covered with twigs and yellowed leaves."
                                                            },
                                                            {
                                                                "text": "Dmytro dragged his boat supplies and quickly made a reed shack. Then he cooked some grain in a copper jug over a small fire."
                                                            },
                                                            {
                                                                "text": "By then, it was completely dark. The night turned out to be clear, warm and starry. Dmytro left his camp and went to the edge of the island opposite to the one where he had landed. Cutting the reeds, he found that passage to the shore was quite clear here. The thickets weren’t so thick and near the shore there were a couple of stone blocks that created a small shelter. Dmytro left his clothing on the rocks and carefully entered the cold water of the Dnipro. Having entered the river up to his waist, he stopped, admiring the reflection of the stars in the water. Suddenly, he seemed to catch a glimpse of that young lady underwater again. Dmytro shook his head – it was most likely his weariness getting the better of him. Despite the cold, the bath brought a sense of relief and washed away the dust of his recent adventures. Returning to the shack, Dmytro barely waited for the fire to die down and fell soundly asleep."
                                                            },
                                                            {
                                                                "text": "In the morning, he quickly gathered, ate a little, and with the first light of dawn was already on the water. Up the current there was a network of straits and tributaries filled with countless small islands, and Dmytro hoped to continue his journey by hiding in the depths of this labyrinth. Currently, his goal was to cross the open space as quickly as possible before the sun had fully risen. Entering one of the straits, the runaway stopped paddling. The boat slid across the water without a sound. The current was much weaker here, so while the boat had stopped and started going backwards, Dmytro turned slightly and listened attentively. Then he made a couple of more strokes with the paddle, leveling the dugout canoe and guiding it forward. Repeating this movements many times, the Cossack slowly made his way through the thickets, trying not to lose his sense of direction. Even the current was no longer helping. In some areas it was hardly noticeable and in other areas the water seemed to move in a circle, pulling the boat into the center of the gyration. Suddenly, larger islands started to appear with patches of hard dry earth and even a couple of bushes. Dmytro went around these islands to the left, then to the right, until he approached a fairly large piece of land with several willows. The island was curved like a crescent moon, and Dmytro was approaching one of its tips while the other tip was visible from a distance. He led the boat to a small bay between the tips of the island. Dmytro surveyed the semicircle of the island’s sandy shore. At first, he didn’t see anything special, but a moment before he turned away something white flashed through the thickets. He vigorously paddled to turn back and surveyed the shallows once again. It seemed that in the depths of the island there was something white that resembled a piece of cloth tied to a tree or pole."
                                                            },
                                                            {
                                                                "text": "He wasn’t even surprised that he recognized some of them. Fate had once again led him to the Cossack fishermen. After battle, they had left their camp on the Tartar coast and retreated to this island. Their boats were hidden along the perimeter of the island. It appeared that the whole unit had settled on this island."
                                                            },
                                                            {
                                                                "text": "The runaway was again brought before the leader of the group. Dmytro had a feeling that he wouldn’t be able to escape the second time but help arrived from an unexpected place. A large boat approached the island. The Cossacks in this boat looked refreshed and full of energy. They also had better weapons. They embarked ashore, carrying a large oaken chest among them. Dmytro was escorted away from this new group, but, suddenly, one of the newcomers stopped. “Dmytro?” He asked, surprised, “Dmytro from Bila Tserkva? I though you had died at Yasy! What a meeting!” Dmytro cast a glance at his guards. “How do you do? I also remember you, Stepan! As you see, I ran away from the Tartars, but my Christian brothers almost drowned me.” He clearly remembered this young man who had once persuaded him to leave behind the registered Cossacks and set off for the Wild Fields. They were from the same region, from the Bila Tserkva subdivision. They had met during service and had good relations, but Stepan quickly disappeared after taking something from the treasury. “Good God!” Proclaimed Stepan and went to the center of the island with the others without saying anything more. Dmytro, however, wasn’t led any further but left to sit on the ground under the watchful eye of one of the Cossacks. Soon, Stepan returned and, smiling, said: “I put in a word for you. No one will try to drown you anymore – you can be sure. But come with us to the winter camp. There will be a big war with the Turks. We need manpower."
                                                            },
                                                            {
                                                                "imageType": "forest",
                                                                "text": "In three days, the group reached the bleak cliffs that rose high above the Dnipro River, so steep that they seemed like great walls reaching towards the sky. The boat that was in front approached these stone giants and suddenly disappeared from sight. And after this boat, the next one vanished as well, and the one after that. When Dmytro’s boat reached the same cliff, he realized that it wasn’t solid. A massive boulder jutted out into the main body of the river, creating a narrow passage, behind which a peaceful stretch of land was safely hidden. In a while, the whole group had disembarked on the mysterious shore."
                                                            },
                                                            {
                                                                "text": "Higher up on the shore was a forest full of ravines and gullies, behind which a small river ran its course into the majestic currents of the Dnipro."
                                                            },
                                                            {
                                                                "text": "When the greater part of the Cossacks had gathered near the edge of the forest, surveying the surroundings, the leader of the group confidently proclaimed: “We will spend winter here!”"
                                                            },
                                                            {
                                                                "imageType": "boat",
                                                                "text": "men started to unpack the boats."
                                                            },
                                                            {
                                                                "text": "The End of Chapter One"
                                                            }
                                                        ],
                                                        "next": [
                                                            {
                                                                "text": "Land on the island",
                                                                "nextPage": {
                                                                    "endType": "alive",
                                                                    "nodes": [
                                                                        {
                                                                            "imageType": "river",
                                                                            "text": "Dmytro reached the shore, jumped out of the boat into the shallow water and pulled the boat ashore, trying to hide it as well as possible. Having finished this, he went towards the trees where the he had glimpsed something light-colored. He quickly found someone’s makeshift bedding under some willows. It seemed that the place had been left in haste a long time ago. The abandoned tent had been displaced by the wind and there were no ashes in the firepit. However, he couldn’t find any belongings, only a decaying sack and a wooden shovel that had fallen apart due to the moisture. Dmytro walked around a little more, taking a good look at the area. He was ready to return to the boat when he heard a noise from the other side of the island. He listened carefully. It seemed somebody had landed on the other side of the island. He heard low voices but couldn’t decipher what they were saying. The runaway hardly had the time to hide in the nearest thickets when several Cossacks emerged from the opposite side, their bows at the ready. They quickly made their way to the remnants of the abandoned tent. Two others followed right after them. To Dmytro’s surprise, he recognized one of the Cossacks. The young man had once persuaded him to run off to the Wild Fields before disappearing himself."
                                                                        },
                                                                        {
                                                                            "text": "The newcomers carefully surveyed the island. One of the Cossacks moved towards the shore where Dmytro had left his boat. Soon, they had gathered near the tent once again, looking around. Then one of them called out: “Come out in the clearing or we will find you!” Dmytro hesitated a bit, but then he replied, still hidden in the thickets: “Stepan! Stepan from Bila Tserkva? Ask the men not to shoot and I will come out.” The Cossacks started to talk quietly among themselves, somewhat surprised. Then the one whom Dmytro had recognized, proclaimed: “Come out, show yourself.” Dmytro slowly got up and came out of the thickets. Stepan also recognized him and couldn’t hide his surprise: “Which wind brought you here? What a meeting! So you also decided to join the Zaporozhians?”"
                                                                        },
                                                                        {
                                                                            "text": "It turned out that Stepan belonged to the very same group of Cossacks that had captured Dmytro previously, but he was away when this happened. “Listen, we can’t let you go, but I will do the best I can,” Stepan promised and smiled, adding, “We won’t try to drown you anymore.”"
                                                                        },
                                                                        {
                                                                            "text": "Stepan stayed with the rest of the Cossacks and they sent Dmytro in the company of two Cossacks to their camp on another island. Soon they joined him and Dmytro again was sent to the otaman."
                                                                        },
                                                                        {
                                                                            "text": "He was brought into a small tent under some willows in the middle of the island. In the tent there was a man already familiar  sitting on a barrel. He was short and simply dressed, with a scar covering half his face. A pipe rested between his lips. There were two Cossacks sitting near the entrance on a bedding of hay, talking energetically among themselves and smoking their pipes. Aromatic smoke rose to the top of the tent, winding in fanciful loops and pouring out in swaths from the open entrance of the tent."
                                                                        },
                                                                        {
                                                                            "text": "The conversation turned out to be more pleasant this time. Since Stepan had vouched for the runaway, Dmytro was permitted to stay with the Cossacks and spend the winter with them. On the other hand, he didn’t have any better options."
                                                                        },
                                                                        {
                                                                            "imageType": "forest",
                                                                            "text": "In three days, the group reached the bleak cliffs that rose high above the Dnipro River, so steep that they seemed like great walls reaching towards the sky. The boat that was in front approached these stone giants and suddenly disappeared from sight. And after this boat, the next one vanished as well, and the one after that. When Dmytro’s boat reached the same cliff, he realized that it wasn’t solid. A massive boulder jutted out into the main body of the river, creating a narrow passage, behind which a peaceful stretch of land was safely hidden. In a while, the whole group had disembarked on the mysterious shore."
                                                                        },
                                                                        {
                                                                            "text": "Higher up on the shore was a forest full of ravines and gullies, behind which a small river ran its course into the majestic currents of the Dnipro."
                                                                        },
                                                                        {
                                                                            "text": "When the greater part of the Cossacks had gathered near the edge of the forest, surveying the surroundings, the leader of the group confidently proclaimed: “We will spend winter here!”"
                                                                        },
                                                                        {
                                                                            "imageType": "boat",
                                                                            "text": "men started to unpack the boats."
                                                                        },
                                                                        {
                                                                            "text": "The End of Chapter One"
                                                                        }
                                                                    ],
                                                                    "next": []
                                                                }
                                                            },
                                                            {
                                                                "text": "Move along",
                                                                "nextPage": {
                                                                    "endType": "alive",
                                                                    "nodes": [
                                                                        {
                                                                            "text": "Mulling over for a while, Dmytro decided to not waste time on the mysterious island and continued his journey."
                                                                        },
                                                                        {
                                                                            "text": "The runaway entered another tributary of the river, incredibly long, like a river or a channel. It gradually became narrower, making a sharp bend at the end, and becoming hardly big enough for the boat to move through. On the left side, there was a fairly large plot of land with a good smattering of trees and reeds. The reed thickets stretched for at least ten paces between the trees and the water. Dmytro couldn’t find a clearing by which he could approach the island. Suddenly, from behind him came a long shadow and he heard water splash. The Cossack immediately understood that another boat was approaching through the thickets behind him. Dmytro paddled with all his strength, not even looking back, but far ahead of him another boat emerged from the reeds and blocked the tributary. It was then that Dmytro noticed a clearing in the reeds that led to the island. He directed his boat that way and soon landed in the shallows. Several armed men immediately appeared on the shore. One of them told Dmytro to get out of the boat and come on land."
                                                                        },
                                                                        {
                                                                            "text": "He wasn’t even surprised that he recognized some of them. Fate had once again led him to the Cossack fishermen. After battle, they had left their camp on the Tartar coast and retreated to this island. Their boats were hidden along the perimeter of the island. It appeared that the whole unit had settled on this island."
                                                                        },
                                                                        {
                                                                            "text": "The runaway was again brought before the leader of the group. Dmytro had a feeling that he wouldn’t be able to escape the second time but help arrived from an unexpected place. A large boat approached the island. The Cossacks in this boat looked refreshed and full of energy. They also had better weapons. They embarked ashore, carrying a large oaken chest among them. Dmytro was escorted away from this new group, but, suddenly, one of the newcomers stopped. “Dmytro?” He asked, surprised, “Dmytro from Bila Tserkva? I though you had died at Yasy! What a meeting!” Dmytro cast a glance at his guards. “How do you do? I also remember you, Stepan! As you see, I ran away from the Tartars, but my Christian brothers almost drowned me.” He clearly remembered this young man who had once persuaded him to leave behind the registered Cossacks and set off for the Wild Fields. They were from the same region, from the Bila Tserkva subdivision. They had met during service and had good relations, but Stepan quickly disappeared after taking something from the treasury. “Good God!” Proclaimed Stepan and went to the center of the island with the others without saying anything more. Dmytro, however, wasn’t led any further but left to sit on the ground under the watchful eye of one of the Cossacks. Soon, Stepan returned and, smiling, said: “I put in a word for you. No one will try to drown you anymore – you can be sure. But come with us to the winter camp. There will be a big war with the Turks. We need manpower.”"
                                                                        },
                                                                        {
                                                                            "text": "In three days, the group reached the bleak cliffs that rose high above the Dnipro River, so steep that they seemed like great walls reaching towards the sky. The boat that was in front approached these stone giants and suddenly disappeared from sight. And after this boat, the next one vanished as well, and the one after that. When Dmytro’s boat reached the same cliff, he realized that it wasn’t solid. A massive boulder jutted out into the main body of the river, creating a narrow passage, behind which a peaceful stretch of land was safely hidden. In a while, the whole group had disembarked on the mysterious shore."
                                                                        },
                                                                        {
                                                                            "imageType": "river",
                                                                            "text": "Higher up on the shore was a forest full of ravines and gullies, behind which a small river ran its course into the majestic currents of the Dnipro."
                                                                        },
                                                                        {
                                                                            "text": "When the greater part of the Cossacks had gathered near the edge of the forest, surveying the surroundings, the leader of the group confidently proclaimed: “We will spend winter here!”"
                                                                        },
                                                                        {
                                                                            "imageType": "boat",
                                                                            "text": "men started to unpack the boats."
                                                                        },
                                                                        {
                                                                            "text": "The End of Chapter One"
                                                                        }
                                                                    ],
                                                                    "next": []
                                                                }
                                                            }
                                                        ]
                                                    }
                                                },
                                                {
                                                    "text": "Follow the others",
                                                    "nextPage": {
                                                        "nodes": [
                                                            {
                                                                "text": "The noise of battle didn’t subside. On the right side of the river, the reeds caught fire."
                                                            },
                                                            {
                                                                "imageType": "bulrush",
                                                                "text": "Dmytro gathered the last of his strength, got up and went in the direction of the clearing. He stopped near the dead man that was lying near the edge of the trail and picked up his saber. When he came out into the open, everything was covered in smoke, with arrows sticking out in different places. The main fight seemed to be somewhere up front. Suddenly, from behind the gray veil of smoke, two Tartars ran directly toward Dmytro. At the same time, something exploded near Dmytro’s left hand. He heard the whistle of artillery, and both of the Tartars fell down, struck by the pellets of a small canon. Dmytro ran forward and saw an opening on the side of a nearby hill from which smoke was coming from. Without stopping to look around, he entered the thick of the battle. At this very moment, the Cossacks were gaining ground on the Tartars, with the latter retreating towards the stream. A little longer and the Tartars were fleeing, sending volleys of arrows from hillsides to the valley. But soon the Cossacks overtook them, and the shooting stopped."
                                                            },
                                                            {
                                                                "text": "Somewhere above, gunshots still rang out, signaling the pursuit of the fugitives, but in the valley everything was quiet. The silence was broken by the moans of the injured that lay in the russet grass in puddles of blood. Surprisingly, there were no Cossacks among them. For a while, Dmytro stood to the side of the clearing, holding his bloodied sabre, until other Cossacks started to approach him, covered in dust, sweat and blood. One of them sat on the ground, catching his breath, another stood nearby, leaning on his rifle and looking up at the sky, another kindled a fire and lit his pipe. All were silent."
                                                            },
                                                            {
                                                                "text": "The Cossack that had interrogated Dmytro at the earthen cabin approached the clearing. He asked if anyone had been injured or killed. A few names were mentioned. He shook his head and ordered everyone to gather near the river. Then he turned to Dmytro: “So you didn’t run away? That’s good…We will decide what to do with you.” And he went to talk to the others. The group disbanded. The Cossacks walked along the valley, looking for their comrades, helping the wounded, and getting their things in order. Some of the dead were brought to the clearing and placed beneath the willows. They didn’t touch the dead Tartars, but only took their weapons."
                                                            }
                                                        ],
                                                        "next": [
                                                            {
                                                                "text": "Ask to join in",
                                                                "nextPage": {
                                                                    "endType": "alive",
                                                                    "nodes": [
                                                                        {
                                                                            "imageType": "cossacks",
                                                                            "text": "The runaway asked to stay with the Cossacks for a while. The warriors didn’t object to this and the gathering dispersed. The camp stirred – people carried things, rolled barrels, collected weapons, pulled the boats from their hiding places on the shore. Everyone was preparing to set sail."
                                                                        },
                                                                        {
                                                                            "text": "Dmytro was approached by a short broad-shouldered man. He was called Ustym and he said that he was looking for volunteers to help transport two heavily injured warriors to a safe place. He hinted that Dmytro could help since he didn’t have any matters to attend to at the camp. The runaway agreed and they walked to the edge of the clearing where the injured lay beneath the willows. Not far away, one of the dead was being buried, his tomb already covered with heavy earth and stones. Close by on the trunk of a willow somebody had carved a wide cross, which was the only sign of mourning for this Cossack’s sad fate."
                                                                        },
                                                                        {
                                                                            "text": "Two more volunteers approached, Ohrim and Ivan. Ustym decided that the four of them would manage on their own. He said that the journey wasn’t a long one."
                                                                        },
                                                                        {
                                                                            "text": "They found a horse to transport the wounded, but there was no cart in the camp since the warriors mainly used boats to move along the river and rarely went out into the steppe to the Tartar coast. So Ustym brought axes and the team started to build a sledge that could be pulled by a horse. One of the volunteers – Ivan, as it turned out, was once a tinsmith, and he quickly created a harness from some ropes, belts and parts of old harnesses. Dmytro had his doubts whether the horse would pull the harness, but the beast turned out to be surprisingly docile when harnessed, obediently pulling the load."
                                                                        },
                                                                        {
                                                                            "text": "The Cossacks hadn’t prepared for departure yet, but the wounded had to be taken away as quickly as possible. Sunset was quickly approaching and those who would transport the wounded couldn’t afford to set up camp on the road. The Cossacks agreed to leave a boat for the four volunteers, which the latter could use to catch up with the warriors on some shore that only Ustym knew about. Having finished their meeting and carefully placed the wounded Cossacks in the sledge, the volunteers set off. It was difficult to make their way out of the valley. In some places, they had to carry the sledge with the wounded in their arms. At last, they made it to the lowlands and quickly set off along the Dnipro, which though not visible, made its presence known by the rippling of the waves and the rushing wind."
                                                                        },
                                                                        {
                                                                            "text": "Ivan led the horse and the others walked beside him. They all had sabers and bows while the wounded in the sledge had a loaded rifle lying next to them. From time to time, Dmytro gave the wounded some water to drink. The group tried to move without as quickly as possible without taking breaks. The sun was already setting over the Dnipro when the Cossacks reached the steep path leading into a valley. The lowland, however, was quite far away, covered in an ancient oak forest. The tops of the trees weren’t even visible from the level steppe. All around, fairly large boulders protruded from the ground. When the travelers entered the forest, the boulders increased in size, laying among the trees in a blanket of bright green moss. Moving around, surprisingly, wasn’t difficult since there was almost no shrubbery in the forest. The even ground was covered with a deep layer of leaves and there was a good distance between the trees and boulders. However, with time, the valley started to narrow and become steeper when, finally, the travelers found the themselves at the bottom of a deep ravine covered in dense thickets. At their feet warbled a small stream."
                                                                        },
                                                                        {
                                                                            "text": "Ustym made a sign that they should stop. The group listened to the rustling leaves and the howling wind in the ravine. “Stay near the sledge, boys,” Ustym told Ivan and Dmytro, “We will see what’s out there.” Ohrim took the rifle and they both disappeared in the thickets."
                                                                        },
                                                                        {
                                                                            "text": "Dmytro, Ivan and the two wounded warriors waited an hour for the Cossacks to return. When Ustym and Ohrim finally returned they were in a very good mood and seemed to be in no hurry. “Will we spend the night here?” Dmytro asked. “No, we are almost there,” replied Ustym, “Only the horse won’t go any further.” Indeed, as they moved forward, the shrubbery became so thick and tangled that it was hard for even one person to make it through. They stopped at a clearing surrounded by thickets on all sides. A semicircle of trees grew in the clearing, covering the passageway. Beneath the trees was a fire pit from rough stones and the remnants of some makeshift shelter. Ivan tethered the horse to a tree and the men carefully transported the wounded unto the grass. Using some pieces from the sledge, they quickly put together two litters for the wounded and continued their journey to the mysterious refuge on foot."
                                                                        },
                                                                        {
                                                                            "text": "They scraped their way through the thickets, climbing between boulders that were almost close enough to crush the Cossacks with their weight. The tiny stream had long become their only source of direction. Finally, the passage widened a little but and the travelers entered a clearing that was a little bigger than the previous one, also surrounded by a wall of thickets. The stream ran adjacent to the clearing and seemed to come from a small cliff that hung over the ravine."
                                                                        },
                                                                        {
                                                                            "imageType": "forest",
                                                                            "text": "“We’ve arrived,” Ustym said at last. The men stopped and put the litters containing the wounded on the ground."
                                                                        },
                                                                        {
                                                                            "text": "The leader of the group came into the center of the clearing and made a sign with his hand, facing some blackthorn bushes. Having seen the sign, a tall elderly man emerged from the thickets. He had a beard and was dressed in shabby clothes. He had a large wooden cross on his neck. He looked like a hermit, but his garments were those of a Cossack and he had a pipe in his mouth. The bearded man had a bear spear in his hand that he leaned on as he would on a bishop’s staff. He walked past Ustym and, without saying a word, approached the wounded and bent over their litters. One of the men was conscious. “I see your death,” the old man muttered to him. “Your death is at your feet. It means you still have work to do in this world.” He stood up straight and went back into the shrubbery. The Cossacks picked up the litters and followed him."
                                                                        },
                                                                        {
                                                                            "text": "A small hillock hid among the thickets. It turned out to be the entrance to an earthen cabin whose door was set deep in the earth, facing the cliff where the stream bubbled from. The bearded man opened the door and disappeared in the darkness. He came back with a burning candle in his hand and beckoned the Cossacks to carefully carry the wounded inside. The Cossacks carefully carried the litters down the narrow steps."
                                                                        },
                                                                        {
                                                                            "text": "There was a whole cabin inside, containing several rooms and a clay stove, with tiny windows that were hardly noticeable from the outside. “Our men will come back soon. For now, fill up the barrel with water. It’s near the entrance along with a couple of pitchers,” the old man said."
                                                                        },
                                                                        {
                                                                            "text": "While the Cossacks carried water, the bearded man tended to the wounded in a separate room. In a while, he went out and called the group to gather near the table. The travelers brought with them some goods from the camp. They gave them to the hermit."
                                                                        },
                                                                        {
                                                                            "text": "After a quick meal, the old man asked: “Will you spend the night in my home? It is already dark outside.” “We kindly thank you, but we left our horse in the clearing. We will spend the night there,” one of the Cossacks replied. The hermit nodded his head in understanding."
                                                                        },
                                                                        {
                                                                            "text": "The Cossacks approached the clearing at midnight, prepared makeshift beddings and gathered near a bonfire. “Who was that man?” Asked Dmytro, curious about the hermit. “Blackthorn…” Replied Ohrim, lost in thought. “Which blackthorn?” Asked Dmytro, not understanding. “The old man’s name is Blackthorn,” explained Ustym and added, “He’s one our best healers and soothsayers, though an old one now.”"
                                                                        },
                                                                        {
                                                                            "imageType": "camp",
                                                                            "text": "The men woke before dawn to get back to their camp as quickly as possible. Without their wounded comrades, they moved much quicker and were back at the clearing as the sun was rising. They quickly found the boat and provisions hidden in the reeds. From another hiding spot, Ivan brought out his saddle and harness. “The four of us and our provisions won’t fit in the boat. I will take the horse and ride to the crossing further up the stream. I will join you at the camp on the other shore,” he explained to them energetically. It was obvious that this plan had not been discussed before, but they also didn’t want to leave behind the horse and some provisions. Ustym somewhat reluctantly agreed."
                                                                        },
                                                                        {
                                                                            "text": "They set off at noon, keeping close to the shore and paddling against the current towards the labyrinth of small islands, hidden among the reeds."
                                                                        },
                                                                        {
                                                                            "text": "Ustym steered the boat along the narrow straits. For a while, Dmytro thought that they were lost, but finally the boat landed on one of the islands. Ustym told them to wait in the boat while he went on the island, carefully parting the reeds to pass through. He returned fairly quickly with a small chest in his hands, which was added to the other cargo in the boat. Without wasting time, they continued to move on. It seemed that the labyrinth of reeds was endless, but Ustym confidently steered the boat and, finally, close to dusk, their boat slid through the open water and in a couple of hours landed at the opposite shore. Here, among cliffs and thickets, was a comfortable passage to the shore. There was a deafening silence in the air and the shore seemed completely uninhabited, but as soon as the travelers stepped on land, they were surrounded by their fellow Cossacks."
                                                                        },
                                                                        {
                                                                            "imageType": "forest",
                                                                            "text": "In three days, the group reached the bleak cliffs that rose high above the Dnipro River, so steep that they seemed like great walls reaching towards the sky. The boat that was in front approached these stone giants and suddenly disappeared from sight. And after this boat, the next one vanished as well, and the one after that. When Dmytro’s boat reached the same cliff, he realized that it wasn’t solid. A massive boulder jutted out into the main body of the river, creating a narrow passage, behind which a peaceful stretch of land was safely hidden. In a while, the whole group had disembarked on the mysterious shore."
                                                                        },
                                                                        {
                                                                            "text": "Higher up on the shore was a forest full of ravines and gullies, behind which a small river ran its course into the majestic currents of the Dnipro."
                                                                        },
                                                                        {
                                                                            "text": "When the greater part of the Cossacks had gathered near the edge of the forest, surveying the surroundings, the leader of the group confidently proclaimed: “We will spend winter here!” "
                                                                        },
                                                                        {
                                                                            "imageType": "boat",
                                                                            "text": "Happily greeting their comrade, the Cossacks started to unpack the boats."
                                                                        }
                                                                    ],
                                                                    "next": []
                                                                }
                                                            },
                                                            {
                                                                "text": "Ask to let leave",
                                                                "nextPage": {
                                                                    "endType": "alive",
                                                                    "nodes": [
                                                                        {
                                                                            "text": "To be continued"
                                                                        }
                                                                    ],
                                                                    "next": []
                                                                }
                                                            }
                                                        ]
                                                    }
                                                }
                                            ]
                                        }
                                    },
                                    {
                                        "text": "Turn back to steppe",
                                        "nextPage": {
                                            "nodes": [
                                                {
                                                    "text": "Dmytro hesitated a bit, but eventually turned back and walked away from the uncertain valley."
                                                },
                                                {
                                                    "text": "He had not gone very far when he came across a dried-up shallow riverbed, bordered by rocks. His horse jumped over it without stopping, yet after a while Dmytro noticed that he was limping on his right leg. Dmytro stopped and examined his horse. At first glance, everything seemed to be alright, but the horse needed to get some rest. He sat on a rock, letting the horse graze nearby, and looked around."
                                                }
                                            ],
                                            "next": [
                                                {
                                                    "text": "Return to the camp",
                                                    "nextPage": {
                                                        "endType": "alive",
                                                        "nodes": [
                                                            {
                                                                "text": "Dmytro turned back. Soon he had to hurry and lead the horse by his side."
                                                            },
                                                            {
                                                                "text": "The sun had already started to set when Dmytro spotted a cloud of dust in the distance. Then the cloud was divided into several clouds, which, slowly floating, separated in different directions. One of the clouds was moving forwards, but after a while it changed direction. Dmytro managed to make out a horse without a rider, galloping at full speed through the evening steppe and soon disappearing over the hills."
                                                            },
                                                            {
                                                                "imageType": "forest",
                                                                "text": "The familiar coastal cliffs appeared on the horizon once again. Hardly visible puffs of gray smoke rose from the valley where the river ran. Dmytro left the injured animal in the valley and  carefully set for the coast, holding his bow at the ready. Having reached the valley, he turned to the right and climbed the hill that rose on the opposite side of the stream. Dropping to the ground, the Cossack peered over the edge of the hill."
                                                            },
                                                            {
                                                                "text": "Near the coast there was a great pile of smoldering black ash. The only remains of what appeared to be a shack. The smoke from it covered the valley like morning fog. A part of the reeds growing in the river was also burned. The clearing was littered with a motley of castoff objects and everything was densely covered with arrows: the ground, trees and smoldering logs. In the middle of this chaos, here and there, lay the bloodied mangled of Tartars. Dmytro counted six bodies. No one showed any signs of life. The valley was completely silent with the only sound the crackling of coal in the burnt shack."
                                                            }
                                                        ],
                                                        "next": []
                                                    }
                                                },
                                                {
                                                    "text": "Move along",
                                                    "nextPage": {
                                                        "nodes": [
                                                            {
                                                                "text": "To be continued"
                                                            }
                                                        ],
                                                        "next": []
                                                    }
                                                }
                                            ]
                                        }
                                    }
                                ]
                            }
                        }
                    ]
                }
            }
        ]
    }
}