{
  "title": "Пожежа в степу",
  "description": "Під час чергування в степу Дмитро побачив куряву. Як виявилося, це татари підпалили степ. Прийміть вірні рішення, щоб зберегти своє життя і життя слободян!",
  "authors": "Дмитро Гладкий",
  "root": {
    "endType": null,
    "next": [
      {
        "text": "Сповістити робітників в лісі",
        "nextPage": {
          "endType": "DEAD",
          "next": [],
          "nodes": [
            {
              "text": "Неподалік працювало декілька десятків козаків в лісі. Вони заготовляли дрова і деревину для побудови човнів.",
              "imageType": "forest"
            },
            {
              "text": "Дмитро порахував, що робітники побачать пожежу, коли уже буде зовсім піздно і можуть задихнутися. Тому треба було їх врятувати.",
              "imageType": null
            },
            {
              "text": "Вони вихором помчали до табору в лісі.",
              "imageType": null
            },
            {
              "text": "Пожежа, роздмухана сильним вітром, уже сама по собі створювала вітрову тягу і просувалася степом все швидше і швидше.",
              "imageType": null
            },
            {
              "text": "Хлопці влетіли на конях прямо в ліс і свистом зібрали робітників, наказали все кидати і на конях тікати вкінець яру, де трава не така висока і вогонь може не дійти туди.",
              "imageType": "forest"
            },
            {
              "text": "Раптом в південній частині лісу дерева почали тріщати, вогонь перекинувся на їх ліс!",
              "imageType": null
            },
            {
              "text": "Козаки на конях вилетіли в степ, але все навколо них уже палало.",
              "imageType": null
            },
            {
              "text": "Коні здичавіли і перестали слухати вершників, деяких поскидали. Здійнялась страшна паніка, кожен тікав сам по собі.",
              "imageType": "forest"
            },
            {
              "text": "Кінь Дмитра витягнув його на самий верх яру, де палав уже вогонь.",
              "imageType": null
            },
            {
              "text": "Дмитро накинув ганчірку коню на очі і повів його через стіну вогню, сильну б'ючи нагайкою по боках коня, що аж шкіра почала сочитися кров'ю.",
              "imageType": null
            },
            {
              "text": "Сам як умога сильніше притулився до коня і пролетів через вогонь. Його свитка загорілась, обличчя було все обпалене.",
              "imageType": null
            },
            {
              "text": "Праве око не могло відкритися, вогонь обпік вії так сильно, що вони спеклися в одне ціле.",
              "imageType": "forest"
            },
            {
              "text": "Коли вогонь вщух, слободяни знайшли Дмитра разом з поваленим конем. Вся права сторона козака була обпечена.",
              "imageType": null
            },
            {
              "text": "То тут, то там в згорілому степу лежали спалені заживо козаки разом з їх конями.",
              "imageType": null
            },
            {
              "text": "Лише половині вдалося врятуватися.",
              "imageType": null
            }
          ]
        }
      },
      {
        "text": "Випалити степ перед пожежею",
        "nextPage": {
          "endType": "ALIVE",
          "next": [],
          "nodes": [
            {
              "text": "В лісі позаду працювали робітники, але часу їх попередити не було. Треба було діяти негайно, нехтуючи їхніми життями.",
              "imageType": null
            },
            {
              "text": "Козаки розпалили трут і поскалали в різні сторони на зустріч вогнянному валу. Треба було випалити степ, щоб вогняна стіна зупинилась.",
              "imageType": null
            },
            {
              "text": "Дмитро тричі спускався на землю, щоб роздмухати суху траву. Вогняний вал наближався кожної хвилини.",
              "imageType": "forest"
            },
            {
              "text": "Вітер почав розпалювати локальні вогнища і дуже швидко вогонь почав свій рух далі, залишаючи за собою чорний степ.",
              "imageType": null
            },
            {
              "text": "Цей випал степу був дуже вдалим, козаки встигли випалити близько триста кроків степу позаду себе і вогняний вал, упершись у попіл, почав вщухати.",
              "imageType": "forest"
            },
            {
              "text": "Козаки разом з робітниками з лісу швидко загасили невеличкі пожежі. Всі життя було врятовано!",
              "imageType": null
            }
          ]
        }
      },
      {
        "text": "Повернутись в слободу",
        "nextPage": {
          "endType": "ALIVE",
          "next": [],
          "nodes": [
            {
              "text": "Треба було сповістити слободу, щоб встигли відвезти худобу і набрали води для гасіння пожежі, якщо вогонь піде на хати.",
              "imageType": "cossacks"
            },
            {
              "text": "Слобода стояла за пагорбом, і катастрофічну пожежу не було видно.",
              "imageType": null
            },
            {
              "text": "За двадцять хвилин козаки добралися до першої череди, яка паслася в степу.",
              "imageType": "steppe"
            },
            {
              "text": "Перелякані чабани почали збирати худобу і гнати її через річку.",
              "imageType": null
            },
            {
              "text": "Дмитро полетів далі. ",
              "imageType": null
            },
            {
              "text": "За десять хвилин він уже був в слободу, кінь ледь не падав.",
              "imageType": null
            },
            {
              "text": "Всі злякалися, що татари ідуть, але звістка була ще страшніша: пожежа!",
              "imageType": "camp"
            },
            {
              "text": "Староста негайно вислав козаків для охорони худоби в степах.",
              "imageType": null
            },
            {
              "text": "Старі, молоді, діти, словом: всі, хто міг ходити, взяли заступи і почали перекопувати степ. З-за гори уже виднілась чорна хмара.",
              "imageType": null
            },
            {
              "text": "Дмитро взяв двох волів і почав переорювати підходи до слободи.",
              "imageType": null
            },
            {
              "text": "Інші слободяни тягали воду і обливали стріхи, щоб якщо вогонь дійде, то не взявся за їх будинки.",
              "imageType": "forest"
            },
            {
              "text": "Припинили роботу лише коли уже не можливо було дихати. Старики взяли дітей на підводи і повезли їх поза річку.",
              "imageType": null
            },
            {
              "text": "Всі дорослі налягли на колодязі і безпино обливали хати.",
              "imageType": null
            },
            {
              "text": "Якби Дмитро прибув пізніше, то всі ці перестороги уже б не допомогли.",
              "imageType": "steppe"
            },
            {
              "text": "Вогонь зупинився за двісті кроків до слободи.",
              "imageType": null
            },
            {
              "text": "Іскри долітали до хат, але вони вогкі і не займалися.",
              "imageType": null
            },
            {
              "text": "Під вечір вогонь вщух",
              "imageType": null
            },
            {
              "text": "Козаки, які працювали в лісі повернулися. Всі були заморені і чорні як ніч.",
              "imageType": "camp"
            },
            {
              "text": "Отари овець і корів почали заганяти за огорожу.",
              "imageType": null
            },
            {
              "text": "Селище було врятоване.",
              "imageType": "forest"
            }
          ]
        }
      }
    ],
    "nodes": [
      {
        "text": "Спекотний літній день. Дмитро разом з двома козаками знаходився  у степовому роз'їзді, чергуючи кордон.",
        "imageType": "forest"
      },
      {
        "text": "Козаки саме сіли обідать холодним кулішем, як з-за обрію почав куриться степ.",
        "imageType": null
      },
      {
        "text": "Дмитро сів на коня і помчав на сусідню могилу, щоб роздивитися кількість татар, які піднімають таку куряву.",
        "imageType": "river"
      },
      {
        "text": "На його подив, дим ставав дедалі чорнішим.",
        "imageType": null
      },
      {
        "text": "Нарешті вітер доніс сморід палаючого степу.",
        "imageType": "bulrush"
      },
      {
        "text": "Судячи з усього, татари вирішили підпалити степ, бо вітер як раз дув в сторону козацької слободи.",
        "imageType": null
      },
      {
        "text": "Дмитро повернувся до козаків. Вони вирішили зробите наступне:",
        "imageType": null
      }
    ]
  },
  "year": 1553
}