{
  "title": "Полювання на ведмедя",
  "description": "Робітники з лісу сповістили, що бачили групу ведмедів. Візьміть участь в охоті на них.",
  "authors": "Дмитро Гладкий",
  "root": {
    "endType": null,
    "next": [
      {
        "text": "Зробити постріл",
        "nextPage": {
          "endType": "DEAD",
          "next": [],
          "nodes": [
            {
              "text": "Василь опустив голову на приклад.",
              "imageType": null
            },
            {
              "text": "За мить обидва мисливці спустили гачки.",
              "imageType": "forest"
            },
            {
              "text": "Але постріл був лише один, самопал Василя дав осічку.",
              "imageType": null
            },
            {
              "text": "Куля ж, випущена Трохимом, ударилась у гілку і влучила ведмедю в плече.",
              "imageType": null
            },
            {
              "text": "Він заревів і кинувся в бік пострілу, ламаючи гілки.",
              "imageType": null
            },
            {
              "text": "Трохим взяв ключ і намагався взвести замок ще раз.",
              "imageType": "bulrush"
            },
            {
              "text": "Медвідь опинився швидше і лапою ударив Трохима в голову.",
              "imageType": null
            },
            {
              "text": "Він відлетів і ударився о землю.",
              "imageType": null
            },
            {
              "text": "Василь рогачем проткнув бік звірю, але той різко розвернувся і затис голову козака в пащі.",
              "imageType": null
            },
            {
              "text": "Тіло Василя обм'якло, потім почало бити в судомах.",
              "imageType": "forest"
            },
            {
              "text": "Трохим з останніх сил взвів замок і вистрілив під вухо ведмедю.",
              "imageType": null
            },
            {
              "text": "Через два дні тіла двох козаків знайдуть в лісі поруч з велетенським ведмедем.",
              "imageType": "forest"
            }
          ]
        }
      },
      {
        "text": "Зачекати",
        "nextPage": {
          "endType": "ALIVE",
          "next": [],
          "nodes": [
            {
              "text": "Василь підняв долоню, показавши знак не стріляти.",
              "imageType": null
            },
            {
              "text": "Гілки могли збити кулю, тому постріл був небезпечним, адже у них був один шанс.",
              "imageType": null
            },
            {
              "text": "Комашня обліпила все обличчя, але мисливці взагалі не помічали укусів.",
              "imageType": "forest"
            },
            {
              "text": "— Обходимо кущі, біля дуба зупиняємося, там буде краща позиція.",
              "imageType": null
            },
            {
              "text": "Сказав Василь, і вони тишком пішли по стежинці в бік дерев.",
              "imageType": null
            },
            {
              "text": "Ведмідь заспокоївся і пішов шукати їжу, прямо у напрямку до засідки.",
              "imageType": "forest"
            },
            {
              "text": "Мисливці поклали рогачі поруч, а самі уперлись важкими коліщатними самопалами об повалений дуб.",
              "imageType": null
            },
            {
              "text": "Треба було стрелити одночасно. В слободі всі вважали їх за братів, хоча вони познайомились під час походу під Очаків, і з тих часів завжди разом ходили на промисел.",
              "imageType": null
            },
            {
              "text": "— Три, два, один.",
              "imageType": null
            },
            {
              "text": "Одночасно два мушкети вистрілили. Ведмідь саме стояв боком, відкривши своє серце під приціл.",
              "imageType": null
            },
            {
              "text": "Обидві кулі увійшли під лопатку.",
              "imageType": "boat"
            },
            {
              "text": "Ведмідь встав на дибки, почав гарчати й одразу звалився на землю.",
              "imageType": null
            },
            {
              "text": "Козаки миттю перезарядили мушкети та почали обходити ведмедя з двох сторін.",
              "imageType": null
            },
            {
              "text": "Вони були хитрі, могли запросто придуритися мертвими, щоб в останні хвилини життя атакувати нападників.",
              "imageType": "forest"
            },
            {
              "text": "Трохим підійшов близько, кинув гілку в морду.",
              "imageType": null
            },
            {
              "text": "Потім рогачем штрикнув у шию.",
              "imageType": null
            },
            {
              "text": "Ведмідь був мертвий.",
              "imageType": "forest"
            }
          ]
        }
      }
    ],
    "nodes": [
      {
        "text": "До слободи з чергування по лісозаготівлі повернулися робітники. Вони розповіли, що бачили велику групу ведмедів, які зайшли за балку.",
        "imageType": "camp"
      },
      {
        "text": "Трохим з Василем, мисливці, вирішили вполювати звірину, щоб потім продати хутра.",
        "imageType": null
      },
      {
        "text": "Кожен взяв по два самопали, рогачі. Потім натерли листя з ягодами та обмазали коней та себе, щоб збити запах живих істот.",
        "imageType": null
      },
      {
        "text": "Виступили ще з ночі, бо до лісу був не швидкий шлях.",
        "imageType": "forest"
      },
      {
        "text": "З першими променями сонця вони зайшли у ліс.",
        "imageType": null
      },
      {
        "text": "Коней припонили біля клену, в хащах. Дали їм вівса, щоб не смикались, а самі заглибились у ліс.",
        "imageType": null
      },
      {
        "text": "Обережно просуваючись між гілок, вони шукали сліди, які згодом і помітили.",
        "imageType": null
      },
      {
        "text": "Через листя і гілки, мисливці угледіли, як величезний ведмідь чухав спину об дуба.",
        "imageType": "forest"
      },
      {
        "text": "У мисливців було по самопалу в руках, пружини яких були взведені заздалегідь.",
        "imageType": null
      },
      {
        "text": "Раптом ведмідь став на задні лапи, та почав вдихати повітря через чорний ніс.",
        "imageType": null
      },
      {
        "text": "Широкі груди були відкриті для пострілу.",
        "imageType": "forest"
      }
    ]
  },
  "year": 1552
}