{
  "title": "Кодацька ніч",
  "description": "Для стримання козаків поляки в 1635 році звели земляну фортецю на Кодаку. Іван Сулима, який саме повертався з морського походу з перемогою, не зміг стримати такої образи і в ніч з 2 на 3 серпня захопив фортецю, повністю вирізавши німецьких найманців.",
  "authors": "Дмитро Гладкий",
  "root": {
    "endType": null,
    "next": [
      {
        "text": "Піти водою",
        "nextPage": {
          "endType": null,
          "next": [
            {
              "text": "Чекати на сигнал Трохима",
              "nextPage": {
                "endType": "ALIVE",
                "next": [],
                "nodes": [
                  {
                    "text": "— Німці геть розслабилися, лежать і взагалі не дивляться за степом і водою. Чекаємо на Трохима і беремо її приступом.",
                    "imageType": null
                  },
                  {
                    "text": "Іван побачив, як в кущах в парі сотень кроків від них почали шурхати свої свитки. Це загін Трохима підійшов до паркану і готувався до атаки.",
                    "imageType": null
                  },
                  {
                    "text": "— Перелазимо! Перші ідіть без зброї, ми вам перекинемо.",
                    "imageType": null
                  },
                  {
                    "text": "По натягнутим драбинам двадцять козаків почали перелазити паркан.",
                    "imageType": null
                  },
                  {
                    "text": "Слідом за ними тихенько передали луки і списи.",
                    "imageType": "camp"
                  },
                  {
                    "text": "Загін Івана і Трохима майже одночасно вискочив з-за кущів і відвалів валу і накинувся на німців, які уже збирали речі, щоб піти вечеряти.",
                    "imageType": null
                  },
                  {
                    "text": "— Was ist das, Tataren?",
                    "imageType": null
                  },
                  {
                    "text": "— (Це що таке, татари?)",
                    "imageType": null
                  },
                  {
                    "text": "Закричав рудобородий найманець.",
                    "imageType": null
                  },
                  {
                    "text": "І через мить стріла, випущена Іваном, розірвала йому артерію на шиї.",
                    "imageType": "camp"
                  },
                  {
                    "text": "— Zu den Waffen!",
                    "imageType": null
                  },
                  {
                    "text": "— (До зброї!).",
                    "imageType": null
                  },
                  {
                    "text": "Почали кричати інші німці та розбігатися хто куди.",
                    "imageType": null
                  },
                  {
                    "text": "Але з усіх сторін на них посунули козаки, які насаджували їх на свої списи.",
                    "imageType": null
                  },
                  {
                    "text": "Різанина тривала не більше як хвилину",
                    "imageType": "camp"
                  },
                  {
                    "text": "Трохим побачив, що ворота в самий замочок ще відкриті, а через них виглядають вартові, які не можуть зрозуміти, чому їх товариші підняли якийсь галас.",
                    "imageType": null
                  },
                  {
                    "text": "— Іване, до воріт! Беремо все одразу!",
                    "imageType": null
                  },
                  {
                    "text": "Козаки уже встигли перекинути десятки самопалів. Оскільки німці зрозуміли, що це напад, то приховуватися не було змісту.",
                    "imageType": null
                  },
                  {
                    "text": "Першим залпом зрізали вартових на воротях.",
                    "imageType": null
                  },
                  {
                    "text": "З-за них одразу вискочило три німці, які почали закривати ворота і голосно кричали своїм.",
                    "imageType": "forest"
                  },
                  {
                    "text": "Іван стрілою пригвоздив руку одному з них. Він упав і почав смикатися, щоб вистромити стрілу з дошки.",
                    "imageType": null
                  },
                  {
                    "text": "Інші двоє німців ніяк не могли закрити ворота, бо за воротами волочивя поранений і пригвоздений німець.",
                    "imageType": null
                  },
                  {
                    "text": "Козаки підбігли й гаками розкрили ворота. ",
                    "imageType": null
                  },
                  {
                    "text": "На їх подив, німці досі були без мушкетів. Вся їх зброя лежала у підвалі, звідки вони поспіхом почали виносити.",
                    "imageType": null
                  },
                  {
                    "text": "Але в лаву стало пару десятків копійників, які опустили списи і не давали козакам зайти через ворота.",
                    "imageType": null
                  },
                  {
                    "text": "— Я їх зріжу!",
                    "imageType": "camp"
                  },
                  {
                    "text": "Крикнув Іван Трохиму і наказав своїм козакам стати у три лави.",
                    "imageType": null
                  },
                  {
                    "text": "— Jetzt sind wir fertig!",
                    "imageType": "bulrush"
                  },
                  {
                    "text": "— (Тепер нам кінець!)",
                    "imageType": null
                  },
                  {
                    "text": "З кінцем фрази тридцять козацьких замків ударили і смертельний свинець полетів через ворота в копійників.",
                    "imageType": null
                  },
                  {
                    "text": "Кулі позривали руки, вивалювали кишки, багатьом німцям дісталося по дві-три кулі.",
                    "imageType": null
                  },
                  {
                    "text": "Половина копійників була вирізана першим залпом.",
                    "imageType": null
                  },
                  {
                    "text": "І тут же дві лави козаків, які чекали черги, випустили свої заряди.",
                    "imageType": null
                  },
                  {
                    "text": "Кулі пробивали шоломи, калічили найманців. Не встиг розвіятися дим від залпів, які козаки зі списами вдерлися і почали різати тікаючих німців.",
                    "imageType": null
                  },
                  {
                    "text": "Їх затисли біля входу у підвал, де лежав порох, який вони так і не встигли винести.",
                    "imageType": null
                  },
                  {
                    "text": "Капітан найманців встиг зробити один постріл, убивши козака.",
                    "imageType": "camp"
                  },
                  {
                    "text": "Ошаліли козаки впритул почали розстрілювати останніх оборонців.",
                    "imageType": "bulrush"
                  },
                  {
                    "text": "— Не стрілять, покладете своїх!",
                    "imageType": null
                  },
                  {
                    "text": "Іван і Трохим віддали наказ зупинити стрілянину, бо залпами зачепили своїх, які лежали в калюжах своєї крові. Дехто ще був живий і намагався відповзти.",
                    "imageType": null
                  },
                  {
                    "text": "Уже сильно потемнішало. Десяток останніх найманців закрилися у підвалі.",
                    "imageType": null
                  },
                  {
                    "text": "Козаки тим часом відтягли поранених і понесли їх до човнів.",
                    "imageType": "bulrush"
                  },
                  {
                    "text": "По дорозі до берега зустріли Сулиму, який поспішав на допомогу.",
                    "imageType": null
                  },
                  {
                    "text": "Йому пояснили, що бій закінчено, але частина закрилася у підвалі й не виходить.",
                    "imageType": null
                  },
                  {
                    "text": "Іван Сулима підійшов до дверей і сказав:",
                    "imageType": "camp"
                  },
                  {
                    "text": "— Igitur incendemus te, vivit Abeas",
                    "imageType": null
                  },
                  {
                    "text": "— (Виходьте, або спалимо живцем)",
                    "imageType": null
                  },
                  {
                    "text": "— Miserere nobis habetis? (Ви нас помилуєте?).",
                    "imageType": "boat"
                  },
                  {
                    "text": "— nullum",
                    "imageType": null
                  },
                  {
                    "text": "— (Ні)",
                    "imageType": null
                  },
                  {
                    "text": "Коротко відповів Сулима.",
                    "imageType": null
                  },
                  {
                    "text": "— Deinde ad infernum.",
                    "imageType": null
                  },
                  {
                    "text": "— (Тоді ідіть до біса).",
                    "imageType": null
                  },
                  {
                    "text": "— Кінчайте їх, — віддав наказ Гетьман.",
                    "imageType": "camp"
                  },
                  {
                    "text": "Козаки піднесли дрова і підпалили вхід.",
                    "imageType": "forest"
                  },
                  {
                    "text": "Нарубали гілок і махали ними, щоб весь дим ішов прямо до дверей.",
                    "imageType": null
                  },
                  {
                    "text": "Напоготові стояли декілька козаків з самопалами, готові одразу розстріляти німців, якщо ті вийдуть.",
                    "imageType": null
                  },
                  {
                    "text": "Найманці почали сильно кашляти й бити у двері. Серед них почалась боротьба. Частина хотіла вибігти, інша ж настільки боялась катувань козаків, що не давала відкрити двері.",
                    "imageType": "boat"
                  },
                  {
                    "text": "Нарешті двері вивалились і німці випали прямо у вогонь.",
                    "imageType": null
                  },
                  {
                    "text": "Козаки ударили в самопали, але всі три далі осічку.",
                    "imageType": null
                  },
                  {
                    "text": "Іван з Трохимом взяли списи та почали колоти осліплих від диму німців.",
                    "imageType": null
                  },
                  {
                    "text": "Вони пробили їм ноги й штриканням заганяли їх назад у величезне багаття. Дехто хапався за списи, але інші ударами розрізали їм руки.",
                    "imageType": null
                  },
                  {
                    "text": "Шкіра їх вкривалася водицями, волосся все згоріло. У деяких найманців від температури лопнули очі і звідти сочився пар. Трохим і Іван дивився на все це без всякої відрази.",
                    "imageType": "bulrush"
                  },
                  {
                    "text": "За дві хвилини останні десять німців були заживо допечені й уже не смикались. Стояв страшний сморід горілого людського м‘яса.",
                    "imageType": null
                  },
                  {
                    "text": "Дехто з козаків відійшов в кущі та вибльовував вечерю.",
                    "imageType": null
                  },
                  {
                    "text": "— Завтра засиплемо рів, вал зрівняємо. Ніхто не буде ставити нам ошийники на Січ.",
                    "imageType": null
                  },
                  {
                    "text": "Сказав Сулима і пішов до байдаків перевірити поранених і розділити трофеї серед козаків.",
                    "imageType": null
                  },
                  {
                    "text": "Тиха українська ніч опустилася.",
                    "imageType": "boat"
                  },
                  {
                    "text": "Де-не-де співав соловейко, а козаки ще носили порох і готовий ліс, щоб відвезти назад себе на Січ.",
                    "imageType": "bulrush"
                  }
                ]
              }
            },
            {
              "text": "Почати одразу",
              "nextPage": {
                "endType": "ALIVE",
                "next": [],
                "nodes": [
                  {
                    "text": "— Чекати не будемо, Трохим знає, що робити. Сулима уже шикує козаків.",
                    "imageType": null
                  },
                  {
                    "text": "— Зайдемо першими. Перші десять несуть мотузкові драбини й натягують їх, інші по ним залазять.",
                    "imageType": null
                  },
                  {
                    "text": "— Самопали подамо потім.",
                    "imageType": "cossacks"
                  },
                  {
                    "text": "Козаки побрали драбини й побігли до валу. Хутко закинули на частокіл і уже через дві хвилини двадцять козаків з самопалами стояло всередині укріплення.",
                    "imageType": null
                  },
                  {
                    "text": "Німці і далі лежали на сонці. Хто в споднях, хто без.",
                    "imageType": null
                  },
                  {
                    "text": "Лава козаків мовчки, без жодних криків і гасел налетіли на найманців.",
                    "imageType": null
                  },
                  {
                    "text": "Двоє з них прийнялись тікати, але стріли випущені з луків знайшли свої цілі.",
                    "imageType": null
                  },
                  {
                    "text": "Інші взагалі нічого не второпали й не встигли підвестися, як козацькі ратища проткнули їм груди.",
                    "imageType": null
                  },
                  {
                    "text": "— Mutter Gottes rette uns!",
                    "imageType": "camp"
                  },
                  {
                    "text": "Закричав у фортеці німець, який бачив цю різанину.",
                    "imageType": null
                  },
                  {
                    "text": "Але їх зброя лежала в арсеналі. Вони наспіх стали намагатися закрити ворота у внутрішній двір.",
                    "imageType": null
                  },
                  {
                    "text": "Деякі копійники виставили списи з воріт і не давали козакам пройти далі.",
                    "imageType": "camp"
                  },
                  {
                    "text": "Позаду них, капітан Жан Маріон відкривав вхід до підвалу, де зберігався порох.",
                    "imageType": null
                  },
                  {
                    "text": "— Вони без мушкетів! Беремо вогнем!",
                    "imageType": null
                  },
                  {
                    "text": "Крикнув Трохим, який саме приєднався до атаки, почувши, що вона почалась без команди.",
                    "imageType": null
                  },
                  {
                    "text": "Козаки розступилися, а позаду них двадцять п‘ять козацьких мушкетів одночасно зробили залп.",
                    "imageType": "bulrush"
                  },
                  {
                    "text": "Уламки воріт, шматки обличчя, чиюсь нутрощі, відірване око, все це змішалося в одній хмарі порохових газів від залпу.",
                    "imageType": null
                  },
                  {
                    "text": "— Helfen Sie bald, tragen Sie Musketen!",
                    "imageType": null
                  },
                  {
                    "text": "Лише дисципліна і вишкіл ветеранів тридцятилітньої війни не дали шанс козакам зайти всередину прямо зараз.",
                    "imageType": null
                  },
                  {
                    "text": "Замість попадавших німцях у воротях з‘явилося ще більше. Вони хапали хто яку зброю, але порох, порох! Він був у підвалі!",
                    "imageType": "river"
                  },
                  {
                    "text": "Ще два залпи козаків завалило трупом вхід. За лавою конаючої німоти поховалися копійники та списами відганяли козаків, які постійно підлітали з своїми короткими рогачами.",
                    "imageType": null
                  },
                  {
                    "text": "Таким чином, Іван та Трохим тримали ініціативу і диктували умови бою.",
                    "imageType": null
                  },
                  {
                    "text": "Як раптом, позаду козаків з‘явився Сулима з основними силами!",
                    "imageType": null
                  },
                  {
                    "text": "Попереду бігли козаки, тримаючи дерев‘яні драбини, які миттю були приставлені до останньої перешкоди.",
                    "imageType": null
                  },
                  {
                    "text": "— Für uns ist alles vorbei! Verdammte Kosaken werden uns alle schneiden!",
                    "imageType": null
                  },
                  {
                    "text": "Заверещала залога фортеці.",
                    "imageType": null
                  },
                  {
                    "text": "— Іван, Трохим, пробивайте через ворота, а ми по стінах ліземо.",
                    "imageType": "cossacks"
                  },
                  {
                    "text": "Віддав наказ Сулима, а сам побіг до однієї із драбин і за іншими козаками став вдиратися у замочок.",
                    "imageType": null
                  },
                  {
                    "text": "Загону Івану принесли ще забитих самопалів. Козаки утворили вогняний штурм, коли без зупинки відпрацювали вісім залпів із тридцяти самопалів.",
                    "imageType": null
                  },
                  {
                    "text": "Вітер відгорнув завісу диму, і перед очима постала страшна картина:",
                    "imageType": null
                  },
                  {
                    "text": "Потрощені трупи німоти завалили весь прохід, кров стікала у рів, навіть дзюрчала, потихеньку напуваючи українську землю.",
                    "imageType": null
                  },
                  {
                    "text": "Копійники були всі геть перебиті. Дехто намагався відповзти, але нутрощі чіплялись за траву і заважали.",
                    "imageType": null
                  },
                  {
                    "text": "Козаки Івана з Трохима побрали дерев‘яні дошки та постелили поверх купи мертвої німоти.",
                    "imageType": null
                  },
                  {
                    "text": "Шлях до різанини був відкритий!",
                    "imageType": "camp"
                  },
                  {
                    "text": "Козаки уже билися всередині фортеці.",
                    "imageType": null
                  },
                  {
                    "text": "Падіння основних воріт унеможливив будь-яку оборону.",
                    "imageType": null
                  },
                  {
                    "text": "Козацькі шапки то тут то там перестрибували через.",
                    "imageType": null
                  },
                  {
                    "text": "Один із козаків, з прізвищем Неубийконя, тримав у руках палку з насадженим черепом коня.",
                    "imageType": null
                  },
                  {
                    "text": "Він здобув цю дивну зброю у татар і завжди брав її для рукопашного бою.",
                    "imageType": "river"
                  },
                  {
                    "text": "Цим черепом він дістав по голові коменданта фортеці — Маріон",
                    "imageType": null
                  },
                  {
                    "text": "За дві хвилини козаки вибили до ноги всю залогу.",
                    "imageType": null
                  },
                  {
                    "text": "Декілька десятків німців потрапило у полон. Вони знали, як відносяться козаки до найманців, тому сильно плакали й благали щось німецькою.",
                    "imageType": "river"
                  },
                  {
                    "text": "Сулима жестом показав на Дніпро.",
                    "imageType": null
                  },
                  {
                    "text": "Козаки потягнули полонених на берег.",
                    "imageType": null
                  },
                  {
                    "text": "Тих, хто сильно пручався, різали на місці.",
                    "imageType": null
                  },
                  {
                    "text": "На березі, один за одним були утоплені всі найманці.",
                    "imageType": "river"
                  },
                  {
                    "text": "Козаки вкинули коменданта фортеці у яр і почали засипати.",
                    "imageType": null
                  },
                  {
                    "text": "— Quaeso, ego te absque ulla me?",
                    "imageType": null
                  },
                  {
                    "text": "— (Благаю, я відкуплюсь!)",
                    "imageType": null
                  },
                  {
                    "text": "Сулима підійшов до краю ями й відповів:",
                    "imageType": null
                  },
                  {
                    "text": "— Et factum est ut dependeat in eo a nobis iugum, ut maneat iugum super eo.",
                    "imageType": "bulrush"
                  },
                  {
                    "text": "— (Ти прийшов нам повісити ярмо, то ж залишайся біля цього ярма і далі!)",
                    "imageType": null
                  },
                  {
                    "text": "Козаки дочекались до ранку. З першим сонцем прийнялись виривати частокіл і зносити фортецю.",
                    "imageType": null
                  },
                  {
                    "text": "Ввечері від фортеці та валів не було і сліду...",
                    "imageType": null
                  },
                  {
                    "text": "Тиха українська ніч минула...",
                    "imageType": "forest"
                  }
                ]
              }
            }
          ],
          "nodes": [
            {
              "text": "Курінь вибрав собі три байдаки й взявся затято оббивати їх очеретом. Спеціально вибирали свіжий прямо з води, щоб він не відрізнявся по кольору.",
              "imageType": null
            },
            {
              "text": "Іван Сулима працював на рівні разом з іншими козаками. ",
              "imageType": "cossacks"
            },
            {
              "text": "Козаки підготувалися за один день, бо все похідне було в купі. Всього за день до походу було готово уже вісім сотень козаків. ",
              "imageType": null
            },
            {
              "text": "Весь курінь вирушив рано вранці. Кінно пішла інша група козаків. Кожну годину вони домовились підтримувати зв‘язок: до Дніпра підходило троє козаків, а до берега мав пристати човен.",
              "imageType": "boat"
            },
            {
              "text": "Іван веслав у човні. Проти стрімкої течії треба було постійно працювати веслом.",
              "imageType": null
            },
            {
              "text": "Байдак був оббитий очеретом в повний людський зріст, тому на носі лежав козак, який висунув голову і дивився за річкою.",
              "imageType": null
            },
            {
              "text": "Раптом він підняв руку. Веслярі миттю опустили весла у воду і підняли руків‘я вертикально, щоб не було видно виступаючих весел.",
              "imageType": null
            },
            {
              "text": "Хто не гріб, похапав самопал і повзводив замки.",
              "imageType": null
            },
            {
              "text": "— Пугу-пугу!",
              "imageType": "boat"
            },
            {
              "text": "Почулося з берега.",
              "imageType": null
            },
            {
              "text": "— Пугу-пугу-пугу.",
              "imageType": null
            },
            {
              "text": "Відповіли з човна.",
              "imageType": "boat"
            },
            {
              "text": "Всі розслабилися. Іван наказав пристати до берега.",
              "imageType": null
            },
            {
              "text": "До Кодака залишалося ще три години ходу, але хто зна, хто міг ходити степом.",
              "imageType": null
            },
            {
              "text": "У фортеці стояли німці, які не любили ходити степом і дуже боялися залишитись сам на сам з козаками або татарами.",
              "imageType": null
            },
            {
              "text": "Це їм не Тридцятилітня війна, яка щойно закінчилася в Європі й тепер вони вимушені найматися по всьому світові.",
              "imageType": null
            },
            {
              "text": "Козаки нещадно ставились до всіх найманців, які чомусь прийшли обмежувати їх привілеї, які вони з величезним трудом і кров'ю виборювали упродовж сотні років.",
              "imageType": null
            },
            {
              "text": "Іван домовився з Трохимом, головою кінної розвідки, що стануть під вечір біля Кодацького порогу, який дуже затягло очеретом. Дві групи мали розвідати оборону і довести до відома Сулими, який уже вирушив і наздоганяв їх загін.",
              "imageType": null
            },
            {
              "text": "Козаки побажали один одному успіху і рушили далі.",
              "imageType": null
            },
            {
              "text": "Байдаки ішли тихо, ледь не торкаючись веслами очерету на правому березі.",
              "imageType": "river"
            },
            {
              "text": "Очі байдака знову підняв руку вгору.",
              "imageType": null
            },
            {
              "text": "Веслярі опустили весла і затамували подих.",
              "imageType": null
            },
            {
              "text": "Десь недалечко було чутно людський голос. Але ніхто не міг зрозуміти, про що була розмова.",
              "imageType": null
            },
            {
              "text": "— Пугу-пугу!",
              "imageType": null
            },
            {
              "text": "Видав козацький клич Іван.",
              "imageType": null
            },
            {
              "text": "Це могли бути наші рибалки або ж розвідка фортеці. Вона уже височіла на горі.",
              "imageType": null
            },
            {
              "text": "Іван обережно розсунув прив‘язаний очерет руками й знову видав клич:",
              "imageType": "river"
            },
            {
              "text": "— Пугу-пугу.",
              "imageType": null
            },
            {
              "text": "Розмова в очереті раптово зупинилась.",
              "imageType": "bulrush"
            },
            {
              "text": "Всі козаки миттю похапали списи та луки. Все відбувалося мовчки без жодного звуку.",
              "imageType": null
            },
            {
              "text": "Після здобуття Азову, Кодак видавався їм невеликою перешкодою.",
              "imageType": "boat"
            },
            {
              "text": "— Diese verdammten Vögel haben etwas gesungen. Ich habe gehört, dass die Kosaken so begrüßt werden, aber sie befinden sich irgendwo in einer Kampagne gegen die Türken.",
              "imageType": null
            },
            {
              "text": "— Ich würde sie nicht bekämpfen wollen. Ihre Feuerkraft ist unserer überlegen. Sie würden Einheit miteinander haben, und dann erheben sie sich ständig und übergeben dann die Führer an die Polen und trauern weiter.",
              "imageType": null
            },
            {
              "text": "Іван нарешті побачив двох німців, які срали в очереті. Зброя валялась поруч.",
              "imageType": "bulrush"
            },
            {
              "text": "Арканом не можна було їх взяти, заважав очерет. Німецьку ніхто не знав, тому в пригоді як язики вони не могли стати. Курінний показав жест перерізаної горлянки.",
              "imageType": null
            },
            {
              "text": "Два козаки підвели луки й наклали стрілу.",
              "imageType": null
            },
            {
              "text": "Іван і Дмитро розсунули очерет і дві стріли миттєво вилетіли в сторону найманців.",
              "imageType": "bulrush"
            },
            {
              "text": "Одному німцю стріла пробила серце і він упав намертво у своє ж лайно. Іншому стріла встряла в горло. Він упав на землю і почав котитися в сторону, вихаркуючи кров через рот.",
              "imageType": null
            },
            {
              "text": "Іван і ще троє козаків зістрибнули з човна і рухаючись по пояс у воді стали іти до берега. ",
              "imageType": null
            },
            {
              "text": "Іван знаком показав човнам, яких важко було відрізнити від справжнього очерету, стояти тихо.",
              "imageType": "boat"
            },
            {
              "text": "Вийшовши на берег вони підібрали зброю і харчі. Іван підійшов до конаючого німця, який з жахом дивився на нього. Він намагався щось сказати, але Іван нічого не зрозумів.",
              "imageType": null
            },
            {
              "text": "Німець надував через ніс криваві пузирі, які лопались і стікали по шиї вниз на землю.",
              "imageType": null
            },
            {
              "text": "Іван ударив списом в шию в зону артерії, з якою миттю зашипіла кров.",
              "imageType": null
            },
            {
              "text": "Німець побілів і перестав смикатися.",
              "imageType": null
            },
            {
              "text": "Козаки розгледіли невеличкий дозорний пункт. Судячи з усього, найманці відійшли від табору по нужді, де їх і застали козаки.",
              "imageType": null
            },
            {
              "text": "Іван хутко зметикував стати тут табором і звідси відіслати розвідку до фортеці.",
              "imageType": "bulrush"
            },
            {
              "text": "Федір і Михайло перевдягнулись в німецьке вбрання і сіли біля дозору.",
              "imageType": null
            },
            {
              "text": "Якщо мала відбутися зміна дозору, то козаки б здалися за своїх і підпустили зміну, а потім зарізали б їх.",
              "imageType": "bulrush"
            },
            {
              "text": "— Я беру п‘ятьох козаків і іду шукати Трохима, а ви тут приймайте Сулиму.",
              "imageType": null
            },
            {
              "text": "— Ми підемо до фортеці. Всім бути на готові у будь-який момент виступити на приступ.",
              "imageType": null
            },
            {
              "text": "— На байдаках розмотайте драбини і перевірте закидні гаки.",
              "imageType": "boat"
            },
            {
              "text": "Вони вирушили вздовж Дніпра на двох довбанках.",
              "imageType": null
            },
            {
              "text": "На правому березі височіла гора, на ній стояв вал і накладений дерев‘яний паркан.",
              "imageType": null
            },
            {
              "text": "Дніпро контролювали два бастіончика, з яких, судячи усього, залога могла викочувати гармати і контролювати річку.",
              "imageType": "river"
            },
            {
              "text": "Біля самого порогу Іван перестрів Трохима. Домовилися піти двома шляхами й зазирнути за вал.",
              "imageType": null
            },
            {
              "text": "— Я підійду з води, закину драбину і гляну що там.",
              "imageType": null
            },
            {
              "text": "— Добре, а я підповзу зі степу. Зустрічаємося тут через дві години.",
              "imageType": null
            },
            {
              "text": "Іван відштовхнув човен і потрошку погріб разом зі своїми козаками прямо під берегом.",
              "imageType": "boat"
            },
            {
              "text": "Висадилися в хащах. Микола залишився на човні, ліг і закрив його очеретом. З берега його взагалі не було видно.",
              "imageType": null
            },
            {
              "text": "Іван з трьома іншими підліз під вал.",
              "imageType": null
            },
            {
              "text": "— Я далі сам, ви натягніть луки й чекайте.",
              "imageType": "bulrush"
            },
            {
              "text": "Іван швидко перебіг вал і закинув мотузяну драбину на частокіл.",
              "imageType": null
            },
            {
              "text": "Швидко видряпався. Зазирнув одним оком.",
              "imageType": null
            },
            {
              "text": "Навколо не було нікого. Десь біля будівель були розвішані випрані штани.",
              "imageType": null
            },
            {
              "text": "Іван підняв шаблю, щоб не дзенькала, і почав пробиратися через кущі вздовж частоколу.",
              "imageType": null
            },
            {
              "text": "— Gestern wurden die beiden Bauern getötet, die mit dem Boot die Schwelle überqueren wollten. Viel Spaß hier. Wir fangen und erwürgen sie wie Mäuse.",
              "imageType": "bulrush"
            },
            {
              "text": "Іван побачив гурт німців, які лежали голими й ніжилися на сонці. Зброї поруч не було.",
              "imageType": null
            },
            {
              "text": "Судячи з усього, це вартові, які б мали слідкувати за водою, але, думаючи, що козаки десь на Чорному морі, розслабилися і ловили сонце.",
              "imageType": null
            },
            {
              "text": "Іван відійшов назад за паркан.",
              "imageType": "bulrush"
            },
            {
              "text": "— Німці без зброї, лежать на сонці. Їх зараз можна захопити без крові.",
              "imageType": null
            },
            {
              "text": "— Михайло, лети до човна, нехай Микола піде до табору і скаже хлопцям виступати водою. Також Трохиму скажіть, що можна брати прямо зараз.",
              "imageType": null
            },
            {
              "text": "— Ми будемо лежати під частоколом у кущах, чекати на вас.",
              "imageType": null
            },
            {
              "text": "Через сорок хвилин два десятки козаків висипали на берег.",
              "imageType": "river"
            },
            {
              "text": "В руках тримали по два-три самопали або ж луки й списи.",
              "imageType": null
            }
          ]
        }
      },
      {
        "text": "Вирушити кінно",
        "nextPage": {
          "endType": null,
          "next": [
            {
              "text": "Перевірити берег",
              "nextPage": {
                "endType": "ALIVE",
                "next": [],
                "nodes": [
                  {
                    "text": "Іван наказав трьом козакам спішитись та глянути, чи хтось стоїть на березі.",
                    "imageType": null
                  },
                  {
                    "text": "Сам загін заліг у траві. Деякі натягнули луки й чекали на біду.",
                    "imageType": "river"
                  },
                  {
                    "text": "Сонце палило нещадно. Козацькі коні лежали тихо, лише рідко били хвостом, щоб збити сліпнів, які були з розмір кулака.",
                    "imageType": null
                  },
                  {
                    "text": "Вершники накрили їх полотном, щоб коні не здуріли від мошкари.",
                    "imageType": null
                  },
                  {
                    "text": "Через пів години повернулися козаки. Стець в руках тримав мішок.",
                    "imageType": null
                  },
                  {
                    "text": "В них лежало дві руді голови.",
                    "imageType": null
                  },
                  {
                    "text": "— Це що за трясця?",
                    "imageType": null
                  },
                  {
                    "text": "Спитав Іван, відкриваючи мішок.",
                    "imageType": "cossacks"
                  },
                  {
                    "text": "— Німота, вони сиділи в кущах. Схоже на дозор в яру.",
                    "imageType": null
                  },
                  {
                    "text": "— Якщо у них зміна на ніч, то побачать тіла і сполошаться. Нам треба там стати й попередити Трохима. Якщо ж прийде зміна, то виграємо ще час.",
                    "imageType": null
                  },
                  {
                    "text": "Відповів Іван.",
                    "imageType": "bulrush"
                  },
                  {
                    "text": "Козаки підняли коней і повели їх в дозорний табір.",
                    "imageType": null
                  },
                  {
                    "text": "Він являв собою шалаш, поруч готували їжу. На ріку вели дві стежини.",
                    "imageType": null
                  },
                  {
                    "text": "Німці не очікували, що козаки так швидко повернуться з походу, то ніжились на сонці, не слідкуючи за степом і водою.",
                    "imageType": "forest"
                  },
                  {
                    "text": "— Ну Стець у тебе і ніс! Будеш Носенком!",
                    "imageType": null
                  },
                  {
                    "text": "Всі зареготали, Стець почав пручатися, але уже було пізно.",
                    "imageType": null
                  },
                  {
                    "text": "Іван виставив засідки на можливих шляхах проходу зміни дозорних. А сам вийшов на берег і сів в очереті.",
                    "imageType": null
                  },
                  {
                    "text": "Через деякий час на воді з‘явилися три острови очерету, які пливли проти течії.",
                    "imageType": null
                  },
                  {
                    "text": "— Пугу-пугу.",
                    "imageType": "boat"
                  },
                  {
                    "text": "Видав звук Іван.",
                    "imageType": null
                  },
                  {
                    "text": "— Пугу-пугу-пугу!",
                    "imageType": null
                  },
                  {
                    "text": "Відповіли з очерету.",
                    "imageType": null
                  },
                  {
                    "text": "Трохим пристав до берега. Іван швидко пояснив, що вони уже вирізали дозор, і що краще прямо зараз почати приступ, бо можуть почати бити на сполох.",
                    "imageType": null
                  },
                  {
                    "text": "Вони вирішили брати приступом прямо зараз. Всього у них було п'ятдесят козаків. За годину мав підійти Сулима з ще п‘ятьма сотнями вояків і гарматами.",
                    "imageType": "forest"
                  },
                  {
                    "text": "Трохим пішов далі трьома байдаками, щоб пристати прямо під валом і звідти вдертися у фортецю.",
                    "imageType": null
                  },
                  {
                    "text": "Іван залишив двох козаків чатувати на Сулиму. Інші познімали свитки, натягнули луки, розчохлили самопали.",
                    "imageType": null
                  },
                  {
                    "text": "Носенко розмотував мотузяні драбини.",
                    "imageType": null
                  },
                  {
                    "text": "На кінцях висіли залізні гаки. Їх можна було закинути на паркан і перелізти всередину. Такі самі драбини використовував ще Сагайдачний під час своїх кримських походів.",
                    "imageType": null
                  },
                  {
                    "text": "Козаки взяли драбини на плечі і тишком потяглися до валу.",
                    "imageType": null
                  },
                  {
                    "text": "Він був досить глибоким. На паркані не було вартових. З-за нього вітер доносив лише голоси.",
                    "imageType": "camp"
                  },
                  {
                    "text": "Для перестороги спочатку закинули лише одну драбину.",
                    "imageType": null
                  },
                  {
                    "text": "Стець видряпався на неї й зазирнув за паркан.",
                    "imageType": null
                  },
                  {
                    "text": "Група німців лежала на траві, інші уже збиралися у фортечку на вечерю.",
                    "imageType": null
                  },
                  {
                    "text": "Зброї ніде не було. Лише в одному місці стояли довжелезні списи. Німці обговорювали щось і гучно сміялися.",
                    "imageType": "camp"
                  },
                  {
                    "text": "На стіні фортеці Стець побачив п‘ять тіл, яких найманці задибили, а потім прибили до дощок.",
                    "imageType": null
                  },
                  {
                    "text": "Судячи з усього, це була закатована козацька сім‘я разом з трьома дітьми, які ішли Дніпром на Січ, але їх перехопили німці.",
                    "imageType": null
                  },
                  {
                    "text": "Регочучі німці кидали недоїдені яблука в закатованих. Коли хтось влучав в голову, то весь гурт розходився ще більшим реготом.",
                    "imageType": "cossacks"
                  },
                  {
                    "text": "Стець побачив, як над іншою стороною паркану визирає голова з оселедцем. Побачивши одне одного вони кивнули й почали спускатися.",
                    "imageType": null
                  },
                  {
                    "text": "Стець розповів все побачене курінним. Загін Івана як раз нападає зі степу, а за спинами козаків буде світити сідаюче сонце. Трохим же зайде з води, звідки найманці явно не очікують нападу.",
                    "imageType": null
                  },
                  {
                    "text": "Вгору злетіли десять драбин. Гаки ударили в паркан, міцно зачепившись.",
                    "imageType": "boat"
                  },
                  {
                    "text": "Німці нічого не чули, бо саме в цей момент рудобородий німець попав недогризок у вибите око п‘ятирічного закатованого хлопчика, і вся їх компанія почала плескати і свистіти від задоволення.",
                    "imageType": null
                  },
                  {
                    "text": "Козаки вилетіли на відпочиваючих німців як вітер. Рудобородого одразу підняли на ребрах вгору двома рогачами.",
                    "imageType": "cossacks"
                  },
                  {
                    "text": "Інших німців кололи прямо на землі. Списи встромляли у живіт, щоб потім побавиться з ледь живими полоненими.",
                    "imageType": null
                  },
                  {
                    "text": "Вся фортечка була розкрита, звідти почали вибігати роздягнені німці на чолі з їх капітаном — Жаном Моріоне.",
                    "imageType": null
                  },
                  {
                    "text": "Він вигукував накази й збирав біля себе мушкетерів.",
                    "imageType": null
                  },
                  {
                    "text": "Вони стали ладнати свої мушкети, але двадцять козацьких самопалів як грім упали прямо на їх групу.",
                    "imageType": null
                  },
                  {
                    "text": "Капітану пробило обидві ноги, інших німців скосило як траву: козацькі кулі трощили голови, виривали шматки грудей.",
                    "imageType": "bulrush"
                  },
                  {
                    "text": "Козаки дали ще десять залпів, постійно міняючи самопали на уже заряджені. Козацький танок самопалів не зупинявся!",
                    "imageType": null
                  },
                  {
                    "text": "Козаки Трохима уже вдерлися в саму фортецю. Там чинили опір і десяток німців закрився всередині.",
                    "imageType": null
                  },
                  {
                    "text": "Козаки захопили близько сотні німців у полон. Їм зв‘язали руки й поклали у рядок під парканом.",
                    "imageType": null
                  },
                  {
                    "text": "Іван побачив Стецька, який стояв на колінах напроти закатованої та прибитої до дощок сім‘ї.",
                    "imageType": "forest"
                  },
                  {
                    "text": "— Це моя сестра з чоловіком, хотіли оселиться до зими на нашій паланці...",
                    "imageType": null
                  },
                  {
                    "text": "Він витягнув широкий ніж і попрямував до полонених німців. Курінний схопив його за руку, але в з-за паркану донеслися страшні прокльони.",
                    "imageType": null
                  },
                  {
                    "text": "Два козаки забігли через ворота, їх вивернуло прямо на стежину. Внизу скелястого урвища лежали декілька десятків напіврозкладених тіл.",
                    "imageType": "forest"
                  },
                  {
                    "text": "Німці катували пійманих, а потім скидали вниз.",
                    "imageType": null
                  },
                  {
                    "text": "Розплату уже не можна було зупинити.",
                    "imageType": null
                  },
                  {
                    "text": "Всі п‘ятдесят козаків кинулися на зв‘язаних німців. Кожен катував уже як хотів, всі, навіть, забули, що ще є німці у фортеці.",
                    "imageType": null
                  },
                  {
                    "text": "Стецько перед тим, як вистромити язик німця через розрізане горло виколював очі. Іван щадив німця і просто душив шкіряним паском. Козаки Трохима піднімали ошалілих від страху німців на списи й на спір перекидали через паркан на інші списи.",
                    "imageType": "cossacks"
                  },
                  {
                    "text": "Стояв такий галас і мішанина мов, що Сулима, коли увійшов у фортецю не міг зрозуміти, що відбувається.",
                    "imageType": null
                  },
                  {
                    "text": "По землі текла ріка крові. З-за розстріляних мушкетерів живцем дістали Жана Моріоне. Підвели його під Сулиму.",
                    "imageType": "boat"
                  },
                  {
                    "text": "Закритих у фортеці німців підперли й підпалили вхід.",
                    "imageType": null
                  },
                  {
                    "text": "Усі навіть забули, що вони живі та ніхто не звертав на їх кашель.",
                    "imageType": null
                  },
                  {
                    "text": "Сім‘ю Стецькової сестри обережно зняли. Священник почав читати молитву. Поруч поклали скинутих зі скелі замордованих козаків.",
                    "imageType": null
                  },
                  {
                    "text": "Молитва зупинила цей кривавий розбрат.",
                    "imageType": "boat"
                  },
                  {
                    "text": "У вал поклали всі тіла.",
                    "imageType": null
                  },
                  {
                    "text": "Зверху кинули Жана Моріоне.",
                    "imageType": null
                  },
                  {
                    "text": "Він голосив і намагався вилізти з ями.",
                    "imageType": null
                  },
                  {
                    "text": "— Miserere mei possint redimi!",
                    "imageType": "forest"
                  },
                  {
                    "text": "— (Помилуй, мене викуплять!)",
                    "imageType": null
                  },
                  {
                    "text": "— В останній надії підняв він очі до Сулими.",
                    "imageType": null
                  },
                  {
                    "text": "— Et misericordiae Dei est, et restituet te excrucior!",
                    "imageType": null
                  },
                  {
                    "text": "— (Помилує Господь, а відкупиш гріх свій перед ними ти сам і цій могилі).",
                    "imageType": null
                  },
                  {
                    "text": "За десять хвилин рів було засипано. Закатовані сім‘ї нарешті знайшли спокій.",
                    "imageType": null
                  },
                  {
                    "text": "Тиха українська ніч на Кодаку минула.",
                    "imageType": "river"
                  }
                ]
              }
            }
          ],
          "nodes": [
            {
              "text": "Іван наказав сідлати двадцять коней.",
              "imageType": null
            },
            {
              "text": "Вирішено було виступати негайно, поки залога фортеці ще не взнала, про повернення козаків.",
              "imageType": "camp"
            },
            {
              "text": "Інша частина розвідки сіла на байдаки, які були всі обв‘язані очеретом і теж вирушила уверх по Дніпру.",
              "imageType": null
            },
            {
              "text": "Заздалегідь домовились про зустрічі у певних місцях, щоб корегувати свої дії.",
              "imageType": null
            },
            {
              "text": "Сулима ж залишився разом з основними силами, які викочували діжки з порохом і лаштувалися до виходу.",
              "imageType": null
            },
            {
              "text": "Іван ішов першим. По праву руку лежав Дніпро. Сонце уже світило у потилицю, а можливим дозорам — прямо в очі.",
              "imageType": null
            },
            {
              "text": "То ж все грало на руку козакам.",
              "imageType": null
            },
            {
              "text": "В одному з ярів козаки підійшли впритул до річки. Тут мали зустрітися з козаками Трохима.",
              "imageType": null
            },
            {
              "text": "Іван спішився, взяв з собою самопал і сів у кущах.",
              "imageType": null
            },
            {
              "text": "По під берегом показався великий плавучий острів з очеретом.",
              "imageType": null
            },
            {
              "text": "Таке явище дуже часте на Дніпрі, коли течія вириває шматки очерету і тягне їх за собою.",
              "imageType": null
            },
            {
              "text": "Але цей очерет був дивним, він ішов проти течії.",
              "imageType": "bulrush"
            },
            {
              "text": "— Пугу, пугу!",
              "imageType": null
            },
            {
              "text": "Зімітував сича Іван.",
              "imageType": null
            },
            {
              "text": "— Пугу-пугу-пугу.",
              "imageType": null
            },
            {
              "text": "Відповів сич прямо з очерету.",
              "imageType": null
            },
            {
              "text": "— Тут чисто, ставайте!",
              "imageType": null
            },
            {
              "text": "Сказав Іван і встав у весь зріст",
              "imageType": null
            },
            {
              "text": "Байдак Трохима підійшов ближче. З очерету вистрибнув козак і по пояс у воді вийшов на берег.",
              "imageType": "boat"
            },
            {
              "text": "— Я нікого тут не бачив, лише диких коней. Давай ідемо маршем прямо до фортеці. Під горою стаємо і зустрічаємося в Чорному яру.",
              "imageType": "boat"
            },
            {
              "text": "— Це де ми поклали двісті ногайців декілька років тому.",
              "imageType": null
            },
            {
              "text": "— Там гарна місцина, з Кодакової гори вона не проглядається.",
              "imageType": null
            },
            {
              "text": "— Сулима підійде під вечір, а ми як раз уже все розвідаємо.",
              "imageType": "boat"
            },
            {
              "text": "Байдак відійшов, Іван повернувся до коней і прискоривши коней повів загін на північ.",
              "imageType": null
            },
            {
              "text": "Козаки рухалися в складках місцевості, або ж ховаючись за лісками, або великими кущами.",
              "imageType": null
            },
            {
              "text": "З Кодака степ було видно як на долоні, але козаки знали ці рідні землі як свою зброю, тому знали як непомітно підійти.",
              "imageType": null
            },
            {
              "text": "На підході до Чорного яру новак Стець різко повернув голову в бік річки й підняв кулак вгору.",
              "imageType": "camp"
            },
            {
              "text": "Деякі козаки здивувались, чому новак так поводиться.",
              "imageType": null
            },
            {
              "text": "Стець тричі втягнув повні легені повітря через широкі ніздрі й сказав ледь чутно:",
              "imageType": null
            },
            {
              "text": "— Іване, на березі готують їжу. Трохим навряд чи б це робив.",
              "imageType": "bulrush"
            }
          ]
        }
      }
    ],
    "nodes": [
      {
        "text": "Кошове товариство під проводом гетьмана Івана Сулими саме повернулося до Січі. Невелика залога сповістила дивну новину: лях, скориставшись відсутністю козаків, звели фортецю.",
        "imageType": "cossacks"
      },
      {
        "text": "Після молитви в церкві за двома сотнями загинувшими козаками, Сулима зібрав раду.",
        "imageType": null
      },
      {
        "text": "Вирішено було негайно підготувати диверсійний похід з метою знищення фортеці і її залоги.",
        "imageType": null
      },
      {
        "text": "Січовики вирішили вийти двома шляхами. Половина військ мала іти кінно, а інша — Дніпром, до Кодацького порогу.",
        "imageType": null
      },
      {
        "text": "Сулима наказав взяти байдаки, оббити їх очеретом, щоб здалеку на воді їх не було помітно.",
        "imageType": "boat"
      },
      {
        "text": "Весь курінь Івана Гладкого визвався бути добровольцями для розвідування фортеці.",
        "imageType": null
      }
    ]
  },
  "year": 1635
}