{
  "title": "Останній",
  "description": "Пошесть викосила всіх козаків з нової слободи. Залишився лише один. Зробіть правильні вибори, щоб провести останнього до порятунку.",
  "authors": "Дмитро Гладкий",
  "root": {
    "endType": null,
    "next": [
      {
        "text": "Побігти за конем",
        "nextPage": {
          "endType": null,
          "next": [
            {
              "text": "Захистити коня",
              "nextPage": {
                "endType": "DEAD",
                "next": [],
                "nodes": [
                  {
                    "text": "Дмитро витягнув самопал з чохла, та поцілив одному вовку в живіт. Запах крові та конаючий вовк ще більше збудили вовків. Потім відкинув самопал та поліз зі списом рятувати коня. Він махав ним як дрючком. Кінь видохся і ледь вистачало сил, щоб копитами відбиватися від вовків. Це була марна битва. Хижаки знали, що кінь рано чи пізно упаде, тому просто продовжували шурхати на нього з усіх сторін.",
                    "imageType": null
                  },
                  {
                    "text": "Дмитро ж зрозумів свою помилку. Один проти півтори десятки вовків посеред лісу - це вірна смерть. Сірий вовк застрибнув коневі на шию та почав прокушувати її. Дмитро настромив його спис та скинув убік.",
                    "imageType": null
                  },
                  {
                    "text": "Але інший звір ухопився за деревко та різко смикнув списа на себе. Дмитро не втримав рівновагу та упав обличчям униз. Очі забило снігом, напомацки він шукав спис, як в цей момент обидві гомілки пронизала страшний біль. Двоє вовків прокусили йому литки, зламавши при цьому обидві кінцівки. Вовки миттєво відскочили.",
                    "imageType": null
                  },
                  {
                    "text": "Але свою справу уже зробили: він не міг встати, з ран текла кров. Обидві гомілки були зламані від укусу. Це був кінець.",
                    "imageType": null
                  },
                  {
                    "text": "Останнє, щоб бачив козак, це щелепа вовка, яка опустилась йому на шию.",
                    "imageType": null
                  },
                  {
                    "text": "Щось хруснуло.",
                    "imageType": null
                  },
                  {
                    "text": "І Дмитра не стало.",
                    "imageType": null
                  }
                ]
              }
            },
            {
              "text": "Втікти",
              "nextPage": {
                "endType": null,
                "next": [
                  {
                    "text": "Повернутися в курінь",
                    "nextPage": {
                      "endType": "ALIVE",
                      "next": [],
                      "nodes": [
                        {
                          "text": "Назад повертатися було б легше, є сліди та пробита дорога в снігу. Зваливши речі і зброю на плече швидко як міг пішов назад в курінь по своїх власних слідах.",
                          "imageType": null
                        },
                        {
                          "text": "Сонце вже сідало, а пройдено лише пів дороги назад. В снігу було важко іти, Дмитро почав шукати де стати на ніч, щоб вовки не оточили та був шанс відбитися.",
                          "imageType": null
                        },
                        {
                          "text": "В лісі, що стояв праворуч, лежало чимало сушняка, йому в голову спала думка: набрати якомога більше дров та розвести багаття навколо себе. Якщо дров вистачить до ранку, то це збільшить шанс на виживання.",
                          "imageType": "forest"
                        },
                        {
                          "text": "Скинувши речі, взявши в руки лише чекан, Дмитро заходився тягати повалені стовбури та гілки. Чеканом рубати було не реально, то він просто встромляв його в стовбур та тягнув дерево до своєї стоянки.",
                          "imageType": null
                        },
                        {
                          "text": "Дуже сухе дерево ламав під своєю вагою, використовуючи подвійну сосну як упор для ричага.",
                          "imageType": null
                        },
                        {
                          "text": "Тепло від багаття розморило тіло. Дмитро заснув. Під час сну снилося якесь жахіття, отаман встав неживим та почав рубати козаків, лише з пострілу з ожиги змогли відірвати йому голову та убити жмура. У Дмитра волосся стало дибки. Він відкрив очі. Багаття навколо нього дотлівало. Небо сіріло. Десь сонце ледь-ледь вставало з-за обрію. Холод проникав через боброву шапку та опанчу. Він перевернувся на інший бік,  в око впали якісь вогники. Від усвідомлення що це за вогники у нього похололо під шлунком.",
                          "imageType": "river"
                        },
                        {
                          "text": "Зграя вовків заходила з-за спини. То тут то там два вогники перебігали між деревами. Всього він нарахував понад десять вовків. Поспав би він на п'ять хвилин більше, то прокинувся б з вовком на шиї. Різко підвівся на ноги, скинувши опанчу на сніг. Часу зволікати уже не було. Похапцем набрав дров та почав підкидати їх в багаття. Нащо сподіватися тут він не знав, навколо нього нікого немає, ніхто не почує ні пострілів ні його криків. Але жага до життя не давала пропустити ці думки у свідомість. Він був останнім з ватаги та мав сповістити іншим що сталося.",
                          "imageType": null
                        },
                        {
                          "text": "Вовки уже не ховалися. Вони бігали колом навколо багаття,  вдаваючи напади, але через вогонь їх тваринний інстинкт не давав пройти. Вовк міг з легкістю перестрибнути багаття та застрибнути на Дмитра, але панічний страх перед вогнем змушував їх відступати. Пройшла година, вовки мінялися, одні уходили відпочивати, інші займали їх місце і постійно докучали останньому козаку. У його рухах не було паніки чи гарячки. Зі списом він обходив багаття та підкладав деревину там, де залишалися самі вуглі. Кількість гілок та стовбурів дедалі меншала.",
                          "imageType": null
                        },
                        {
                          "text": "Сонце уже стояло високо як для зими. Дмитро помітив, що вовки уже не мінялися. Вони розуміли, що він нікуди не дінеться, тому деякі з них просто лежали в десятці  кроків від багаття і грілися. Навіть їх погляд став меланхолічним, начебто вони просто гріються на сонці, і якщо козак вийде з-за кола вогню, то йому він буде до біса.",
                          "imageType": null
                        },
                        {
                          "text": "Дмитро підкинув останні гілки у багаття. Забив кулю у самопал та перевірив держак чекана та списа. Цей бій буде останнім і він у ньому не стане переможцем. Вовки почали знову пробувати пробратися через вогонь. То тут, то там хтось із них підбігав та миттєво відсахувався обпечений. Сморід спаленого хутра забив козаку ніс. Він навіть кинув вовкам залишки сушеного м'яса. У будь-якому разі вони з'їдять його. Було б це м'ясо у його шлунку чи ось так, кинутим на сніг.",
                          "imageType": null
                        },
                        {
                          "text": "У козака у голові став план: вицілити вожака зграї та застрелити його. Вовки часто одразу починають ділити владу і битися за вакантне місце. Це б навіть допомогли їм забути про нього на деякий час. Але як тільки він брав самопал у руки, всі вовки одразу тікали та визирали з-за дерев. Козак вдався до хитрощів: поклав спис і самопал на землю. А сам ходив по колу з чеканом, махаючи ним на постійно нападаючих вовків. А потім взяв спис і самопал в одну руку та продовжив з ним так ходити. Вовки не помітили цього і продовжували бігати навколо нього в десяти кроках. Вожак був значно більшим за інших вовків, та інколи придавлював до землі молодих вовків, які обпікалися об багаття.",
                          "imageType": "forest"
                        },
                        {
                          "text": "Дмитро просто підняв спис разом з самопалом, притис до плеча і вистрілив прямо під лопатку вовкові. Звір підскочив вгору на метр, упав на задні лапи, видав кривавий пузир із пащеки та упав без духу. Запах крові звів вовків з розуму. Замість того, щоб почати ділити владу, вони почали атакувати багаття і намагатися зубами рознести тліючи гілки. Дмитро ударив двом вовкам по морді, розсікши до крові голову. З усіх сторін чулося гарчання, козак ширявся то вліво то вправо, відлякуючи звірей від його багаття. Тут він вирішив забити ще одну кулю до самопала та забити вовка. Опустивши голову вниз, щоб намацати мішечок з кулями, він його там не побачив. Десь по дорозі, або під час збору дерева, він відв'язався...",
                          "imageType": null
                        },
                        {
                          "text": "Останній промінь надії зник разом з мішечком для куль. Відкинувши самопал, Дмитро взяв чекан в ліву руку, а в праву спис і продовжував відганяти вовків через багаття, яке ставало все слабкішим і слабкішим. Вовки відійшли трошки трохи далі, розуміючи, що треба просто почекати, коли згасне багаття і можна буде роздерти людину.",
                          "imageType": null
                        },
                        {
                          "text": "Пройшов деякий час, козак був знесилений, але остання надія ще жевріла в його душі. Не міг він так сконати посеред діброви під зубами вовків. Раптом йому спала думка: зрізати гудзики зі свитки та використати їх замість куль. Але як тільки він схопив самопал, вовки, нажахані зброєю, вмить опинилися біля уже зовсім згаслого багаття та почали атакувати. Дмитро кинув самопал та прийнявся відбиватися заново. Та тепер вовки перестрибували жар, але дезорієнтовані від болю були швидко відкинуті назад ударом списа чи чекана. Це була остання атака. Одному з вовків Дмитро розсік щелепу, вовк відскочив, але відчуття що от-от вони завалять свою жертву розіграла кров вовків до кип'ятку. То тут то там найхоробріший вовк чи вовчиця перестрибували залишки багаття і підходили до козака. Дмитро крутився як міг, але в цей раз все було марно. Зачепивши ще двох вовків він прихилився на одне коліно.",
                          "imageType": "forest"
                        },
                        {
                          "text": "Один з вовків стрибнув йому прямо в обличчя, але козак встиг підняти спис і настромив його прямо в живіт. Вовк вужем почав крутитися на землі, намагаючись витягти спис зубами. Під вагою вовка спис вислизнув з рук Дмитра і той упав обличчям вниз. Тут же на спину йому стрибнув вовк і замкнув щелепу на його потилиці.",
                          "imageType": null
                        },
                        {
                          "text": "Моторошний крик пролунав на весь ліс. Козак думав, що це остання секунда його життя, але вовк виявився поранений чеканом прямо по щелепі та замість того, щоб зубами прокусити череп, він лише подряпав потилицю.",
                          "imageType": null
                        },
                        {
                          "text": "Вовк цього скоріш за все і сам не очікував, тому звалився зі спини. Дмитро відчув страшний біль в ступні, де зімкнулися зуби іншого вовка. Не маючи сил перевернуться він опустив голову вниз і намагався віджатися від землі, щоб встати. Тут же на спину стрибнув інший вовк. Але сталося щось неймовірне.",
                          "imageType": null
                        },
                        {
                          "text": "З-за спини пролунали чотири постріли. Дмитро відчув передсмертну судому вовків, які тримали його за ноги. Кожна з куль прошивала лопатки вовкам. Пролунало ще два постріли. Зграя вовків кинулась врозтіч. Дмитро не міг зрозуміти, що відбувається. Ще секунду тому його дерли вовки, а тепер він чує постріли самопалів та бачить як заляпані кровью та обпечені вовки віддаляються від нього. ",
                          "imageType": null
                        },
                        {
                          "text": "Козак перевернувся на спину та одразу почав верещати та відповзати прямо у тліюче вугілля. На нього сунув померлий отаман. Обличчя його було зеленого кольору, з-заду нього ішло ще четверо козаків з його куреня. Дмитро заліз головою прямо у вугілля, почувся запах горілого сукна, але Дмитро від жаху намагався і далі повзти на спині якомога далі від упирів.",
                          "imageType": "cossacks"
                        },
                        {
                          "text": "Козаки підбігли до нього, взяли за пояс та відтягнули в центр стоянки. Дмитро знепритомнів.",
                          "imageType": null
                        },
                        {
                          "text": "Через декілька хвилин він отямився від різкого смороду рідини, яку йому заливали в рота. Він уже був роззутим, вогнище навколо нього палало сильніше, біля ніг поралися козаки, намагаючись накласти пов'язки на рани.",
                          "imageType": null
                        },
                        {
                          "text": "- То ви живі були?",
                          "imageType": null
                        },
                        {
                          "text": "Спитав Дмитро в отамана.",
                          "imageType": null
                        },
                        {
                          "text": "- Так, я бачив як ти стукав до нас в хату, але міг дивиться лише в стелю, тіло повністю було не моє. Лише під вечір ми змогли підвестися та відкрили двері. Побачили, що одного коня немає, а твій курінь порожній, вирішили іти по слідах з ранку.",
                          "imageType": null
                        },
                        {
                          "text": "- Під ранок почули постріл й чимдуж спрямували ослаблих коней в тому напрямку. Недалеко ти відійшов від слободи.",
                          "imageType": null
                        },
                        {
                          "text": "Відповів отаман.",
                          "imageType": null
                        },
                        {
                          "text": "- Потім побачили дим від багаття, вовчу лайку і зрозуміли, що на вас напала зграя. Як бачиш, тебе врятували.",
                          "imageType": null
                        },
                        {
                          "text": "Отаман посміхнувся. Окинув оком цей табір та спитав:",
                          "imageType": null
                        },
                        {
                          "text": "- А де інші?",
                          "imageType": null
                        },
                        {
                          "text": "- Інші?",
                          "imageType": null
                        },
                        {
                          "text": "Дмитро не міг зрозуміти, кого ще можна було врятувати посеред зими у лісі.",
                          "imageType": null
                        },
                        {
                          "text": "- Ну так, де Остап з Михайлом, у твоєму курені ми їх не знайшли.",
                          "imageType": null
                        },
                        {
                          "text": "Дмитро ледь пошепки видавив із себе перед тим, як знепритомніти ще раз:",
                          "imageType": null
                        },
                        {
                          "text": "- Я їх закопав...",
                          "imageType": null
                        }
                      ]
                    }
                  },
                  {
                    "text": "Піти до паланки",
                    "nextPage": {
                      "endType": "ALIVE",
                      "next": [],
                      "nodes": [
                        {
                          "text": "Повертатися до порожнього куреня була не найкраща ідея. То ж Дмитро зібрав зброю, взяв трошки їжі та чимдуж вирішив пройти ліс, а там ще один ривок через річку, і, якщо на те буде воля Божа, зможе дібратися до паланки з 20 куренів. Можливо, що його постріл почули козаки, та вишлють на допомогу. В цей час ніхто мисливством не займався, то ж стріляти могла людина лише у біді.",
                          "imageType": "forest"
                        },
                        {
                          "text": "Швидким кроком, як міг, продирався через сніг. Через сажень-два уже не чув звуки вовків, які билися за свою їжу. Набиті животи вовкам, можливо, дадуть йому більше часу на порятунок. Але де одна зграя, там і інша. Хоч козаки й зачистили ліс від хижаків, але вони, судячи з усього, мігрували з іншої території на порожню ділянку. ",
                          "imageType": null
                        },
                        {
                          "text": "Самопал сильно давив на плече, по відчуттю там уже була велика мозоля, та от-от могла лопнути. Дмитро перекинув його на інше плече. Дорога ще довга, треба бути готовим давати бій звіру. Він навіть почав думати, що краще б взяв два самопали, а не один. Але таку ношу він точно б не стерпів та завалився без сил посеред дороги.",
                          "imageType": null
                        },
                        {
                          "text": "Через декілька годин він вийшов з лісу. Сів під деревом, щоб перевести дух. Вийняв з-за поясу чекан. Знову закралися думки, навіщо тягнути стільки на собі. Перед ним розстилався степ. Десь на обрії темніла чорна смуга лісу. Це їх паланка. Ось вона, її уже видно. Він навіть, здавалося, міг розгледіти тоненькі ниточки диму з димарів. Цю місцевість він знав дуже добре. Треба було перейти через ріку, яка замерзла та замелась снігом, потім пів години ходу і він врятований. ",
                          "imageType": null
                        },
                        {
                          "text": "Пів години як для літа. А зараз стояла зима, він без сил після дивної хвороби, до того ж за три дні намело снігу і на хвості сиділи вовки. Відчувши, як смертельна втома наливається в ноги, він схопився, засунув чекан за петлю на поясі, підняв чохол з самопалом на плече і поплентався далі. ",
                          "imageType": null
                        },
                        {
                          "text": "Десь посеред степу проходила річка. Але снігу навалило стільки, що берегів не було видно. Де-не-де стирчав сухий очерет. Але берега завжди були болотяні, то чи це сама річка там проходить, чи просто шматочок болота -- Дмитро не знав. Раптом волосся на потилиці почало підійматися, не приємне відчуття не полишало козака навіть після того, як він перевдягнув шапку. Він озирнувся назад. Так, це були вони. Під самим лісом з'явилося з десяток вовків. Вони роздивлялись степ, принюхуючись. Потім всі разом стали наближатися до Дмитра.",
                          "imageType": "river"
                        },
                        {
                          "text": "Від страху у козака стисло легені, він ледь міг дихати. Під шлунок підійшов спазм і він ледь не знудив на сніг. Просто закрив очі та став повільно дихати, при цьому не зупиняючись ні на мить. Він не встигне. Це очевидно. Була б річка не замерзла, він би якось переплив її та врятувався. Але зараз весь степ являв собою територію вовків.",
                          "imageType": null
                        },
                        {
                          "text": "Тут на правому плечі він відчув як щось потекло вниз. Це лопнув його пухир, натертий ложем самопала. Чомусь він взяв найважчий піхотний з усіх можливих. Все складалося проти нього, може він не мав вийти живим з того куреня?",
                          "imageType": null
                        },
                        {
                          "text": "А що він може зробити одним пострілом? Вовки не дадуть йому шанс зарядити ще раз. Але йому спала думка: паланка може почути постріл, тоді треба протриматись просто пів години й точно прийде допомога. \"Моя хата з краю, першим ворога зустрічаю\", такий був девіз всіх січовиків. Якби не їх здатність миттєво виступати проти ворога, навіть коли ти один, то Запорозької Січі ніколи б і не було, не кажучи вже про те, що навіть сам Імператор Священної Римської Імперії, Порта та король польський постійно блюзнірствували перед ними, намагаючись залучитися підтримкою.",
                          "imageType": null
                        },
                        {
                          "text": "Дмитро став. Зняв з плеча самопал. Вийняв його з чохла. Прочистив від вологи полиця для пороху, насипав туди з натруски та вистріл в сторону паланки. Зима була морозна, звук добре розносився по степу, екрануючи від хмар та снігу.",
                          "imageType": "bulrush"
                        },
                        {
                          "text": "Вовки зупинилися, та вагалися бігти далі. Дмитро скинув самопал на землю, натруску, мішок з кулями та порохівницю. Взяв у руки спис з чеканом і чимдуж помчав. Через декілька хвилин до нього дійшов звук пострілу з Паланки.",
                          "imageType": null
                        },
                        {
                          "text": "- ПОЧУЛИ!",
                          "imageType": null
                        },
                        {
                          "text": "Закричав Дмитро. Вся втома і біль наче зникла. Сам святий спустився до нього і ніс його на плечах поверх снігу. Раптом під ногами він нічого не відчув і завалився в сніг. Це була річка. Він упав прямо в неї з крутого берега. Під ним загрозливо затріщав лід.",
                          "imageType": null
                        },
                        {
                          "text": "- Господи, ну тільки не тут.",
                          "imageType": null
                        },
                        {
                          "text": "Сказав він про себе та почав підводиться, рачки лізучи на інший берег. Уже було чутно вовчі голоси, ще декілька хвилин і йому грець. Ледь видряпався на іншу сторону річки. В голову спала дурна думка чеканом розбити лід, але вовки б змогли просто оббігти з боку. Все марно. Коли Дмитро був за сотню кроків від річки, троє самих сильних вовків вискочили на його берег. Це був кінець.",
                          "imageType": "river"
                        },
                        {
                          "text": "- Де ж мій лучок тугесенький, га?",
                          "imageType": null
                        },
                        {
                          "text": "В паніці закричав Дмитро. Він міг би з легкістю випустити з десяток стріл за хвилину, не давши вовкам шанс наблизитись. Козак оком помітив могилу, вирішив на неї залізти й битися з вовками, яким прийшлося б з низу нападати.",
                          "imageType": null
                        },
                        {
                          "text": "- Боже, дай мені ще пів години.",
                          "imageType": null
                        },
                        {
                          "text": "З безвихіддя глянув в сторону паланки. Від лісу, що оточував її, він побачив два десятки чорних цяток, що віддалялись від дерев і прямували прямо на нього. Дмитро розігрів пальці, заклав їх в рота і чимдуж засвистів.",
                          "imageType": null
                        },
                        {
                          "text": "- Я ТУТ!",
                          "imageType": null
                        },
                        {
                          "text": "Відповідь він отримав у вигляді трьох пострілів з мушкета. Це був його порятунок. Внизу могили вовки продиралися через глибокий сніг на гору. У них ще є шанс його задрати та розтягти. По такому снігу навіть коні повільно ходять, не кажучи вже про людей. Під самою вершиною вони стали брати його в кільце, сильно гарчачи та вишкіряючи зуби.",
                          "imageType": null
                        },
                        {
                          "text": "Це були степові вовки, не такі великі як інші, але дуже витривалі. Дмитро став тикати списом в пащеки, але цих звірів так просто не зачепиш. Головне щоб тебе не смикнули ззаду за ногу. Він скинув опанчу і став прикриватися нею як щитом. Один з вовків купився на це трюк і став тягти за сукно зубами. Дмитро різко смикнув на себе, а іншою рукою зверху ударив чеканом. Удар прийшовся між очима, череп миттєво лопнув і звідти бризнула кров з мізками. Інший вовк скористався моментом і зачепив Дмитра за ногу. Той скрикнув, але не упав, а перекинув широку опанчу і накрив нею вовка під ногами. І тільки тоді втратив рівновагу та упав сам.",
                          "imageType": null
                        },
                        {
                          "text": "Вовк заплутався в хутрі та намагався видряпатись. Дмитро став на коліна та зверху всією силою опустив спис. Удар прийшовся на спину вовкові. Той заскавучав і укусив козака за руку та тут же пустив дух. Зламана рука повисла як гілка, Дмитро закричав від болю і в цей момент він побачив, як третій вовк видряпався на верх і стрибнув йому на шию. Час сповільнився.",
                          "imageType": null
                        },
                        {
                          "text": "Він бачив, як вовк присідає для стрибка, як передні лапи відриваються від снігу, а задні ноги як пружина розкриваються і вовк всім тілом летить йому на голову з розкритою пащекою. Зліва від вовка Дмитро бачить стрілу, випущену січовиком, яка вигинаючись вліво-вправо з шипом пролітає і попадає прямо вовк в шию, миттєво убиваючи його.",
                          "imageType": null
                        },
                        {
                          "text": "Від удару вовка Дмитро упав на спину, біль в руці залила його свідомість і він ледь не відключився.",
                          "imageType": null
                        },
                        {
                          "text": "Дмитра врятували. Інші вовки не наважилися нападати на десяток козаків і почимчикували назад у степ.",
                          "imageType": null
                        },
                        {
                          "text": "Всього пораненого його на конях привезуть в слободу. Він розповість, що сталося з залогою за лісом.",
                          "imageType": null
                        },
                        {
                          "text": "А через три дні занедужає перший козак з паланки...",
                          "imageType": null
                        }
                      ]
                    }
                  }
                ],
                "nodes": [
                  {
                    "text": "Це був шанс на порятунок, поки вовки задеруть коня, він зможе утекти якмога далі від них.",
                    "imageType": null
                  },
                  {
                    "text": "Дмитро повернувся до місця, де валявся весь шмот, вивалений з саней. Взяв торбу з сушеним м'ясом, мішки з кулями. Більше уже не міг потягнути на собі.",
                    "imageType": "forest"
                  },
                  {
                    "text": "Підняв голову, сонце стояло в зеніті, ще була пара годин до сутінків, треба відірватися від зграї хоча б на день, з набитими шлунками вони не одразу вийдуть на нове полювання.",
                    "imageType": null
                  }
                ]
              }
            }
          ],
          "nodes": [
            {
              "text": "Дмитро взяв самопал на спину, в руки спис з чеканом і побіг за конем, гучно віддаючи йому команду зупинитися. Але кінь віддалявся все далі та далі. Втративши його з виду, Дмитро продовжив біг по сліду на неглибокому снігу.",
              "imageType": null
            },
            {
              "text": "Як раптом він почув іржання і звуки боротьби. Його серце похололо від жаху, що вовки повернулися. Вибігши з лісу, він побачив, як на його коня стрибають вовки, він був оточений з усіх сторін.",
              "imageType": null
            }
          ]
        }
      }
    ],
    "nodes": [
      {
        "text": "Промінь сонця освітив приміщення невеличкого куреня. Дмитро відкрив очі.",
        "imageType": "cossacks"
      },
      {
        "text": "Слабкість з рук та ніг відступила. Він поворушив руками. Вони уже слухались. Повільно вставши, він окинув оком приміщення. На лавах лежало двоє товаришів, очі яких дивилися в стелю. Він знав, що вони як день мертві. Він і сам був мерцем: не міг не встати, ні випити води. Дивна пошесть найшла на них, як тільки почалася зима.",
        "imageType": null
      },
      {
        "text": "Спочатку зліг отаман. За ним всі інші. Хвороба витягувала всі сили, люди не могли навіть їсти. Їх одразу вивертало. Від безсилля ти міг лише лежати і чекати на смерть. Через два дні уже всі сім козаків занедужали.",
        "imageType": null
      },
      {
        "text": "Дмитро був останнім, хто захворів. Ледь чвалаючи від куреня отамана він доклигав до свого і ліг на пол біля пічки. Через деякий час протопив її, сили взагалі зникли. Його двоє товаришів конали поруч на лавах. Але ніякої допомоги не можна було очікувати.",
        "imageType": "camp"
      },
      {
        "text": "Триденна хурделиця замела всі дороги. Та і їх слобода буда свіже зрізана, тому навряд чи хтось знав, що вони тут. Через день Дмитру стало легше. Він уже відчував кінцівки. Тепло в хаті майже зникло. Над обличчям його товаришів не підіймався пар з рота. Просто скляні очі націлені на стелю.",
        "imageType": null
      },
      {
        "text": "До повної тями його повернуло іржання коней з хліва. Треба було щось робити. Потихеньку він встав. Голова паморочилася, але з'явилось відчуття голоду. Закляклими руками він викресав вогонь і затопив заново піч.",
        "imageType": null
      },
      {
        "text": "В печі стояла холодна каша. Він вирішив її підігріти. Треба було взнати, чи живий ще отаман і чому не чутно ніяких звуків з їх куреня. Ще досі не вірячи в те, що він живий, Дмитро став читати молитву над двома небіжчиками. Потім взяв лопати та прямо посеред куреня викопав могилку.",
        "imageType": "cossacks"
      },
      {
        "text": "На вулиці стояв мороз, земля була геть промерзла, а довбати лід киркою у нього не було сил.",
        "imageType": null
      },
      {
        "text": "Через годину він засипав могилу, поїв та ліг на піч спати. Десь по обіді він знову прокинувся. На цей раз сил стало ще більше. Треба було взнати, чи є ще живі в сусідньому курені. Відкривши двері, він був одразу засліплений ясним сонцем. Через сніг по середину гомілки він дочвалав до куреня отамана.",
        "imageType": null
      },
      {
        "text": "Став відкривати двері, але вони були зачинені з середини. Дмитро довго грюкав у них. Ніхто не відповів.",
        "imageType": null
      },
      {
        "text": "Тож він зазирнув у віконце. Побачена картина жахнула його: на лавах лежало чотири трупи. Вони неначе спали, але Дмитро знав, що вони мерці.",
        "imageType": null
      },
      {
        "text": "Треба було ушиватися з цього місця. Зайшовши в хлів він побачив трьох коней, які тихенько стояли. В останній вечір, коли він міг ходити, Дмитро наклав їм вдосталь їжі та налив води в три корита.",
        "imageType": null
      },
      {
        "text": "З-за куреня дістав сані, запряг в них самого сильного коня, зібрав всю зброю, взяв їжі та вирушив назад до річки Кальміус.",
        "imageType": null
      },
      {
        "text": "Там була їх основна паланка. Треба було сповістити інших козаків, щоб допомогли поховати отамана та товаришів. Кінь весело тягнув сані по снігу. Частина дороги пролягала через ліси. Дмитро трошки почав кимарити на сонці, коли раптом він почув вовчий вий.",
        "imageType": "forest"
      },
      {
        "text": "Піднявши голову, він побачив, що кінь протягнув уже майже пів дороги до паланки. Але позаду них збилася вовча зграя, яка явно ішла по їх сліду.",
        "imageType": null
      },
      {
        "text": "Він дістав всі три самопали та забив кулі. Два самопали поклав в чохли назад, а свій лежав на колінах напоготові. Також під рукою був спис та чекан. Треба було ще протриматися пару годин й врятуватися. Кінь з жахом озирався назад, але продовжував тягти сани вперед. Коли раптом на них з-за дерев вилетіла група з вовків.",
        "imageType": null
      },
      {
        "text": "Це була вовча пастка. Дмитро та кінь думали, що вовки позаду, а насправді то був відволікаючий момент, основні сили зграї випередили коня та сховалися за поворотом дороги.",
        "imageType": null
      },
      {
        "text": "Дмитро не вагаючись вистрілив в самого великого вовка, чи то вовчицю. Часу розбиратись не було. Вовк підстрибнув на задніх лапах та упав мертвий.",
        "imageType": null
      },
      {
        "text": "Але кінь, нажаханий близькістю мисливців та гучним пострілом, різко рвонув у бік, сани зачепились за дерево і Дмитро разом з усім добром, яке він взяв з собою, випав прямо в кущі.",
        "imageType": "forest"
      },
      {
        "text": "Кінь, який тільки-но здихався важкої ноші, понісся ще швидше. Вовки, налякані пострілом і смертю свого товариша взагалі зникли десь в лісі, наче їх тут і не було.",
        "imageType": null
      },
      {
        "text": "Дмитро видряпався з кущів і побачив сани, що утікала з конем.",
        "imageType": null
      }
    ]
  },
  "year": 1574
}