{
  "title": "Переправа",
  "description": "Козак повертався з уходу, везучи на коні хутра. Рано вранці зібрав пожитки та вирушив назад до слободи. Але він не знав, що за його діями хтось слідкує. Хтось із лісу...",
  "authors": "Дмитро Гладкий",
  "root": {
    "endType": null,
    "next": [
      {
        "text": "Вихопити лук",
        "nextPage": {
          "endType": "DEAD",
          "next": [

          ],
          "nodes": [
            {
              "text": "Михайло різко вийняв лук і почав оббігати коня, щоб ним прикритися.",
              "imageType": "camp"
            },
            {
              "text": "В цей момент стріла увійшла під ліву лопатку, проткнула серце і козак упав неживий.",
              "imageType": null
            },
            {
              "text": "Кінь, який бачив багато чого за своє козацьке життя, стояв далі, нюхаючи кров, як витікала з-під забитого козака.",
              "imageType": null
            },
            {
              "text": "Через дві хвилини з лісу обережно вийшов чоловік.",
              "imageType": "bulrush"
            },
            {
              "text": "Лук був на готові. Він підійшов до трупа сів п'яти кроках і почав чекати. Через пару хвилин обережно вдарив тіло ногою. ",
              "imageType": null
            },
            {
              "text": "Потім взяв за ноги й відтягнув у кущі. Вийняв стрілу, обтер о свитку забитого, сів на коня і почимчикував на південь.",
              "imageType": null
            },
            {
              "text": "Михайла знайде роз'їзд через пару годин. Дивом, його не розтягнуть вовки. Будуть шукати убивцю, але все дарма.",
              "imageType": "cossacks"
            }
          ]
        }
      },
      {
        "text": "Відскочити вбік",
        "nextPage": {
          "endType": "ALIVE",
          "next": [

          ],
          "nodes": [
            {
              "text": "Часу возиться з луком не було і Михайло відскочив вліво, все ще намагаючись вихопити свою зброю.",
              "imageType": "forest"
            },
            {
              "text": "Стріла пройшла прямо повз ліве плече, розірвавши свитку і застрявши в ній.",
              "imageType": null
            },
            {
              "text": "Кінь відсахнувся і відбіг. При цьому з сумки вилетів ніж.",
              "imageType": null
            },
            {
              "text": "Михайло, побачивши, що ніж упав, зімітував, що смертельно поранений, захрипів, зробив три кроки й упав обличчя вниз, накривши ножа собою.",
              "imageType": "forest"
            },
            {
              "text": "На ліву щоку потекло щось солоне, все-таки стріла зачепила козака.",
              "imageType": null
            },
            {
              "text": "Але від адреналіну він не відчував болю.",
              "imageType": null
            },
            {
              "text": "Хто це міг бути? В голові думки ішли одна за іншою. З кримчаками мир, буджацькі так далеко не заходять.",
              "imageType": "forest"
            },
            {
              "text": "Адреналін потроху почав проходити. Михайло лежав нерухомо, повністю розслаблений.",
              "imageType": null
            },
            {
              "text": "Кров перестала іти. Але він знав, що за ним і далі дивляться.",
              "imageType": null
            },
            {
              "text": "Якщо поворухнеться, то його дострелять. Вибору не було, тікати і сховатися немає де.",
              "imageType": null
            },
            {
              "text": "Ледь-ледь було чути, як чиїсь постоли зачовгали по траві. Незнайомець підійшов ближче.",
              "imageType": "river"
            },
            {
              "text": "У Михайла від жаху мурахи пішли по всій спині, йому ввижалося, що спис от-от пригвоздить його до землі.",
              "imageType": null
            },
            {
              "text": "Пройшло ще декілька хвилин, Михайло, від нестачі адреналіну і поранення, почав впадати в транс.",
              "imageType": "forest"
            },
            {
              "text": "Він наче піднявся над собою і бачив все згори.",
              "imageType": null
            },
            {
              "text": "Позаду нього сидів з луком якийсь козак.",
              "imageType": null
            },
            {
              "text": "На спині була торбина, на боку висів сагайдак.",
              "imageType": null
            },
            {
              "text": "Нападник підійшов ближче і стусонув по Михайла нозі. Той навіть не ворухнувся.",
              "imageType": "boat"
            },
            {
              "text": "Михайло побачив, як убивця уже думаючи, що все покінчено, почав шмонати речі, які були на коні.",
              "imageType": null
            },
            {
              "text": "Свою торбину поклав поруч. Лук і стріли відклав. Сам взяв Михайла за ноги й почав тягнути в ліс, якомога далі від переправи.",
              "imageType": "river"
            },
            {
              "text": "Тут часто ходять козаки, якщо ж побачать труп, то будуть пошуки. А убивці не треба зайвий клопіт.",
              "imageType": null
            },
            {
              "text": "Раптом Михайло почав різко опускатися назад у своє тіло.",
              "imageType": null
            },
            {
              "text": "Різко зігнувши ноги, він насильно притягнув убивцю до себе.",
              "imageType": null
            },
            {
              "text": "Той з переляку лише ще сильніше стис ноги Михайла.",
              "imageType": "forest"
            },
            {
              "text": "Козак перекрутився на спину, ногами взяв в замок спину убивці, а лівою рукою обійняв за шию.",
              "imageType": null
            },
            {
              "text": "Ліву руку від поранення звело в судому, нападник не міг ніяк відштовхнути Михайла.",
              "imageType": null
            },
            {
              "text": "І в цей момент козак нарешті всунув ніж в горло убивці, і почав завдавати дуже швидкі удари.",
              "imageType": null
            },
            {
              "text": "Чужа кров почала сочитися, заливати очі та обличчя Михайлу. Але він продовжував завдавати удари в горло та обличчя.",
              "imageType": null
            },
            {
              "text": "Все було скінчено.",
              "imageType": null
            },
            {
              "text": "Насилу розігнув ліву руку, стріла все ще сиділа в плечі. Перевернув убивцю на спину і встромив ножа в око прямо по руків'я.",
              "imageType": "river"
            },
            {
              "text": "Три конвульсії ударили по тілу, і той помер.",
              "imageType": null
            },
            {
              "text": "Михайла вирвало кров'ю нападника, яку він наковтався, поки з ним возився.",
              "imageType": null
            },
            {
              "text": "Нарешті він розгледів зневічене обличчя. Це був Остап Щур. Його мали стратити за боягузтво ще місяць тому, але він втік з сараю.",
              "imageType": "river"
            },
            {
              "text": "Смертний вирок йому виписало товариство за те, що кинув пораненого товариша, повернувшись без нього. Його мали закопати живцем з небіжчиком, але вночі почалася пожежа і він утік.",
              "imageType": null
            },
            {
              "text": "Михайло пішов до річки, вийняв стрілу. Одразу промив рану і обмив все тіло. В очереті назбирав павутиння, змішав зі слиною і глибоко засунув в рану.",
              "imageType": "river"
            },
            {
              "text": "Це має допомогти, а ввечері він уже буде вдома.",
              "imageType": null
            },
            {
              "text": "Як доказ, Михайло відрізав голову Остапа і прив'язав її на бік коня.",
              "imageType": "river"
            },
            {
              "text": "Заліз на нього і пішов не поспішаючи на північ.",
              "imageType": null
            },
            {
              "text": "Напівдорозі його зустріне роз'їзд з рідної слободи, який упізнав козака.",
              "imageType": null
            },
            {
              "text": "Під вечір, Михайла, дуже втомленого і блідого, зустрінуть біля брами і одразу відведуть до лікаря. Голову убивці настромлять на частокіл.",
              "imageType": "camp"
            },
            {
              "text": "Після цього староста заборонить ходити на уходи по одному.",
              "imageType": null
            },
            {
              "text": "А голова убивці ще два місяці буде гарною мішенню для рогаток дітлахів.",
              "imageType": "camp"
            }
          ]
        }
      }
    ],
    "nodes": [
      {
        "text": "Михайло прокинувся рано вранці. День мав бути спекотним, а до слободи ще день дороги.",
        "imageType": "forest"
      },
      {
        "text": "Поївши холодного куліша, він відв'язав коня і вийшов з ним з ярочка.",
        "imageType": null
      },
      {
        "text": "Треба було напоїти коня, то ж, закинувши всі пожитки на нього, вони разом тихенько пішли до струмка.",
        "imageType": "bulrush"
      },
      {
        "text": "Комашня вмить налетіла на такий смачний сніданок у вигляді людини й коня.",
        "imageType": null
      },
      {
        "text": "Кінь мовчки бив хвостом і смикався всім тілом, не даючи сліпням присмоктатися.",
        "imageType": null
      },
      {
        "text": "Біля самої річки кінь зупинився і не давав себе далі вести.",
        "imageType": "river"
      },
      {
        "text": "Михайло насторожився. Навколо все було чисто, жодного сліду людей чи тварин.",
        "imageType": null
      },
      {
        "text": "Аж раптом, правим вухом він почув, як натягується лук. Це був ледь чутний звук. Він би й не помітив його, але з дитинства грав на подвір'ї діда, який майстрував козацькі луки. Цей звук він не міг ні з чим переплутати.",
        "imageType": "bulrush"
      },
      {
        "text": "Він ішов з лісу, з якого вони щойно вийшли.",
        "imageType": null
      },
      {
        "text": "Михайло, не вдаючи що щось помітив, почав поправляти паски на коні, а насправді розв'язав свого сагайдака.",
        "imageType": null
      },
      {
        "text": "З боку лісу він почув новий звук: хтось заклав стрілу і розтягував лук для пострілу.",
        "imageType": "forest"
      }
    ]
  },
  "year": 1550
}