{
  "title": "Вовча пастка",
  "description": "Група козаків потрапила в засідку. Одному з них вдалося врятуватися, але нападники вийшли на його слід. В цій історії вам доведеться провести козака додому скрізь небезпеки та можливу смерть.",
  "authors": "Дмитро Гладкий",
  "root": {
    "endType": null,
    "next": [
      {
        "text": "На коні",
        "nextPage": {
          "endType": null,
          "next": [
            {
              "text": "Продовжити тікати",
              "nextPage": {
                "endType": "DEAD",
                "next": [
                ],
                "nodes": [
                  {
                    "text": "Вершник з луком нарешті вклався і випустив стрілу. Вона пролетіла повз, але той уже набив руку й уже заклав наступну стрілу.",
                    "imageType": null
                  },
                  {
                    "text": "Раптом кінь Остапа оступився і вершник перелетів через його голову. Він почув, як хруснула ключиця, ліву руку пробив страшний біль.",
                    "imageType": "bulrush"
                  },
                  {
                    "text": "Ледь підвівши голову вгору, він підняв праву руку з шаблею. З пилу вискочив вершник.",
                    "imageType": null
                  },
                  {
                    "text": "Останнє, що побачив Остап, це короткий рогач, який був направлений прямо йому в груди.",
                    "imageType": null
                  },
                  {
                    "text": "Через два дні, коли зміна з чат не повернувся, з куреня вислали загін з трьох десятків козаків.",
                    "imageType": "cossacks"
                  },
                  {
                    "text": "Козаки підняли тривогу серед інших куренів, кожен видав десяток вершників для пошуку пропалих.",
                    "imageType": null
                  },
                  {
                    "text": "Банду виродків вислідили по слідах, які вони залишили при переслідуванні Остапа. ",
                    "imageType": null
                  },
                  {
                    "text": "Їх оточили в гаю й запропонували здатися.",
                    "imageType": "river"
                  },
                  {
                    "text": "Розбійники видали свого ватажка, думаючи таким чином врятуватися.",
                    "imageType": null
                  },
                  {
                    "text": "Козаки помилували лише двох зовсім молодих розбійників, яким не виповнилося й 15 років. Їх забрали на перевиховання.",
                    "imageType": null
                  },
                  {
                    "text": "Ватажка прив'язали до коней й розтягли степом. Всіх інших повісили над дорогою, де Остап знайшов всій останній бій.",
                    "imageType": "forest"
                  }
                ]
              }
            },
            {
              "text": "Розвернутися і піти в атаку",
              "nextPage": {
                "endType": "ALIVE",
                "next": [
                ],
                "nodes": [
                  {
                    "text": "Втрачати уже немає чого. Остап вирішив витягти останній шанс.",
                    "imageType": null
                  },
                  {
                    "text": "Стиснувши шаблю, Остап пригальмував коня, а потім різко зупинив його.",
                    "imageType": null
                  },
                  {
                    "text": "Розбійник з рогачем спрямував його прямо в спину Остапу, але той різко звісився на лівий бік, ставши майже паралельно землі, та з усієї сили махнув шаблею.",
                    "imageType": "bulrush"
                  },
                  {
                    "text": "Рогач проткнув повітря, де лише секунду тому був Остап.",
                    "imageType": null
                  },
                  {
                    "text": "Шабля розсікла весь правий бік нападника. З-під свитки кров фиркнули як з репнутого глечика.",
                    "imageType": null
                  },
                  {
                    "text": "Той упав з коня й прийнявся крутитися в агонії як вуж. Пилюка змішувалася з кров'ю, вершник заскулив й почав плакати, тихо конаючи від нестачі крові.",
                    "imageType": "cossacks"
                  },
                  {
                    "text": "Вершник з луком був взагалі не вдалим: він намагався зупинити коня, але перестарався й перелетів через його голову.",
                    "imageType": null
                  },
                  {
                    "text": "Остап дав команду коню вперед, через десять кроків порівнявся з нападником, який тільки встав, й розломив йому голову шаблею.",
                    "imageType": null
                  },
                  {
                    "text": "Мізки й око вивалилися через зрізаний череп, той сконав миттєво.",
                    "imageType": null
                  },
                  {
                    "text": "Остап пересів на свіжого коня, всю іншу зброю перевісив на двох інших і не поспішаючи пішов в сторону сусіднього городка.",
                    "imageType": null
                  },
                  {
                    "text": "Йому на зустріч вийшов загін з десяти козаків, які були підняти по тривозі, почувши постріл. Уже горіли дві сигнальні вежі, козаки мобілізували ресурси.",
                    "imageType": "bulrush"
                  },
                  {
                    "text": "Ввечері, на нараді курінних, було прийнято рішення знайти розбійників і покарати.",
                    "imageType": null
                  },
                  {
                    "text": "Уже в обід банду вислідити та оточили. Їм запропонували здатися.",
                    "imageType": null
                  },
                  {
                    "text": "Голота з радістю видала ватажків. Їх поховали живцем поруч з козаками з залоги. Інших же розвішали вздовж дороги, де Остап прийняв свій бій.",
                    "imageType": "forest"
                  },
                  {
                    "text": "Пожаліли лише кількох зовсім юних джур, які жадали пригод й приєдналися до банди, не знаючи, що вчиняють гріх. Їх взяли на поруки курінні.",
                    "imageType": null
                  }
                ]
              }
            }
          ],
          "nodes": [
            {
              "text": "Кінь, начебто, трошки оклигав. Остап пройшовся з ним пару хвилин та й додав трошки швидкості.",
              "imageType": "river"
            },
            {
              "text": "Дорога спускалась в балку, де було роздоріжжя на три сторони. Остап направив коня по лівій стороні, та як раз з правого рукава вискочило троє розбійників.",
              "imageType": "cossacks"
            },
            {
              "text": "Остап ударив коня й той з усіх ніг поніс його на гору. Але сили були уже не ті. Погоня швидко наздоганяла його. Озирнувшись, Остап побачив, як один з них розпускав аркан.",
              "imageType": null
            },
            {
              "text": "Остап дістав карабін, який він заздалегідь забив набоєм. Перехилившись через лівий бік, він розвернувся всім тілом, та, спіймавши ритм коня, поцілив нападника з арканом прямо в груди.",
              "imageType": "cossacks"
            },
            {
              "text": "Від удару кулі той завалився на правий бік, перехилився через правий бік й звалився з коня. Але права ступня застрягла в стремені і кінь продовжував далі його нести.",
              "imageType": null
            },
            {
              "text": "Інший розбійник намагався поцілити з лука, але мав слабку навичку стрілянини з ходу, тому ніяк не міг накласти стрілу.",
              "imageType": null
            },
            {
              "text": "\"Як жаль, що карабін один\", подумав Остап. Перезарядитися було вкрай важко, тому він вклав назад в чохол й дістав шаблю.",
              "imageType": null
            }
          ]
        }
      },
      {
        "text": "Пішки",
        "nextPage": {
          "endType": "ALIVE",
          "next": [
          ],
          "nodes": [
            {
              "text": "Кінь уже був дуже втомлений, міг упасти в будь-який момент. Тому Остап вирішив взяти всю зброю з водою й пробиратися ярами пішки.",
              "imageType": null
            },
            {
              "text": "Коня пустив дорогою, щоб збити з пантелику переслідувачів. А сам пішов вбрід струмком назад по дорозі. ",
              "imageType": "forest"
            },
            {
              "text": "Козаки називали цей тип засідки вовчий язик. Суть його була така: спочатку треба сильно відірватись від переслідувачів. Потім різко звернути з дороги і повернутися назад на триста-чотириста кроків.",
              "imageType": null
            },
            {
              "text": "В цьому місці, на височині, влаштувати засідку. Переслідувачі будуть читати сліди й слідувати за ними, а насправді їх жертва сидить в засідці просто в декількох десятках кроків.",
              "imageType": null
            },
            {
              "text": "Цю тактику йому розповів абшитований козак Ясь. Коли за ним була погоня, він тричі влаштував вовчий язик трьом різним загонам. Знищивши десять буджаків, він зміг добратися до свого куреня з доказом — десять голів!",
              "imageType": "camp"
            },
            {
              "text": "То ж Остап біжучи піднявся вверх по дорозі, але прийняв шлях через лісок.",
              "imageType": null
            },
            {
              "text": "Вибрав місце для засідки. Повалені дерева з кущами закривали огляд з дороги, а самі вершники були б як на долоні.",
              "imageType": null
            },
            {
              "text": "Остап розклав самопал й карабін. Поруч ще приставив лук зі стрілами.",
              "imageType": "forest"
            },
            {
              "text": "Не встиг він вмоститися, як на дорогу вилетіли три вершники.",
              "imageType": null
            },
            {
              "text": "Часу гаяти не можна було. Остап з самопала вцілив першому вершнику в праве стегно, в самий таз.",
              "imageType": null
            },
            {
              "text": "Пахова артерія репнула і звідти з шипом почала литися вода. Куля зрикошетила від тазової кістки й через сідло пробила коню хребет.",
              "imageType": "forest"
            },
            {
              "text": "Кінь, закляклий, одразу впав мертвим.",
              "imageType": null
            },
            {
              "text": "Остап кинув самопал й взявся за лук, тримаючи карабін як свій останній шанс.",
              "imageType": null
            },
            {
              "text": "Вершник, який слідував прямо за першим, не встиг змінити траєкторію і його кінь перечепився через них. Вони всі кубарем покотилися по дорозі.",
              "imageType": "forest"
            },
            {
              "text": "Розбійник намагався заткнути рану руками, але чорна кров лилася не зупиняючись, його час на цьому світі кінчався з кожною секундою.",
              "imageType": null
            },
            {
              "text": "Третій вершник отримав дві стріли в груди.",
              "imageType": null
            },
            {
              "text": "Остап схопив карабін й закинув його на спину, а сам з луком вискочив з кущів та побіг дивитися, що сталося з другим вершником.",
              "imageType": "cossacks"
            },
            {
              "text": "Його кінь, судячи з судом, які били все тіло, зламав собі шию. З-під нього ледь вибрався розбійник, ще живий, в руці він тримав рогач.",
              "imageType": null
            },
            {
              "text": "Остап оглянув місце сутички, все було скінчено. Стопа розбійника була вивернута назад під неприродним кутом.",
              "imageType": "bulrush"
            },
            {
              "text": "Часу розпит не було. Остап, економлячи стріли, зняв з плеча карабін та дострелив розбійника прямо в чоло.",
              "imageType": null
            },
            {
              "text": "Він зібрав зброю, підібрав третього коня, який досі носив труп свого колишнього власника. Обережно скинувши його, попередньо простромивши рогачем шию. Вершник був мертвим.",
              "imageType": null
            },
            {
              "text": "Сівши на нього, чимдуж помчав до наступного городка, який уже мав почути звук самопала.",
              "imageType": null
            },
            {
              "text": "Незабаром на нього вийшов загін з десяти козаків, які йшли на звук бою. Він швидко оповів про загибель застави та їхній останній бій.",
              "imageType": "forest"
            },
            {
              "text": "Ввечері, на курінній раді, було прийняте рішення знайти цю банду та покарати.",
              "imageType": null
            },
            {
              "text": "Козаки з сусідньої паланки об'єднали зусилля, прочісували весь ліс.",
              "imageType": null
            },
            {
              "text": "Незабаром, собаки знайшли слід та вивели чималий загін на табір бродяг. Їм запропонували здатися. Голота з радістю видала своїх ватажків, думаючи, що врятується цим.",
              "imageType": null
            },
            {
              "text": "Суд відбувся ввечері. Всій ватазі присудили смерть за загибель десяти козаків з залоги.",
              "imageType": "camp"
            },
            {
              "text": "Пожаліли лише декількох зовсім молодих козаків, яким не було ще і п'ятнадцяти років. Вони примкнули до ватаги, ще не зовсім розуміючи який гріх роблять.",
              "imageType": null
            },
            {
              "text": "Ватажків з перерізаними ногами поклали в одну могилу з забитими козаками. Всіх інших розвішали вздовж дороги, де Остап прийняв вдалий бій.",
              "imageType": null
            }
          ]
        }
      }
    ],
    "nodes": [
      {
        "text": "Остап обережно спустився з кручі до струмка і через стиснуті зуби жадібно хапав холодну воду.",
        "imageType": "river"
      },
      {
        "text": "Скоріш за все, він зміг трошки заплутати свої сліди і валка розбишак досі не змогла вийти на його слід.",
        "imageType": null
      },
      {
        "text": "Ще два дні тому він разом з чотирма товаришами вирушили на могили, щоб змінити чатових. Але, прибувши на місце, вони не побачили там нікого.",
        "imageType": null
      },
      {
        "text": "Натомість, прямо біля городка, який збудували для відбиття коротких атак, вони були атаковані з засідки якимись козаками.",
        "imageType": "camp"
      },
      {
        "text": "Сталася коротка сутичка, декількох нападників було вбито, але переважна кількість самопалів з того боку вирішила цей епізод життя на Великому Лугу не на користь Остапа.",
        "imageType": null
      },
      {
        "text": "Його товаришів було убито, а сам він, лежачи за забитим конем деякий час ще відстрілювався, але потім зміг ухопити коня забитого Саська і чимдуж чкурнув трохи далі від городка.",
        "imageType": "river"
      },
      {
        "text": "За ним не одразу пішла погоня. Схоже, що вони самі не очікували, що так швидко прийде зміна на могилу, тому коні було розпряжені і не готові до виходу.",
        "imageType": "cossacks"
      },
      {
        "text": "Остап мчав, глибоко нахилившись на коня, нагайкою розсікаючи боки коня до крові.",
        "imageType": null
      },
      {
        "text": "Через години такого форсованого маршу, кінь почав сповільнюватися і незабаром завалився на праву ногу.",
        "imageType": null
      },
      {
        "text": "Остап вирішив дати коню відпочити, а сам спустився до струмка.",
        "imageType": "river"
      },
      {
        "text": "До сусіднього городка було ще три години ходу, але кінь навряд чи донесе його. До того ж за ним явно іде погоня. Якщо він залишиться в живих і добереться до куріння, то розбійників чекає уже справжня бійка з великою силою козаків.",
        "imageType": null
      },
      {
        "text": "Ці розбишаки, скоріш за все, були виродками, яких вигнали з поселень або куренів. І вони, вештаючись по балках, об'єдналися в ватагу і почали грабувати та вбивати місцевих козаків.",
        "imageType": null
      },
      {
        "text": "Продовжити шлях пішки чи на коні?",
        "imageType": "river"
      }
    ]
  },
  "year": 1580
}