{
    "title": "Зустріч в степу",
    "description": "Черговий татарський наліт на прикордонні Канівські землі. Роз'їзд козаків на чолі з отаманом Іваном вирішив влаштувати засідку на татар, що відступали. Перемога буде за українцями, але якої ціною? Все залежить від ваших виборів під час проходження історії.",
    "authors": "Сава Теслюк",
    "root": {
        "endType": null,
        "next": [
            {
                "text": "Продовжити обстріл",
                "nextPage": {
                    "endType": null,
                    "next": [
                        {
                            "text": "Дострелити татарина",
                            "nextPage": {
                                "endType": "ALIVE",
                                "next": [],
                                "nodes": [
                                    {
                                        "text": "Іван заклав стрілу, але щоб дістати татарина, кінь якого перейняв паніку господаря, треба було підвестись вище.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Він зробив десять кроків вгору могилою, і в цей момент йому в долоню влучила стріла.",
                                        "imageType": "cossacks"
                                    },
                                    {
                                        "text": "Упавши, він зламав стрілу іншою рукою і витяг її за гострячок. Стріляти він уже не міг, тож схопив два списи і кинувся вниз.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Один з бранців хотів завалити татарина, але його кінь ударив копитом. Вершник повернувся і швидким ударом розсік ключицю бранця. Від удару голова бранця упала на розрубане плече.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Татарин уже не міг побачити, як ззаду до нього підбіг Іван і кинув списа.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Кидок був таким сильним, що вістря списа вийшло з грудей. Татарин з хрипом почав валитися на бік. Виряченими очима він дивився на гострячок списа, який стирчав у нього перед носом. Він поступово сповз з коня і упав уже мертвим.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Перевага стала за козаками. Татари почали тікати.",
                                        "imageType": "river"
                                    },
                                    {
                                        "text": "В цей момент піднялись козаки, які лежали з конями в траві справа.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Не очікувавши цього, татарські коні встали на дибки. Козаки накинули на них аркани й потягли по степу.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Ватага татарів була розбита. Двоє бранців загинули. Серед козаків було лише двоє поранених та загинув Сокіл.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Джалай лежав заарканений. На обличчі не було ніяких емоцій. Він розумів, що більше ніколи не побачить своїх рідних. Вони жили бідно і у них не буде грошей на викуп.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Наступного ранку козаки увійдуть в Канів. До них одразу ж підбіжать жиди і почнуть розглядати бранців.",
                                        "imageType": "forest"
                                    },
                                    {
                                        "text": "Іван отримає невелику винагороду від підстарости Канева і чимало грошей за бранців.",
                                        "imageType": "camp"
                                    },
                                    {
                                        "text": "Гроші розподілять між ватагою. Поранених козаків відправлять у Трахтемирів.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "На диво, Джалая і ще двох татарів обміняють на українців, яких захопив його більш вдалий брат.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Через двадцять років вони зустрінуться знову, але уже по одному боці,  під час розгрому карального загону ляхів під Жовтими Водами.",
                                        "imageType": "cossacks"
                                    }
                                ]
                            }
                        },
                        {
                            "text": "Обстріляти інших",
                            "nextPage": {
                                "endType": null,
                                "next": [
                                    {
                                        "text": "Дати бранцям вибір",
                                        "nextPage": {
                                            "endType": "ALIVE",
                                            "next": [],
                                            "nodes": [
                                                {
                                                    "text": "Іван вирішив віддати татарів колишнім бранцям.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Чоловіки миттю схопили аркани і понесли татарів степом. Через 10 хвилин повернулися з обдертими до кісток небіжчиками. Їхні тіла кинуть посеред степу.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Іван повантажив двох убитих на коней і вирушив до Канева. Треба було поховати загиблих.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Двоє безсімейних чоловіків попросились у ватагу, їхній хутір спалили і вони не мали куди повертатись.",
                                                    "imageType": "camp"
                                                },
                                                {
                                                    "text": "Козаки ішли під Чумацьким Шляхом. Вони чудово орієнтувалися вночі. На ранок вони дійдуть до фортечки. Жінки з дітьми почнуть голосити, побачивши тіла загиблих на конях. Врятовані бранці отримали свою свободу назад великою ціною.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Сокола поховають над Дніпром, він буде вічно видивлятися ворогів України у степу.",
                                                    "imageType": "river"
                                                }
                                            ]
                                        }
                                    },
                                    {
                                        "text": "Залишити татарів за собою",
                                        "nextPage": {
                                            "endType": "ALIVE",
                                            "next": [],
                                            "nodes": [
                                                {
                                                    "text": "Іван вирішив не гарячкувати і відділив бранців від татар.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Двоє чоловіків кидалися на татар, але це були живі гроші, які жиди з радістю заплатять.",
                                                    "imageType": "cossacks"
                                                },
                                                {
                                                    "text": "Ватага повантажила загиблих на коней. Трупи татарів ніхто не чіпав. Під Чумацьким шляхом вони повертались додому з рейду.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "На ранок вони дійдуть до замочка. Жінки почнуть голосити, побачивши своїх чоловіків, які загинули за свободу інших.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Татарів продадуть жидам, а гроші віддадуть родинам загиблих.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Звільнені бранці залишаться в Каневі. Їхні оселі спалено, повертатися нікуди. Дехто приєднається до ватаги Івана.",
                                                    "imageType": "river"
                                                },
                                                {
                                                    "text": "Сокола поховають на березі Дніпра, де через двісті років зведуть величезний курган для поховання іншого героя — Тараса. Вони вдвох будуть стежити за степом.",
                                                    "imageType": null
                                                }
                                            ]
                                        }
                                    }
                                ],
                                "nodes": [
                                    {
                                        "text": "Іван намагався влучити в інших, але вони постійно крутились. Одним з пострілів він влучив у стегно коня. ",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Ноги коня підкосились і кримчак перелетів через голову, зламавши собі  шию об землю. ",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Один з татарів підскочив до бранців і почав їх рубати шаблею.",
                                        "imageType": "forest"
                                    },
                                    {
                                        "text": "Сили були майже рівні, тож бранці могли перехилити чашу перемоги на бік українців.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Коли було зарубано другого бранця, всі інші зрозуміли, що ніщо їх не врятує. Вони всі разом кинулися на татарина.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Оскільки руки були зв’язані,  вони могли лише зіштовхнути коня. Один бранець з усієї сили ударив плечем в заднє стегно коня.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Кінь ударив обома копитами і скинув татарина. Двоє жінок накинулися на нього, не даючи йому встати.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Татарин втратив орієнтацію від падіння. Одна із жінок ударила його коліном в горло, коли той хотів встати. Вершник упав на спину, козачка застрибнула йому на груди й почала видавлювати очі пальцями.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Один з чоловіків уже звільнився, вихопив шаблю татарина і випустив йому тельбухи.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Вся ця бійня тривала не більше хвилини. Козаки втратили двох убитими. Двоє лежало на землі з розсіченими головами.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Трьох татарів привели на аркані до Івана.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Він побачив, що татари зарубали бранців.",
                                        "imageType": null
                                    }
                                ]
                            }
                        }
                    ],
                    "nodes": [
                        {
                            "text": "Козаки двома арканами завалили двох коней, один із татарів не встиг зіскочити і йому з хрумкотом переламало хребет під вагою тварини.",
                            "imageType": null
                        },
                        {
                            "text": "Татарські лучники поранили двох козаків, які кинулися на них зі списами.",
                            "imageType": null
                        },
                        {
                            "text": "Сили і досі були рівні, але Іван дістав ще двох вершників.",
                            "imageType": "cossacks"
                        },
                        {
                            "text": "Одна зі стріл відскочила від голови коня і зайшла татарину за щоку.",
                            "imageType": null
                        },
                        {
                            "text": "Він почав верещати та намагався витягти її.",
                            "imageType": null
                        }
                    ]
                }
            },
            {
                "text": "Спуститись на допомогу",
                "nextPage": {
                    "endType": "ALIVE",
                    "next": [],
                    "nodes": [
                        {
                            "text": "Взявши ще чотири стріли, він кинувся вниз.",
                            "imageType": null
                        },
                        {
                            "text": "Іван був найбільш умілим стрільцем у Каневі. Його учень, Сокіл, був другим.",
                            "imageType": null
                        },
                        {
                            "text": "Козаки і татари кружляли на конях, кожен намагався спіймати на аркан іншого.",
                            "imageType": "cossacks"
                        },
                        {
                            "text": "Одного з коней татарів вдалося стриножити, він завалився і скинув вершника.",
                            "imageType": null
                        },
                        {
                            "text": "На нього одразу ж накинулись бранці та забили ногами до смерті.",
                            "imageType": null
                        },
                        {
                            "text": "Інший татарин вирішив зарубати бранців, які почали звільняти одне одного.",
                            "imageType": null
                        },
                        {
                            "text": "Він устиг розсікти навпіл голову одному, але влучний постріл з лука пробив йому горло.",
                            "imageType": null
                        },
                        {
                            "text": "З розірваної жили почала виливатися кров. Перші п'ять секунд бив водограй, татарин схилився на голову коня.",
                            "imageType": null
                        },
                        {
                            "text": "Коню залило очі і він збожеволів. Його почало носити між бранцями, якщо він відчував під копитами тіла, то починав гарцювати по них.",
                            "imageType": null
                        },
                        {
                            "text": "Кінь встиг забити двох бранців, як підскочив Глухий на коні і жбурнув списа. Вістря увійшло під лопатку в серце.",
                            "imageType": null
                        },
                        {
                            "text": "Бранці забрали зброю убитих і приєднались до різанини.",
                            "imageType": "cossacks"
                        },
                        {
                            "text": "Їх оточили. Вони билися як скажені пси.",
                            "imageType": null
                        },
                        {
                            "text": "Іван не хотів більше втрат зі свого боку.",
                            "imageType": null
                        },
                        {
                            "text": "Він застрелив двох татарів, які відбивалися луком.",
                            "imageType": null
                        },
                        {
                            "text": "Інших заарканили та завалили на землю.",
                            "imageType": "cossacks"
                        },
                        {
                            "text": "Всі накинулись і почали їх бити. Двох татарів прив'язали за руки до коней. Їх хотіли розтягти живими.",
                            "imageType": null
                        },
                        {
                            "text": "В цю справу втрутився Іван. Він наказав припинити катування, але бранці його не слухались.",
                            "imageType": null
                        },
                        {
                            "text": "Глухий і Гладкий, двоє найвірніших козаків з його ватаги, ударили найгарячіших бранців плазами шабель у груди аби погасити свавілля в перші ж хвилини.",
                            "imageType": "cossacks"
                        },
                        {
                            "text": "Між українцями почалася колотнеча. Але в ці хвилини підійшли козаки, які дорізали татар, що втекли на конях .",
                            "imageType": null
                        },
                        {
                            "text": "Вони почали бити тупим кінцем шаблі по головах колишніх бранців, поки всіх не повалили на землю.",
                            "imageType": null
                        },
                        {
                            "text": "Жінки з дітьми з жахом в очах дивилися на все це. Вони боялись підійти до своїх звільнених чоловіків, бо могли отримати на горіхи.",
                            "imageType": null
                        },
                        {
                            "text": "Двох бранців, які почали бунт, прив'язали до коней і хотіли протягти степом. Жінки кинулися на коней і повисли на їхніх мордах, не даючи стратити своїх чоловіків. Вони хотіли зупинити екзекуцію.",
                            "imageType": "steppe"
                        },
                        {
                            "text": "Іван наказав припинити. Таким чином він зміг подавити розлад між своїми. Ніхто б по степу своїх не тягнув, але це неабияк застрашило звільнених бранців. І вони почали виконувати його накази.",
                            "imageType": null
                        },
                        {
                            "text": "Отаман підійшов до полонених татарів. Вони мали жалюгідний вигляд. Їх уже ніхто не врятує, а сім'ї не мають грошей, щоб викупити з неволі. У половини татарів обличчя розпухло від побоїв.",
                            "imageType": null
                        },
                        {
                            "text": "Їх продадуть жидам у Каневі. Вони закінчать своє життя або працюючи десь на господарстві в Литві, або, якщо поталанить, наймуться на службу до литовських татар.",
                            "imageType": null
                        },
                        {
                            "text": "Поранених татарів доріжуть. Всіх загиблих повантажать на коней і підуть серед ночі до Канева.",
                            "imageType": null
                        },
                        {
                            "text": "Іван буде вести коня із загиблим Соколом. Всі козаки з ватаги чудово орієнтуються по Чумацькому Шляху. Дорога буде мовчазна.",
                            "imageType": "forest"
                        },
                        {
                            "text": "На ранок вони увійдуть в канівські землі.",
                            "imageType": null
                        },
                        {
                            "text": "Загиблих бранців передадуть родинам.",
                            "imageType": null
                        },
                        {
                            "text": "В Каневі їх зустрінуть жиди, які уже отримали звістку про наліт татарів. Отримані гроші Іван розділить між своєю ватагою.",
                            "imageType": null
                        },
                        {
                            "text": "Четверо звільнених бранців попросяться в козаки.",
                            "imageType": null
                        },
                        {
                            "text": "Сокола поховають на новому кладовищі. Він назавжди залишиться спостерігати за українським степом.",
                            "imageType": "river"
                        }
                    ]
                }
            }
        ],
        "nodes": [
            {
                "text": "Сонце заходило за горизонт. Тримаючи його по праву руку швидко йшла невеличка колона татар.",
                "imageType": "forest"
            },
            {
                "text": "Вершники оточували дванадцять бранців, яких увели з козацьких земель.",
                "imageType": null
            },
            {
                "text": "Це був рейд малими силами на прикордонні села. Він був не дуже вдалим, майже всі встигли розбігтися, але дехто потрапив у полон.",
                "imageType": null
            },
            {
                "text": "Татари прямували до переправи на свій берег Дніпра. Там вони будуть у безпеці.",
                "imageType": null
            },
            {
                "text": "Воїни періодично залазили з ногами на коня і в повен зріст видивлялися, чи є якісь рухи в степу.",
                "imageType": null
            },
            {
                "text": "Татарів було дуже мало, бо рейд не мав підтримки Кримського хана, а був здійсненим ватажком прикордонних татарів, якому дозволялось турбувати козацькі землі.",
                "imageType": null
            },
            {
                "text": "Водночас, з півдня широкою лавою по степу на конях йшла шерега козаків.",
                "imageType": "steppe"
            },
            {
                "text": "Їхні чатові помітили рейд татарів. Він був не великий, тож вирішили спостерігати за ним. Незабаром втратили слід.",
                "imageType": null
            },
            {
                "text": "Вони намагалися знайти сліди походу до заходу сонця, бо вночі когось вполювати у степу буде важко.",
                "imageType": null
            },
            {
                "text": "Козак на прізвисько Сокіл заліз на прадавню могилу і став видивлятися степ. Він міг на відстані у пів степу назвати колір сукна на шапці.",
                "imageType": null
            },
            {
                "text": "Інші козаки часто глузували з нього і тикали дулі, або показували інші грубі жести, коли знали, що він сьогодні працює очима степу.",
                "imageType": "cossacks"
            },
            {
                "text": "Раптом Сокіл побачив дим з іншої фігури. Це означало, що на якесь село напала група.",
                "imageType": null
            },
            {
                "text": "Іван, голова заслону козаків, знав, що татарів мало і вони своїми силами можуть їх розігнати.",
                "imageType": null
            },
            {
                "text": "Кримчаки ніколи не воюють, якщо не мають перевагу в чисельності або у мобільності.",
                "imageType": null
            },
            {
                "text": "Козаки мали лише шаблі, луки і списи, тож могли доволі швидко пересуватися.",
                "imageType": null
            },
            {
                "text": "Іван гукнув козака на прізвисько Глухий. Той підійшов до нього.",
                "imageType": "cossacks"
            },
            {
                "text": "Він наказав послухати степ, чи чутно кінський тупіт.",
                "imageType": null
            },
            {
                "text": "Глухий відійшов на кількадесят кроків, розчистив траву і ліг на вухо. ",
                "imageType": null
            },
            {
                "text": "Інші завмерли. Через деякий час Глухий повернувся. Він почув тупіт, татари були десь недалеко.",
                "imageType": null
            },
            {
                "text": "Іван вирішив виставити заслін цій групі. Одна з фігур палала, це означало, що татари вчинили наскок і могли повертатися з бранцями.",
                "imageType": null
            },
            {
                "text": "Татари потерпали від напасті сарани, яка другий рік прилітала з Азова. Тому вони вимушені були всупереч забороні хана ходити в Україну, щоб забрати бранців і продати їх.",
                "imageType": null
            },
            {
                "text": "Іванів заслін вважався найкращим у землях біля Канева, бо він постійно передбачував напади татарів і керував загонами у степу.",
                "imageType": "camp"
            },
            {
                "text": "Одного разу вони пролежали разом з кіньми в густій степовій траві троє діб.",
                "imageType": null
            },
            {
                "text": "Татари не бачили пом'ятої трави та безпечно поверталися з рейду. Але козаки миттю підняли коней, дехто навіть просто застрибнув на татар, що нічого не очікували.",
                "imageType": null
            },
            {
                "text": "Щоб зламати волю до опору, козаки одразу убивали кількох татар, і поки інші не оговтались ловили їх на аркан.",
                "imageType": null
            },
            {
                "text": "Спійманих татарів потім продавали жидам, або укладати договір, щоб обміняти своїх родичів, якщо вони ще в Криму.",
                "imageType": null
            },
            {
                "text": "Такий же план був у Івана в голові й тут. Сокіл, лежачи на могилі, побачив татар. Вони вирішили обійти пагорб справа.",
                "imageType": null
            },
            {
                "text": "Іван з Соколом лягли на могилу і почали натягувати луки. Інші козаки лягли на конях з флангу, третя група зі списами залегла прямо на шляху.",
                "imageType": "cossacks"
            },
            {
                "text": "Татари не могли бачити приготування козаків, адже їх закривала скіфська могила.",
                "imageType": null
            },
            {
                "text": "Коли до могили залишилося 300 кроків, кінь Джалая, отамана татар, різко повів головою вправо. Для татарина це був поганий знак. Він сповільнив ватагу і татари миттю натягли луки.",
                "imageType": null
            },
            {
                "text": "Ліва рука отамана почала сушити. В дитинстві він отримав кулю від козака і тепер, коли мав погані передчуття, вона завжди нагадувала йому про себе.",
                "imageType": null
            },
            {
                "text": "Він був упевнений, що їх ніхто не помітив, а кінь міг злякатися зайців, яких тут було безліч, адже вони всі втекли з півдня від сарани.",
                "imageType": null
            },
            {
                "text": "Руку відпустило, він наказав іти далі. Але луки тримали наготові.",
                "imageType": "bulrush"
            },
            {
                "text": "Іван з Соколом уже не бачили цих приготувань татар, бо чекали з іншого боку і боялися, що татари помітять їх на могилі.",
                "imageType": null
            },
            {
                "text": "Він із Соколом мали вистрілити з луків і цим дати команду пішим і кінним напасти на групу.",
                "imageType": null
            },
            {
                "text": "Стріла лежала на тятиві, Іван побачив, як татари наблизились.",
                "imageType": null
            },
            {
                "text": "Вони вдвох різко випрямились і вистрілили з луків.",
                "imageType": null
            },
            {
                "text": "На диво, татари були готові та майже одночасно вистрілили у відповідь.",
                "imageType": "forest"
            },
            {
                "text": "Сокіл упав на землю, з його лівого ока стирчала стріла. Ноги почало бити в конвульсіях. Через судому на обличчі він майже відкусив собі нижню губу.",
                "imageType": null
            },
            {
                "text": "Жодна з емоцій не промайнула в голові отамана. Сокіл був уже не жилець, а бій ще треба було виграти. Він закладав стрілу одна за іншою.",
                "imageType": null
            },
            {
                "text": "Два татарина упало з першими пострілами, які вони встигли зробити.",
                "imageType": null
            },
            {
                "text": "Внизу почалася рукопашна січа.",
                "imageType": "forest"
            }
        ]
    },
    "year": 1628
}