{
    "title": "Хотинська Різня",
    "description": "Під час стояння під Хотином, козацьке військо здійснило унікальний для XVII століття нічний рейд. Було зруйновано декілька гармат та вирізано їх обслугу. В цій історії у вас буде багато важливих виборів, і не всі вони будуть очевидні...",
    "authors": "Сава Теслюк",
    "root": {
        "endType": null,
        "next": [
            {
                "text": "Взяти шаблю",
                "nextPage": {
                    "endType": null,
                    "next": [
                        {
                            "text": "Піти першим",
                            "nextPage": {
                                "endType": null,
                                "next": [
                                    {
                                        "text": "Допомогти курінному",
                                        "nextPage": {
                                            "endType": "DEAD",
                                            "next": [],
                                            "nodes": [
                                                {
                                                    "text": "Він підбіг до курінного і затис рану на голові.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Зі сторони турків Дмитро побачив яскраві спалахи. Вони з курінним були гарно підсвічені ззаду палаючим табором і являли собою чудову мішень. Одна з куль розтрощила куріному голову.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Уламки кулі і черепу увійшли в стегно і звідти з шипінням почала витікати кров.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Він затис уже свою рану, але потік не вщухав. Дмитро покликав на допомогу, його хтось взяв під руки і потягнув. Останнє, що він побачив перед смертю - це зоряне небо і річку, через яку його пораненого намагалися переправити козаки. Поруч на плотику лежав курінний.",
                                                    "imageType": "boat"
                                                }
                                            ]
                                        }
                                    },
                                    {
                                        "text": "Напасти на групу біля офіцера",
                                        "nextPage": {
                                            "endType": "ALIVE",
                                            "next": [],
                                            "nodes": [
                                                {
                                                    "text": "Дмитро, пригнувшись, ладнав самопал. Турки зробили залп в сторону палаючого табору.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Він побачив, як одна із куль влучила в шию курінному. Він упав мертвий.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Лють переповнила козаків. Не чекаючи, коли турки переладнають самопали, вони напали на них зі списами і шаблями.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "У Дмитра самопал був готовий до пострілу, він цілився в офіцера, але його охоронець взяв кулю на себе.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Турки покидали самопали і взялися за списи. Козаки не змогли наскоком їх розкидати.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Патову ситуацію вирішили дві гранати, які хтось із козаків пожбурив прямо в натовп турків.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Один з турків ліг на гранату, щоб врятувати інших. Вибухом йому відірвало руку.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Інша граната розірвалася в юрбі, розчистила шлях козакам.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Вчотирьох вони кинулися в шпарину і почали колоти турків в боки.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Дмитро схопив офіцера за жупан та хотів повалити, але його ноги заплутались в тельбухах пораненого, що конав на землі.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Дмитро упав і в руках у нього залишився лише капелюх, який зазвичай носили старші офіцери.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Дмитро ударив його шаблею по нозі. Офіцер підкосився, але встояв і його миттю підхопила охорона.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Козаків відтіснили прибулі на підмогу турки. Їх ставало все більше, то ж треба було відступати.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Козаки відійшли за табір, в сторону річки. Турки, шоковані таким розгромом боялися заходити в табір.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Частина козаків стріляла в сторону турків, в цей час інші займалися збором трофеїв.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Дмитро підібрав ще мішок з кулями і вирушив до плотів.",
                                                    "imageType": "river"
                                                },
                                                {
                                                    "text": "Дехто з козаків переправлявся назад на конях, яких вони змогли десь спіймати.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Останній плот відійшов від берегу. Пожежа повністю відрізала козаків від турків.",
                                                    "imageType": null
                                                },
                                                {
                                                    "text": "Дмитро сидів з коштовним трофеєм. Поруч на плоту лежав курінний.",
                                                    "imageType": "river"
                                                }
                                            ]
                                        }
                                    }
                                ],
                                "nodes": [
                                    {
                                        "text": "Дмитро попросив курінного відіслати його в першій групі ",
                                        "imageType": "river"
                                    },
                                    {
                                        "text": "Отримавши згоду, він приєднався до розвідників, які уже почали роздягатися і складати речі в зав'язані штани.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Перехрестившись, всі зайшли в воду і у повній тиші почали перепливати річку.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Група з Дмитром отримала задачу знешкодити караули на березі. ",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Разом з іншими трьома козаками Дмитро видерся на берег. Швидко всі вдягнулися, адже уже була осінь і вночі було досить холодно.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Пригнувшись майже до самої землі, вони почали просуватися далі на берег. Було чутно голоси людей, які нібито відпочивали біля багаття.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Судячи з усього, ніхто з турків не чекав на гостей, а татари відбули в свій табір, оскільки вночі на конях робити немає чого.",
                                        "imageType": "camp"
                                    },
                                    {
                                        "text": "Пробравшись ближче до звуків, козаки розгледіли підсвітлені кущі. Турки затулили опанчею багаття з тієї сторони , яка дивилась в сторону річки. Таким чином вони хотіли сховати свою присутність.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Але їх видавали голоси та розсіяні крізь зарості позаду язики світла.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Козаки оминули караул і почали підкрадатися з іншої сторони, адже вночі майже нічого не видно навкруги, якщо сидиш біля багаття.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Біля вогнища сиділо троє. Кожен козак вибрав собі ціль зліва на право, хто як підповз.",
                                        "imageType": "camp"
                                    },
                                    {
                                        "text": "Всі дивилися на голову групи, який жестом руки тричі подав сигнал. Всі кинулись на турченят.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Дмитро вдарив прямо в обличчя турку, який повернувся на звук. Сила удару була така, що зброя розтрощила зуби і хрустко вийшла через потилицю.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Піднявший голову, Дмитро побачив другого турка, який тримав древко рогатини, яке стирчало у нього з живота.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Козак намагався струсити ще живого турка зі списа, але він застряг в задніх ребрах.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Дмитро витягнув свою шаблю з горла турка і трьома ударами зняв голову іншому.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "З усіх інших сторін, де козаки вирізали караули, було чутно шурхіт, але ніхто не встиг підняти галас.",
                                        "imageType": "bulrush"
                                    },
                                    {
                                        "text": "Дмитро взяв поліно, яке горіло в багатті, спустився до берега і почав ним вимахувати різні фігури.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Так само зробили і в двох інших групах. Шлях до табору був вільним.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Він вибіг назад до багаття, зверху накинув жупан турка, щоб збити з пантелику охорону табору.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "На землі лежали два самопали, Дмитро взяв один із них.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "В цей же час козаків ставало все більше, вони загасили багаття. Дмитро подивився останній раз на мертвих турків, один із них конав і намагався щось сказати.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Всі три групи широкою лавою побігли в сторону табору.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Біля берега залишили лише десяток молодих, які мали охороняти невеличкі плотики. На них можна було врятувати поранених козаків.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "В таборі турків здійнявся галас. Вони уже могли помітити, що караули стихли, а замість цього стало чути тупіт чобіт.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Дмитра з самопалом пропустили першим. Поруч з ним ішли інші передягнені в турецьке вбрання козаки.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Їх окликнули з табору, але швидко заспокоїлись, так як здалеку їх не можна було відрізнити від турка.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Коли до вартових можна було уже докинути камінь, козаки вистрілили з самопалів, убивши вартових і з криком \"Ала ала\" кинулися в табір.",
                                        "imageType": "camp"
                                    },
                                    {
                                        "text": "Татарський клич спантеличив інших турків. Вони подумали, що татари помились і напали на них.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Всі ці козацькі хитрощі докупи зіграли дуже вдало. Увірвавшись в табір козаки почали колоти і сікти всіх.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Дмитро негайно скинув турецький жупан, щоб його не зарізали свої.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Головною ціллю були гармати. Козаки забили цвяхи в запальні отвори, поскидали гармати з лафетів. Інші козаки забрали порох і побігли назад до річки.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Турки досі не оговтались. Частина їх табору, на який стався напад, почала панічно утікати, не чинячи ніякого опору.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Перших утікачів взяли на списи турки, які прибігли на допомогу з дальнього табору.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "В цей момент Дмитро з п'ятьма іншими козаками почали стріляти по підмозі і в спину утікачам.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Раптом вони побачили багато одягненого офіцера, який був оточений охороною. Навколо нього почала організовуватись оборона.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Нападати на них з шаблею було самогубство, тому козаки почали ладнати самопали, які були розкидані по всьому табору.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "В цей же час у козаків почали з'являтися перші поранені. Турки збігались до офіцера і почали вести безладний обстріл козаків з самопалів.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Дмитро побачив, як з землі намагався встати його курінний. Вся голова і обличчя було залите кров'ю. Зі скроні справа звисав шмат шкіри.",
                                        "imageType": null
                                    }
                                ]
                            }
                        },
                        {
                            "text": "Чекати на сигнал",
                            "nextPage": {
                                "endType": "ALIVE",
                                "next": [],
                                "nodes": [
                                    {
                                        "text": "Дмитро залишився поруч з курінним.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Перші групи переправились на інший берег, через декілька хвилин всі побачили умовний сигнал і плотики рушили до них.",
                                        "imageType": "river"
                                    },
                                    {
                                        "text": "На іншому березі Дмитро побачив, як на землі ще конали караульні. Нікому не будо до них діла, їх горлянки були перерізані і вони не могли кричати.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Їх група вишикувалась і пішла в декількох десятках кроків позаду від перевдягнених в турецьке козаків.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "З першими пострілами чатові біля табору попадали, і вся юрба з криками \"Ала, ала\" кинулись в табір.",
                                        "imageType": "camp"
                                    },
                                    {
                                        "text": "Цим татарським кличем вони ще більше збили з пантелику турків у таборі",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Дмитро забіг в намет. Там уже підводились на ноги перелякані турченята. Двома ударами по голові він убив першого турка.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Інший закляк від страху і обдзюрився. Дмитро колючим ударом в живіт повалив його на землю. Ще двічі ударив в шию.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Він оглянув скрині. Схоже, що цей намет слугував для зберігання пороху.",
                                        "imageType": "camp"
                                    },
                                    {
                                        "text": "Дмитро вискочив на вулицю як раз вчасно. До нього підбігли козаки, щоб запалити намет.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Разом з цими козаками і куріним він прийнявся тягати скрині до берегу.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Тих турків, які конали на землі добивали списами. З двох офіцерів, багато вдягнених, зняли голови в якості трофеїв.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Перенісши 6 скринь, козаки підібрали самопали, що валялися просто неба та поспішили за межі табору, де уже підходила підмога до турків.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Вони сховалися в чагарнику та почали ладнати зброю. Усього кожен забив по три-чотири самопали.",
                                        "imageType": "bulrush"
                                    },
                                    {
                                        "text": "Вибране місце засідки було надзвичайно вдалим. Турки бігли до табору, і не очікували, що з ліва може ще хтось бути крім них.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Першими трьома залпами козаки повністю розсіяли першу підмогу. Оголивши шаблі, вони кинулися колоти в спину тікаючих турків, що уцілили від перших залпів.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Один турок, з простріленими грудьми, намагався встати. Дмитро одним ударом шаблі зрізав йому половину черепа.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Паруючий мозок випав на тельбухи іншого турка, який намагався кудись лізти.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Інший козак наскрізь простромив йому груди.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Побачивши цей розгром друга група підмоги взялася утікати, не прийнявши бій.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Дмитро з іншими швидко почав нишпорити по ще теплих убитих. Вони забивали торби кулями, порохом. ",
                                        "imageType": "cossacks"
                                    },
                                    {
                                        "text": "Коштовності дозволено було забирати лише зі своїх убитих ворогів.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "На руці турка, якому Дмитро вивалив мозок на тельбухи іншого турка, було аж три золотих кільця.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Він все ніяк не міг зняти їх, а гуркіт зі сторони турків ставав все ближче, це могла бути ще одна група.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Щоб не мучиться, він шаблею відрубав усю руку і кинув в свій мішок до куль.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Прозвучала команда до гуртування. Козаки похапали самопали, якими вони вибили першу підмогу, і повернулись в табір.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "З іншої сторони табору вони побачили досить велику групу турків, що уже організовано чинили опір. Нею командував турок з вишуканим тюрбаном на голові.",
                                        "imageType": "boat"
                                    },
                                    {
                                        "text": "Деякі з козаків не могли втамувати гарячу кров і почали відрізати вуха убитим. Деяким пораненим, ще живим, повільно відрізали голови.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Це була помста за закатованих полонених козаків після поразки під Цецорою.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "В одному з наметів взяли живими п'ятьох турків. У них знайшли висушені скальпи з чубами.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Від такої страшної знахідки козаки збожеволіли. Вони почали зрізати вуха, колоти очі всім туркам, ще живим або просто теплим.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Курінні отамани намагалися вгамувати козаків, адже турки були поруч і різанина могла закінчитися не на користь відчайдухів, яких було зовсім мало.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Деяких не могли заспокоїти, то ж їх почали бити п'ятою шаблі по голові, щоб хоч якось збити кривавий угар. Трьох довелося зв'язати.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Ті турки, в наметі яких знайшли скальпи козаків, лежали зв'язані. Сльози та шмарклі були розмазані по їх обличчах. Вони скиглилии. Один навіть наклав у штани, а у іншого почався епілептичний припадок.",
                                        "imageType": "camp"
                                    },
                                    {
                                        "text": "Він бився на землі, з рота понесло піну.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Дмитро накинув йому зашморг на шию і турок задавився.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Інший турок почав благати задавити і його, але Дмитро навіть не глянув на нього.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Їх повантажили на плоти і відправили на інший берег, разом з усіма трофеями.",
                                        "imageType": "river"
                                    },
                                    {
                                        "text": "Дмитро залишився в групі прикриття, яка просто так обстрілювала навмання палаючий табір, щоб створити видимість присутності великої кількості козаків.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Через десять хвилин він з іншими козаками відштовхнув човни, і поплив на свій берег. Дмитра почало трусити.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Десь поруч ішов човен з полоненими. Завтра з них живими на виду у турків здеруть шкури. Знайдені останки козаків з-під Цецори поховають по обряду.",
                                        "imageType": "boat"
                                    }
                                ]
                            }
                        }
                    ],
                    "nodes": [
                        {
                            "text": "Шабля була зроблена ковалем з Канева на замовлення і легко лежала у руці.",
                            "imageType": "camp"
                        },
                        {
                            "text": "Незабаром, темрява заполонила всю долину, обслуга турецьких гармат сідала вечерять. Чергові займалися чисткою гармати. За сьогодні вони випустили 12 снарядів, один з яких покалічив коня.",
                            "imageType": null
                        },
                        {
                            "text": "До Дмитра підійшов курінний і знаком наказав іти за ним. Майже всі козаки уже спали, лише чатові стояли на валу. Декілька груп козаків вийшли потайки в секрети навколо табору.",
                            "imageType": null
                        },
                        {
                            "text": "Стояла повна темрява. Дмитро взяв курінного за плече, козак за ним так само взяв його за плече. Живим ланцюжком два десятки воїнів почали продиратися до річки.",
                            "imageType": null
                        },
                        {
                            "text": "Три групи козаків мали одночасно переплисти Дністер і нагло вдертися до табору гармашів.",
                            "imageType": "river"
                        },
                        {
                            "text": "Дуже далеко було чутно як турецькі вартові перегукуються між собою.",
                            "imageType": null
                        },
                        {
                            "text": "Першими мали переправитися найдосвідченіші воїни і подати умовний сигнал іншим.",
                            "imageType": null
                        }
                    ]
                }
            },
            {
                "text": "Взяти спис",
                "nextPage": {
                    "endType": null,
                    "next": [
                        {
                            "text": "Допомогти курінному",
                            "nextPage": {
                                "endType": "ALIVE",
                                "next": [],
                                "nodes": [
                                    {
                                        "text": "Дмитро відкинув самопал і підхопив курінного. У нього з голови звисав шмат зрубленної шкіри. Від контузії він ледь ворушив губами.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Дмитро поніс його на одному плечі, куріний ледь перебирав ногами. Вони залишили місце саме вчасно.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Група турків згуртувалась навколо офіцера чинила шалений опір. До них збігались інші турченята.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Залп їх мушкетів прийшовся саме в те місце, де Дмитро підхопив курінного.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Він дотягнув його до берега, де уже чекали на поранених. Курінному одразу затисли рану, натуго зав'язавши голову, повантажили на довбанку і попливли на свій берег.",
                                        "imageType": "river"
                                    },
                                    {
                                        "text": "Дмитро повернувся в табір. Здобич була велика. Козаки підносили трофеї ближче до берега. Велику цінність мали харчі, порох та кулі.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Один із козаків, весь в чужій крові, ніс великий тюрбан, який він здер з офіцера.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Дмитро разом з чотирма іншими козаками схопили мішок, всередині якого лежали свинцеві гратки. Вони будуть у нагоді, щоб вилити собі куль.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Табір козаків був у напівоблозі, тож справи з харчами і набоями були кепські.",
                                        "imageType": "camp"
                                    },
                                    {
                                        "text": "Козаки у п'ятьох ледь дотягли свинець, як пролунала команда до відходу.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Частина козаків стала біля берега і хаотично обстрілювала табір, вдаючи бій.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Турки боялися підходити.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Коли всі речі були повантажені, козаки зникли так само швидко, як і з'явилися.",
                                        "imageType": "bulrush"
                                    },
                                    {
                                        "text": "На березі Дмитра зустрів курінний, він уже відійшов від контузії, але не міг сам іти. Курінного підхопили козаки і повели в табір. Інші взялися зносити трофеї.",
                                        "imageType": "river"
                                    },
                                    {
                                        "text": "Тепер табір козаків може дихати вільніше.",
                                        "imageType": null
                                    }
                                ]
                            }
                        },
                        {
                            "text": "Побігти з козаками в засідку.",
                            "nextPage": {
                                "endType": "DEAD",
                                "next": [],
                                "nodes": [
                                    {
                                        "text": "Дмитро схопив самопал і приєднався до засідки.",
                                        "imageType": "forest"
                                    },
                                    {
                                        "text": "Почекавши, коли турки будуть в двадцяти кроках, вони ударили тричі з мушкетів і побігли на турків у рукопашний бій, щоб не дати їм оговтаться.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Дмитро штрикнув пораненого турка, який збирав свої тельбухи з землі і намагався заткнути їх назад.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Інші козаки швидко добили всіх інших. Але в цей час турки встигли підкотити ожигу.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "З першого ж залпу всі козаки з засідки попадали. У когось були перебиті ноги, комусь зірвало голову.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Дмитро отримав найбільше шрапнелі з усіх - відірвало праву ногу, розірвало живіт.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Через десять хвилин козаки відіб'ють тіла. Дмитра покладуть на плотик і швидко переправлять на берег.",
                                        "imageType": null
                                    },
                                    {
                                        "text": "Плотик пристане до землі з Дмитром, який уже порожніми очима буде проводжати свою душу на небо.",
                                        "imageType": "river"
                                    }
                                ]
                            }
                        }
                    ],
                    "nodes": [
                        {
                            "text": "Узявши спис, Дмитро приєднався до групи з курінним, яка тихенько виходила за межі табору.",
                            "imageType": "camp"
                        },
                        {
                            "text": "Попереду йшов Хрипко, він головував обороною табору і знав де стоять козацькі секрети.",
                            "imageType": null
                        },
                        {
                            "text": "Провівши до річки, він залишився чекати на повернення.",
                            "imageType": null
                        },
                        {
                            "text": "Козаки сіли в човники і очікували на команду з іншого берега.",
                            "imageType": null
                        },
                        {
                            "text": "Туди відправилась перша група з 20 козаків, які мали зачистити місце, щоб турки не застали основну групу за висадкою.",
                            "imageType": null
                        },
                        {
                            "text": "Через 10 хвилин в темряві замерехтіли світлі вогники, які стрибали над самою водою. Це був сигнал до переправи.",
                            "imageType": null
                        },
                        {
                            "text": "Атакувати табір було вирішено трьома групами. Всі мали кричати \"Ала ала\" при наскоку, щоб татарським кличем збити з пантелику турків.",
                            "imageType": "camp"
                        },
                        {
                            "text": "П'ятсот кроків до табору козаки ледь не бігли, у турків було чутно клич до караулів, але ніхто не відгукнувся.",
                            "imageType": null
                        },
                        {
                            "text": "Дмитро бачив роботу першої групи: троє турченят лежали в калюжі крові - їм перерізали горлянки.",
                            "imageType": null
                        },
                        {
                            "text": "Декотрі козаки перевдяглись в турецьке, яке зняли з трупів. Таким чином вони хотіли підійти впритул до чатових табора і ударити по ним з самопалів.",
                            "imageType": null
                        },
                        {
                            "text": "Першою напала група козаків справа. Потім, майже одночасно, зліва і з центру. В таборі зчинилася страшна метушня.",
                            "imageType": null
                        },
                        {
                            "text": "Першими залпами козаки убили чатових, один із них перекинув лампу. Вона розбилася і запалила сіно.",
                            "imageType": null
                        },
                        {
                            "text": "Тепер козакам було краще видно, кого різати.",
                            "imageType": null
                        },
                        {
                            "text": "Дмитро підбіг до намету, з якого вискочив турок, вдягнутий лише в штани.",
                            "imageType": "camp"
                        },
                        {
                            "text": "Він не встиг навіть розгледіти Дмитра, як спис увійшов глибоко в живіт.",
                            "imageType": null
                        },
                        {
                            "text": "Ворог склався вдвоє. Козак уперся ногою в стегно турка і зняв його зі списа.",
                            "imageType": null
                        },
                        {
                            "text": "Інші козаки завалили намет. В ньому було ще два турка, які боялись вийти.",
                            "imageType": null
                        },
                        {
                            "text": "Намет підпалили і вони згоріли заживо.",
                            "imageType": null
                        },
                        {
                            "text": "По всьому табору ішла колотнеча. Уцілілі турки тікали в сторону сусіднього табору, з якого уже бігли на допомогу.",
                            "imageType": "cossacks"
                        },
                        {
                            "text": "Частина козаків сіла в засідку, щоб перехопити підмогу. Вони хотіли ударити у фланг туркам, коли ті підійдуть впритул.",
                            "imageType": null
                        },
                        {
                            "text": "Дмитро шукав самопал, щоб приєднатися до засідки. Тут він почув крик по допомогу. Курінний лежав на землі і намагався піднятися. Зі скроні тікла кров. Голову врятувала товста шапка з бобра.",
                            "imageType": null
                        }
                    ]
                }
            }
        ],
        "nodes": [
            {
                "text": "Дмитро не зміг заснути. Вночі мала бути проведена операція по знешкодженню турецьких гармат.",
                "imageType": "camp"
            },
            {
                "text": "Ці гармати було нагло поставлено на іншому березі Дністра. Турки безперешкодно вирівняли майданчик та затягли волами три величезні мортири.",
                "imageType": null
            },
            {
                "text": "Кожна з цих мортир стріляла величезною кам'яною кулею, яка могла задавити чимало війська.",
                "imageType": null
            },
            {
                "text": "За два дні декілька таких снарядів влучило в табір козаків, який стояв на іншому березі. Але, на щастя, ніхто не постраждав.",
                "imageType": null
            },
            {
                "text": "Турки вільно пересувалися біля гармат, бо до їх позицій не добивав ні мушкет, ні лук, ані козацькі гармати.",
                "imageType": "river"
            },
            {
                "text": "Поляки, під час сильного обстрілу з табору козаків, намагалися перейти Дністер та розігнати обслугу мортир.",
                "imageType": null
            },
            {
                "text": "Але постійні роз'їзди татар не дали змогу переправитися на інший берег, і союзники відступили.",
                "imageType": null
            },
            {
                "text": "Тож Сагайдачним було прийнято рішення зробити нічний рейд.",
                "imageType": null
            },
            {
                "text": "Для цього було обрано 70 козаків. Операція трималась у таємниці, адже в таборі могли знаходиться очі і вуха ворога.",
                "imageType": null
            },
            {
                "text": "Дмитро заліз під віз і став вибирати зброю.",
                "imageType": "camp"
            }
        ]
    }
}
